[Killed] MethodExpression
src/inspection/action-history.ts:145:18
       let result = entries.filter((e) => matchesFilter(e, filter));
 
       if (filter.limit !== undefined && filter.limit >= 0) {
-        result = result.slice(-filter.limit);
+        result = result;
       }
 
killedBy: ActionHistory applies limit to results (returns last N)
statusReason: expected [ { id: 'a', …(12) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/inspection/action-history.ts:151:19
       return result;
     },
 
-    clear(): void {
-      entries.length = 0;
-      _seenCount = 0;
-    },
+    clear(): void {},
 
     get size(): number {
killedBy: ActionHistory clears all entries
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/inspection/action-history.ts:156:24
       _seenCount = 0;
     },
 
-    get size(): number {
-      return entries.length;
-    },
+    get size(): number {},
   };
 }
killedBy: ActionHistory records entries in full mode
statusReason: expected undefined to be 1 // Object.is equality
