[Killed] EqualityOperator
src/adapters/cached-clock.ts:27:45
 export function createCachedClock(options: CachedClockOptions): CachedClockAdapterType {
   const { source, updateIntervalMs = 1 } = options;
 
-  if (!Number.isFinite(updateIntervalMs) || updateIntervalMs <= 0) {
+  if (!Number.isFinite(updateIntervalMs) || updateIntervalMs < 0) {
     throw new TypeError(
       `updateIntervalMs must be a positive finite number, got ${updateIntervalMs}`
killedBy: createCachedClock — factory throws TypeError for updateIntervalMs <= 0
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/adapters/cached-clock.ts:27:7
 export function createCachedClock(options: CachedClockOptions): CachedClockAdapterType {
   const { source, updateIntervalMs = 1 } = options;
 
-  if (!Number.isFinite(updateIntervalMs) || updateIntervalMs <= 0) {
+  if (false) {
     throw new TypeError(
       `updateIntervalMs must be a positive finite number, got ${updateIntervalMs}`
killedBy: createCachedClock — factory throws TypeError for updateIntervalMs <= 0
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/adapters/cached-clock.ts:38:17
   let cachedWallClock = source.wallClockNow();
 
   let intervalHandle: ReturnType<typeof setInterval> | undefined;
-  let running = false;
+  let running = true;
 
   const adapter = Object.freeze({
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns false before start()
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/adapters/cached-clock.ts:41:25
   let running = false;
 
   const adapter = Object.freeze({
-    recentMonotonicNow: () => asMonotonic(cachedMonotonic),
+    recentMonotonicNow: () => undefined,
     recentWallClockNow: () => asWallClock(cachedWallClock),
 
killedBy: createCachedClock — factory reads source clock at construction (initial synchronous snapshot)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArrowFunction
src/adapters/cached-clock.ts:42:25
 
   const adapter = Object.freeze({
     recentMonotonicNow: () => asMonotonic(cachedMonotonic),
-    recentWallClockNow: () => asWallClock(cachedWallClock),
+    recentWallClockNow: () => undefined,
 
     start(): void {
killedBy: createCachedClock — factory recentWallClockNow() returns the snapshot wall clock value
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/adapters/cached-clock.ts:44:19
     recentMonotonicNow: () => asMonotonic(cachedMonotonic),
     recentWallClockNow: () => asWallClock(cachedWallClock),
 
-    start(): void {
-      if (running) return;
-      running = true;
-      intervalHandle = setInterval(() => {
-        cachedMonotonic = source.monotonicNow();
-        cachedWallClock = source.wallClockNow();
-      }, updateIntervalMs);
-    },
+    start(): void {},
 
     stop(): void {
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns true after start() and false after stop()
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/cached-clock.ts:45:11
     recentWallClockNow: () => asWallClock(cachedWallClock),
 
     start(): void {
-      if (running) return;
+      if (true) return;
       running = true;
       intervalHandle = setInterval(() => {
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns true after start() and false after stop()
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/cached-clock.ts:45:11
     recentWallClockNow: () => asWallClock(cachedWallClock),
 
     start(): void {
-      if (running) return;
+      if (false) return;
       running = true;
       intervalHandle = setInterval(() => {
killedBy: CachedClock — interval callback updates cached values (kills L48/L49 NoCoverage) start() twice then stop() leaves no leaked interval — value does not update after stop (kills L45 CE=false)
statusReason: expected 2000 to be 1000 // Object.is equality

[Killed] BooleanLiteral
src/adapters/cached-clock.ts:46:17
 
     start(): void {
       if (running) return;
-      running = true;
+      running = false;
       intervalHandle = setInterval(() => {
         cachedMonotonic = source.monotonicNow();
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns true after start() and false after stop()
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/adapters/cached-clock.ts:47:42
     start(): void {
       if (running) return;
       running = true;
-      intervalHandle = setInterval(() => {
-        cachedMonotonic = source.monotonicNow();
-        cachedWallClock = source.wallClockNow();
-      }, updateIntervalMs);
+      intervalHandle = setInterval(() => {}, updateIntervalMs);
     },
 
killedBy: CachedClock — interval callback updates cached values (kills L48/L49 NoCoverage) interval fires and updates cachedMonotonic and cachedWallClock (kills L48/L49)
statusReason: expected 1000 to be 2000 // Object.is equality

[Killed] BooleanLiteral
src/adapters/cached-clock.ts:55:11
 
     stop(): void {
-      if (!running) return;
+      if (running) return;
       running = false;
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns true after start() and false after stop()
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/adapters/cached-clock.ts:56:17
     stop(): void {
       if (!running) return;
-      running = false;
+      running = true;
       if (intervalHandle !== undefined) {
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns true after start() and false after stop()
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/adapters/cached-clock.ts:58:41
       if (!running) return;
       running = false;
-      if (intervalHandle !== undefined) {
-        clearInterval(intervalHandle);
-        intervalHandle = undefined;
-      }
+      if (intervalHandle !== undefined) {}
     },
 
killedBy: CachedClock — interval callback updates cached values (kills L48/L49 NoCoverage) stop() prevents further interval updates — clears the interval handle (kills L56-59 block mutation)
statusReason: expected 3000 to be 2000 // Object.is equality

[Killed] EqualityOperator
src/adapters/cached-clock.ts:58:11
       if (!running) return;
       running = false;
-      if (intervalHandle !== undefined) {
+      if (intervalHandle === undefined) {
         clearInterval(intervalHandle);
         intervalHandle = undefined;
killedBy: CachedClock — interval callback updates cached values (kills L48/L49 NoCoverage) stop() prevents further interval updates — clears the interval handle (kills L56-59 block mutation)
statusReason: expected 3000 to be 2000 // Object.is equality

[Killed] BlockStatement
src/adapters/cached-clock.ts:64:26
       }
     },
 
-    isRunning(): boolean {
-      return running;
-    },
+    isRunning(): boolean {},
   });
 
killedBy: CachedClock — lifecycle (start/stop/isRunning) isRunning() returns false before start()
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/adapters/cached-clock.ts:77:22
   provides: CachedClockPort,
   requires: [ClockPort],
   lifetime: "singleton",
-  factory: (deps) => {
-    const adapter = createCachedClock({ source: deps.Clock });
-    adapter.start();
-    return adapter;
-  },
+  factory: (deps) => {},
 });
 
killedBy: SystemCachedClockAdapter — graph integration SystemCachedClockAdapter resolves CachedClockPort from container
statusReason: Cannot read properties of undefined (reading 'recentMonotonicNow')

[Killed] ObjectLiteral
src/adapters/cached-clock.ts:78:39
   requires: [ClockPort],
   lifetime: "singleton",
   factory: (deps) => {
-    const adapter = createCachedClock({ source: deps.Clock });
+    const adapter = createCachedClock({});
     adapter.start();
     return adapter;
killedBy: SystemCachedClockAdapter — graph integration SystemCachedClockAdapter resolves CachedClockPort from container
statusReason: Factory for port 'CachedClock' threw: Cannot read properties of undefined (reading 'monotonicNow')

[Killed] BlockStatement
src/adapters/cached-clock.ts:93:91
  * Factory function returning a configured SystemCachedClockAdapter with options.
  * Use this when you need a custom updateIntervalMs.
  */
-export function createSystemCachedClockAdapter(options?: SystemCachedClockAdapterOptions) {
-  return createAdapter({
-    provides: CachedClockPort,
-    requires: [ClockPort],
-    lifetime: "singleton",
-    factory: (deps) => {
-      const adapter = createCachedClock({ source: deps.Clock, updateIntervalMs: options?.updateIntervalMs });
-      adapter.start();
-      return adapter;
-    },
-  });
-}
+export function createSystemCachedClockAdapter(options?: SystemCachedClockAdapterOptions) {}
 
killedBy: createSystemCachedClockAdapter — without options resolves CachedClockPort (kills L97 OptionalChaining) createSystemCachedClockAdapter() without options resolves CachedClockPort successfully
statusReason: Cannot read properties of undefined (reading 'provides')

[Killed] StringLiteral
src/adapters/cached-clock.ts:97:15
   return createAdapter({
     provides: CachedClockPort,
     requires: [ClockPort],
-    lifetime: "singleton",
+    lifetime: "",
     factory: (deps) => {
       const adapter = createCachedClock({ source: deps.Clock, updateIntervalMs: options?.updateIntervalMs });
killedBy: createSystemCachedClockAdapter — without options resolves CachedClockPort (kills L97 OptionalChaining) createSystemCachedClockAdapter() without options resolves CachedClockPort successfully
statusReason: ERROR[HEX015]: Invalid adapter config: 'lifetime' must be "singleton", "scoped", "transient", or "request". Got: "".

[Killed] BlockStatement
src/adapters/cached-clock.ts:98:24
     provides: CachedClockPort,
     requires: [ClockPort],
     lifetime: "singleton",
-    factory: (deps) => {
-      const adapter = createCachedClock({ source: deps.Clock, updateIntervalMs: options?.updateIntervalMs });
-      adapter.start();
-      return adapter;
-    },
+    factory: (deps) => {},
   });
 }
killedBy: createSystemCachedClockAdapter — without options resolves CachedClockPort (kills L97 OptionalChaining) createSystemCachedClockAdapter() without options resolves CachedClockPort successfully
statusReason: Cannot read properties of undefined (reading 'recentMonotonicNow')

[Killed] OptionalChaining
src/adapters/cached-clock.ts:99:81
     requires: [ClockPort],
     lifetime: "singleton",
     factory: (deps) => {
-      const adapter = createCachedClock({ source: deps.Clock, updateIntervalMs: options?.updateIntervalMs });
+      const adapter = createCachedClock({ source: deps.Clock, updateIntervalMs: options.updateIntervalMs });
       adapter.start();
       return adapter;
killedBy: createSystemCachedClockAdapter — without options resolves CachedClockPort (kills L97 OptionalChaining) createSystemCachedClockAdapter() without options resolves CachedClockPort successfully
statusReason: Factory for port 'CachedClock' threw: Cannot read properties of undefined (reading 'updateIntervalMs')
