[Killed] BlockStatement
src/errors/assert-never.ts:32:68
  * @since v1.0.0
  * @see spec/result/behaviors/08-error-patterns.md — BEH-08-002
  */
-export function assertNever(value: never, message?: string): never {
-  throw new Error(message ?? `Unexpected value: ${JSON.stringify(value)}`);
-}
+export function assertNever(value: never, message?: string): never {}
 
killedBy: Error Patterns assertNever throws with custom message when provided
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/errors/assert-never.ts:33:19
  * @see spec/result/behaviors/08-error-patterns.md — BEH-08-002
  */
 export function assertNever(value: never, message?: string): never {
-  throw new Error(message ?? `Unexpected value: ${JSON.stringify(value)}`);
+  throw new Error(message && `Unexpected value: ${JSON.stringify(value)}`);
 }
 
killedBy: Error Patterns assertNever throws with custom message when provided
statusReason: expected [Function] to throw error including 'custom message' but got 'Unexpected value: "unexpected"'

[Killed] StringLiteral
src/errors/assert-never.ts:33:30
  * @see spec/result/behaviors/08-error-patterns.md — BEH-08-002
  */
 export function assertNever(value: never, message?: string): never {
-  throw new Error(message ?? `Unexpected value: ${JSON.stringify(value)}`);
+  throw new Error(message ?? ``);
 }
 
killedBy: Error Patterns assertNever default message includes the value
statusReason: expected [Function] to throw error including 'Unexpected value' but got ''
