[Killed] OptionalChaining
src/clock-context.ts:97:14
 
     // Stryker disable next-line BlockStatement -- UNKILLABLE: get() body is always-undefined when init() fails in Stryker sandbox
     get(): ClockContext | undefined {
-      return storage?.getStore();
+      return storage.getStore();
     },
 
killedBy: createClockContext() get() returns undefined outside of run() (before init)
statusReason: Cannot read properties of undefined (reading 'getStore')

[Killed] BlockStatement
src/clock-context.ts:100:47
       return storage?.getStore();
     },
 
-    run<T>(ctx: ClockContext, fn: () => T): T {
-      // Stryker disable next-line ConditionalExpression,BlockStatement -- UNKILLABLE: storage is never set when init() fails in Stryker sandbox
-      if (storage !== undefined) {
-        return storage.run(Object.freeze(ctx), fn);
-      }
-      return fn();
-    },
+    run<T>(ctx: ClockContext, fn: () => T): T {},
   });
 }
killedBy: createClockContext() run() invokes the callback immediately (without AsyncLocalStorage, acts as passthrough)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/clock-context.ts:102:11
 
     run<T>(ctx: ClockContext, fn: () => T): T {
       // Stryker disable next-line ConditionalExpression,BlockStatement -- UNKILLABLE: storage is never set when init() fails in Stryker sandbox
-      if (storage !== undefined) {
+      if (storage === undefined) {
         return storage.run(Object.freeze(ctx), fn);
       }
killedBy: createClockContext() run() invokes the callback immediately (without AsyncLocalStorage, acts as passthrough)
statusReason: Cannot read properties of undefined (reading 'run')
