[Killed] BlockStatement
src/deserialization.ts:30:26
   readonly actualVersion?: number;
   readonly field?: string;
   readonly message: string;
-}): DeserializationError {
-  return Object.freeze({
-    _tag: "DeserializationError" as const,
-    schemaType: args.schemaType,
-    expectedVersions: args.expectedVersions,
-    actualVersion: args.actualVersion,
-    field: args.field,
-    message: args.message,
-  });
-}
+}): DeserializationError {}
 
 /** Check if a value is a plain object. */
killedBy: deserializeTemporalContext returns Err when sequenceNumber is missing
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/deserialization.ts:42:69
 }
 
 /** Check if a value is a plain object. */
-function isObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
-}
+function isObject(value: unknown): value is Record<string, unknown> {}
 
 /**
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/deserialization.ts:43:57
 
 /** Check if a value is a plain object. */
 function isObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value !== null && Array.isArray(value);
 }
 
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/deserialization.ts:43:39
 
 /** Check if a value is a plain object. */
 function isObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === "object" && value !== null && !Array.isArray(value);
+  return typeof value === "object" && value === null && !Array.isArray(value);
 }
 
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:53:7
 export function deserializeTemporalContext(
   raw: unknown
 ): Result<TemporalContext, DeserializationError> {
-  if (!isObject(raw)) {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/deserialization.ts:53:7
 export function deserializeTemporalContext(
   raw: unknown
 ): Result<TemporalContext, DeserializationError> {
-  if (!isObject(raw)) {
+  if (isObject(raw)) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:56:21
   if (!isObject(raw)) {
     return err(
       createDeserializationError({
-        schemaType: "TemporalContext",
+        schemaType: "",
         expectedVersions: [1],
         message: "Expected an object",
killedBy: deserializeTemporalContext — exact error field assertions non-object error has schemaType='TemporalContext', expectedVersions=[1], message, field=undefined
statusReason: expected '' to be 'TemporalContext' // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:63:7
     );
   }
 
-  if (typeof raw.sequenceNumber !== "number") {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Err when sequenceNumber is missing
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:63:7
     );
   }
 
-  if (typeof raw.sequenceNumber !== "number") {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/deserialization.ts:65:34
 
   if (typeof raw.sequenceNumber !== "number") {
     return err(
-      createDeserializationError({
-        schemaType: "TemporalContext",
-        expectedVersions: [1],
-        field: "sequenceNumber",
-        message: "Field 'sequenceNumber' must be a number",
-      })
+      createDeserializationError({})
     );
   }
killedBy: deserializeTemporalContext — exact error field assertions missing sequenceNumber: field='sequenceNumber', message and schemaType correct
statusReason: expected undefined to be 'TemporalContext' // Object.is equality

[Killed] EqualityOperator
src/deserialization.ts:74:7
     );
   }
 
-  if (typeof raw.monotonicTimestamp !== "number") {
+  if (typeof raw.monotonicTimestamp === "number") {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:74:7
     );
   }
 
-  if (typeof raw.monotonicTimestamp !== "number") {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Err when monotonicTimestamp is missing
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/deserialization.ts:85:51
     );
   }
 
-  if (typeof raw.wallClockTimestamp !== "number") {
-    return err(
-      createDeserializationError({
-        schemaType: "TemporalContext",
-        expectedVersions: [1],
-        field: "wallClockTimestamp",
-        message: "Field 'wallClockTimestamp' must be a number",
-      })
-    );
-  }
+  if (typeof raw.wallClockTimestamp !== "number") {}
 
   const ctx: TemporalContext = Object.freeze({
killedBy: deserializeTemporalContext returns Err when wallClockTimestamp is missing
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:85:7
     );
   }
 
-  if (typeof raw.wallClockTimestamp !== "number") {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/deserialization.ts:89:27
     return err(
       createDeserializationError({
         schemaType: "TemporalContext",
-        expectedVersions: [1],
+        expectedVersions: [],
         field: "wallClockTimestamp",
         message: "Field 'wallClockTimestamp' must be a number",
killedBy: deserializeTemporalContext — exact error field assertions missing wallClockTimestamp: field='wallClockTimestamp', message and schemaType correct
statusReason: expected [] to deeply equal [ 1 ]

[Killed] ObjectLiteral
src/deserialization.ts:96:46
     );
   }
 
-  const ctx: TemporalContext = Object.freeze({
-    sequenceNumber: raw.sequenceNumber,
-    monotonicTimestamp: asMonotonic(raw.monotonicTimestamp),
-    wallClockTimestamp: asWallClock(raw.wallClockTimestamp),
-  });
+  const ctx: TemporalContext = Object.freeze({});
 
   return ok(ctx);
killedBy: deserializeTemporalContext returns Ok for valid v1 TemporalContext JSON
statusReason: expected undefined to be 42 // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:111:7
 export function deserializeOverflowTemporalContext(
   raw: unknown
 ): Result<OverflowTemporalContext, DeserializationError> {
-  if (!isObject(raw)) {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when input is null
statusReason: Cannot read properties of null (reading '_tag')

[Killed] BooleanLiteral
src/deserialization.ts:111:7
 export function deserializeOverflowTemporalContext(
   raw: unknown
 ): Result<OverflowTemporalContext, DeserializationError> {
-  if (!isObject(raw)) {
+  if (isObject(raw)) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext returns Ok for valid v1 OverflowTemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:114:21
   if (!isObject(raw)) {
     return err(
       createDeserializationError({
-        schemaType: "OverflowTemporalContext",
+        schemaType: "",
         expectedVersions: [1],
         message: "Expected an object",
killedBy: deserializeOverflowTemporalContext — exact error field assertions non-object error has schemaType='OverflowTemporalContext', expectedVersions=[1], no field
statusReason: expected '' to be 'OverflowTemporalContext' // Object.is equality

[Killed] ArrayDeclaration
src/deserialization.ts:115:27
     return err(
       createDeserializationError({
         schemaType: "OverflowTemporalContext",
-        expectedVersions: [1],
+        expectedVersions: [],
         message: "Expected an object",
       })
killedBy: deserializeOverflowTemporalContext — exact error field assertions non-object error has schemaType='OverflowTemporalContext', expectedVersions=[1], no field
statusReason: expected [] to deeply equal [ 1 ]

[Killed] BlockStatement
src/deserialization.ts:121:47
     );
   }
 
-  if (raw._tag !== "OverflowTemporalContext") {
-    return err(
-      createDeserializationError({
-        schemaType: "OverflowTemporalContext",
-        expectedVersions: [1],
-        field: "_tag",
-        message: "Field '_tag' must be 'OverflowTemporalContext'",
-      })
-    );
-  }
+  if (raw._tag !== "OverflowTemporalContext") {}
 
   if (raw.sequenceNumber !== -1) {
killedBy: deserializeOverflowTemporalContext returns Err when _tag is not 'OverflowTemporalContext'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/deserialization.ts:121:7
     );
   }
 
-  if (raw._tag !== "OverflowTemporalContext") {
+  if (raw._tag === "OverflowTemporalContext") {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext returns Ok for valid v1 OverflowTemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:127:18
         schemaType: "OverflowTemporalContext",
         expectedVersions: [1],
         field: "_tag",
-        message: "Field '_tag' must be 'OverflowTemporalContext'",
+        message: "",
       })
     );
killedBy: deserializeOverflowTemporalContext — exact error field assertions wrong _tag: field='_tag', message correct
statusReason: expected '' to be 'Field \'_tag\' must be \'OverflowTemp…' // Object.is equality

[Killed] BlockStatement
src/deserialization.ts:132:34
     );
   }
 
-  if (raw.sequenceNumber !== -1) {
-    return err(
-      createDeserializationError({
-        schemaType: "OverflowTemporalContext",
-        expectedVersions: [1],
-        field: "sequenceNumber",
-        message: "Field 'sequenceNumber' must be -1",
-      })
-    );
-  }
+  if (raw.sequenceNumber !== -1) {}
 
   if (typeof raw.lastValidSequenceNumber !== "number") {
killedBy: deserializeOverflowTemporalContext returns Err when sequenceNumber is not -1
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:132:7
     );
   }
 
-  if (raw.sequenceNumber !== -1) {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext returns Ok for valid v1 OverflowTemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:143:7
     );
   }
 
-  if (typeof raw.lastValidSequenceNumber !== "number") {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext returns Ok for valid v1 OverflowTemporalContext JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:143:7
     );
   }
 
-  if (typeof raw.lastValidSequenceNumber !== "number") {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when lastValidSequenceNumber is missing
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/deserialization.ts:154:51
     );
   }
 
-  if (typeof raw.monotonicTimestamp !== "number") {
-    return err(
-      createDeserializationError({
-        schemaType: "OverflowTemporalContext",
-        expectedVersions: [1],
-        field: "monotonicTimestamp",
-        message: "Field 'monotonicTimestamp' must be a number",
-      })
-    );
-  }
+  if (typeof raw.monotonicTimestamp !== "number") {}
 
   if (typeof raw.wallClockTimestamp !== "number") {
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when monotonicTimestamp is missing
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:159:16
       createDeserializationError({
         schemaType: "OverflowTemporalContext",
         expectedVersions: [1],
-        field: "monotonicTimestamp",
+        field: "",
         message: "Field 'monotonicTimestamp' must be a number",
       })
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when monotonicTimestamp is missing
statusReason: expected '' to be 'monotonicTimestamp' // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:160:18
         schemaType: "OverflowTemporalContext",
         expectedVersions: [1],
         field: "monotonicTimestamp",
-        message: "Field 'monotonicTimestamp' must be a number",
+        message: "",
       })
     );
killedBy: deserializeOverflowTemporalContext — exact error field assertions missing monotonicTimestamp (with lastValidSequenceNumber): message correct
statusReason: expected '' to be 'Field \'monotonicTimestamp\' must be …' // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:165:7
     );
   }
 
-  if (typeof raw.wallClockTimestamp !== "number") {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when wallClockTimestamp is missing
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/deserialization.ts:165:51
     );
   }
 
-  if (typeof raw.wallClockTimestamp !== "number") {
-    return err(
-      createDeserializationError({
-        schemaType: "OverflowTemporalContext",
-        expectedVersions: [1],
-        field: "wallClockTimestamp",
-        message: "Field 'wallClockTimestamp' must be a number",
-      })
-    );
-  }
+  if (typeof raw.wallClockTimestamp !== "number") {}
 
   const ctx: OverflowTemporalContext = Object.freeze({
killedBy: deserializeOverflowTemporalContext — additional coverage returns Err when wallClockTimestamp is missing
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:171:18
         schemaType: "OverflowTemporalContext",
         expectedVersions: [1],
         field: "wallClockTimestamp",
-        message: "Field 'wallClockTimestamp' must be a number",
+        message: "",
       })
     );
killedBy: deserializeOverflowTemporalContext — exact error field assertions missing wallClockTimestamp (with all others): message correct
statusReason: expected '' to be 'Field \'wallClockTimestamp\' must be …' // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:193:7
 export function deserializeClockDiagnostics(
   raw: unknown
 ): Result<ClockDiagnostics, DeserializationError> {
-  if (!isObject(raw)) {
+  if (false) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics — additional coverage returns Err when input is not an object (null, string, array)
statusReason: Cannot read properties of null (reading 'adapterName')

[Killed] ConditionalExpression
src/deserialization.ts:193:7
 export function deserializeClockDiagnostics(
   raw: unknown
 ): Result<ClockDiagnostics, DeserializationError> {
-  if (!isObject(raw)) {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/deserialization.ts:195:34
 ): Result<ClockDiagnostics, DeserializationError> {
   if (!isObject(raw)) {
     return err(
-      createDeserializationError({
-        schemaType: "ClockDiagnostics",
-        expectedVersions: [1],
-        message: "Expected an object",
-      })
+      createDeserializationError({})
     );
   }
killedBy: deserializeClockDiagnostics — exact error field assertions non-object error has schemaType='ClockDiagnostics', no field, correct message
statusReason: expected undefined to be 'ClockDiagnostics' // Object.is equality

[Killed] ArrayDeclaration
src/deserialization.ts:197:27
     return err(
       createDeserializationError({
         schemaType: "ClockDiagnostics",
-        expectedVersions: [1],
+        expectedVersions: [],
         message: "Expected an object",
       })
killedBy: deserializeClockDiagnostics — exact error field assertions non-object error has schemaType='ClockDiagnostics', no field, correct message
statusReason: expected [] to deeply equal [ 1 ]

[Killed] StringLiteral
src/deserialization.ts:198:18
       createDeserializationError({
         schemaType: "ClockDiagnostics",
         expectedVersions: [1],
-        message: "Expected an object",
+        message: "",
       })
     );
killedBy: deserializeClockDiagnostics — exact error field assertions non-object error has schemaType='ClockDiagnostics', no field, correct message
statusReason: expected '' to be 'Expected an object' // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:203:7
     );
   }
 
-  if (typeof raw.adapterName !== "string") {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/deserialization.ts:203:7
     );
   }
 
-  if (typeof raw.adapterName !== "string") {
+  if (typeof raw.adapterName === "string") {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:215:7
   }
 
   const validMonotonicSources = ["performance.now", "Date.now-clamped", "host-bridge"] as const;
-  if (!validMonotonicSources.includes(raw.monotonicSource as (typeof validMonotonicSources)[number])) {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/deserialization.ts:215:103
   }
 
   const validMonotonicSources = ["performance.now", "Date.now-clamped", "host-bridge"] as const;
-  if (!validMonotonicSources.includes(raw.monotonicSource as (typeof validMonotonicSources)[number])) {
-    return err(
-      createDeserializationError({
-        schemaType: "ClockDiagnostics",
-        expectedVersions: [1],
-        field: "monotonicSource",
-        message: `Field 'monotonicSource' must be one of: ${validMonotonicSources.join(", ")}`,
-      })
-    );
-  }
+  if (!validMonotonicSources.includes(raw.monotonicSource as (typeof validMonotonicSources)[number])) {}
 
   const validHighResSources = [
killedBy: deserializeClockDiagnostics returns Err when monotonicSource is not a known enum value
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:221:88
         schemaType: "ClockDiagnostics",
         expectedVersions: [1],
         field: "monotonicSource",
-        message: `Field 'monotonicSource' must be one of: ${validMonotonicSources.join(", ")}`,
+        message: `Field 'monotonicSource' must be one of: ${validMonotonicSources.join("")}`,
       })
     );
killedBy: deserializeClockDiagnostics — exact error field assertions invalid monotonicSource: error message contains comma-separated list with separator (kills L221 StringLiteral)
statusReason: expected 'Field \'monotonicSource\' must be one…' to contain 'performance.now, '

[Killed] ConditionalExpression
src/deserialization.ts:232:7
     "host-bridge",
     "host-bridge-wallclock",
   ] as const;
-  if (!validHighResSources.includes(raw.highResSource as (typeof validHighResSources)[number])) {
+  if (true) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/deserialization.ts:232:7
     "host-bridge",
     "host-bridge-wallclock",
   ] as const;
-  if (!validHighResSources.includes(raw.highResSource as (typeof validHighResSources)[number])) {
+  if (validHighResSources.includes(raw.highResSource as (typeof validHighResSources)[number])) {
     return err(
       createDeserializationError({
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:237:16
       createDeserializationError({
         schemaType: "ClockDiagnostics",
         expectedVersions: [1],
-        field: "highResSource",
+        field: "",
         message: `Field 'highResSource' must be one of: ${validHighResSources.join(", ")}`,
       })
killedBy: deserializeClockDiagnostics — additional coverage returns Err when highResSource is invalid
statusReason: expected '' to be 'highResSource' // Object.is equality

[Killed] StringLiteral
src/deserialization.ts:238:18
         schemaType: "ClockDiagnostics",
         expectedVersions: [1],
         field: "highResSource",
-        message: `Field 'highResSource' must be one of: ${validHighResSources.join(", ")}`,
+        message: ``,
       })
     );
killedBy: deserializeClockDiagnostics — exact error field assertions invalid highResSource: field='highResSource', message contains valid values
statusReason: expected '' to contain 'highResSource'

[Killed] ObjectLiteral
src/deserialization.ts:243:55
     );
   }
 
-  const diagnostics: ClockDiagnostics = Object.freeze({
-    adapterName: raw.adapterName,
-    monotonicSource: raw.monotonicSource as ClockDiagnostics["monotonicSource"],
-    highResSource: raw.highResSource as ClockDiagnostics["highResSource"],
-    platformResolutionMs:
-      // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-number guard on L250 catches both; || vs && produces identical result for any actual input
-      raw.platformResolutionMs === undefined || raw.platformResolutionMs === null
-        ? undefined
-        : typeof raw.platformResolutionMs === "number"
-          ? raw.platformResolutionMs
-          : undefined,
-    cryptoFipsMode:
-      // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-boolean guard on L256 catches both; || vs && produces identical result for any actual input
-      raw.cryptoFipsMode === undefined || raw.cryptoFipsMode === null
-        ? undefined
-        : typeof raw.cryptoFipsMode === "boolean"
-          ? raw.cryptoFipsMode
-          : undefined,
-  });
+  const diagnostics: ClockDiagnostics = Object.freeze({});
 
   return ok(diagnostics);
killedBy: deserializeClockDiagnostics returns Ok for valid v1 ClockDiagnostics JSON
statusReason: expected undefined to be 'SystemClockAdapter' // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:251:11
       // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-number guard on L250 catches both; || vs && produces identical result for any actual input
       raw.platformResolutionMs === undefined || raw.platformResolutionMs === null
         ? undefined
-        : typeof raw.platformResolutionMs === "number"
+        : true
           ? raw.platformResolutionMs
           : undefined,
killedBy: deserializeClockDiagnostics — additional coverage platformResolutionMs = string → result field is undefined (wrong type)
statusReason: expected '0.001' to be undefined

[Killed] ConditionalExpression
src/deserialization.ts:251:11
       // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-number guard on L250 catches both; || vs && produces identical result for any actual input
       raw.platformResolutionMs === undefined || raw.platformResolutionMs === null
         ? undefined
-        : typeof raw.platformResolutionMs === "number"
+        : false
           ? raw.platformResolutionMs
           : undefined,
killedBy: deserializeClockDiagnostics — additional coverage platformResolutionMs = 0.001 → result field is 0.001
statusReason: expected undefined to be 0.001 // Object.is equality

[Killed] EqualityOperator
src/deserialization.ts:258:11
       // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-boolean guard on L256 catches both; || vs && produces identical result for any actual input
       raw.cryptoFipsMode === undefined || raw.cryptoFipsMode === null
         ? undefined
-        : typeof raw.cryptoFipsMode === "boolean"
+        : typeof raw.cryptoFipsMode !== "boolean"
           ? raw.cryptoFipsMode
           : undefined,
killedBy: deserializeClockDiagnostics — additional coverage cryptoFipsMode = false → result field is false
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/deserialization.ts:258:11
       // Stryker disable next-line all -- EQUIVALENT: null/undefined distinction is irrelevant; typeof-boolean guard on L256 catches both; || vs && produces identical result for any actual input
       raw.cryptoFipsMode === undefined || raw.cryptoFipsMode === null
         ? undefined
-        : typeof raw.cryptoFipsMode === "boolean"
+        : false
           ? raw.cryptoFipsMode
           : undefined,
killedBy: deserializeClockDiagnostics — additional coverage cryptoFipsMode = false → result field is false
statusReason: expected undefined to be false // Object.is equality
