[Killed] BlockStatement
src/testing/virtual-clock.ts:30:20
   parameter: string,
   value: number,
   message: string
-): ClockRangeError {
-  return Object.freeze({
-    _tag: "ClockRangeError" as const,
-    parameter,
-    value,
-    message,
-  });
-}
+): ClockRangeError {}
 
 /** Mutable time values for the virtual clock. */
killedBy: GxP Clock Compliance createClockRangeError() returns a frozen object with _tag 'ClockRangeError'
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ObjectLiteral
src/testing/virtual-clock.ts:31:24
   value: number,
   message: string
 ): ClockRangeError {
-  return Object.freeze({
-    _tag: "ClockRangeError" as const,
-    parameter,
-    value,
-    message,
-  });
+  return Object.freeze({});
 }
 
killedBy: VirtualClock advance() with negative value returns err(ClockRangeError)
statusReason: expected undefined to be 'ClockRangeError' // Object.is equality

[Killed] BlockStatement
src/testing/virtual-clock.ts:55:64
 }
 
 /** Validate that a value is finite (no NaN, no Infinity). */
-function assertFiniteOption(value: number, name: string): void {
-  if (!Number.isFinite(value)) {
-    throw new TypeError(
-      `VirtualClock option '${name}' must be a finite number, got ${value}`
-    );
-  }
-}
+function assertFiniteOption(value: number, name: string): void {}
 
 /**
killedBy: VirtualClock createVirtualClock() throws TypeError when initialMonotonic is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/testing/virtual-clock.ts:56:32
 
 /** Validate that a value is finite (no NaN, no Infinity). */
 function assertFiniteOption(value: number, name: string): void {
-  if (!Number.isFinite(value)) {
-    throw new TypeError(
-      `VirtualClock option '${name}' must be a finite number, got ${value}`
-    );
-  }
+  if (!Number.isFinite(value)) {}
 }
 
killedBy: VirtualClock createVirtualClock() throws TypeError when initialMonotonic is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:56:7
 
 /** Validate that a value is finite (no NaN, no Infinity). */
 function assertFiniteOption(value: number, name: string): void {
-  if (!Number.isFinite(value)) {
+  if (true) {
     throw new TypeError(
       `VirtualClock option '${name}' must be a finite number, got ${value}`
killedBy: measure() — durationMs is subtraction, not addition measure() returns durationMs=0 for instant fn with non-zero clock start
statusReason: VirtualClock option 'initialMonotonic' must be a finite number, got 100

[Killed] StringLiteral
src/testing/virtual-clock.ts:58:7
 function assertFiniteOption(value: number, name: string): void {
   if (!Number.isFinite(value)) {
     throw new TypeError(
-      `VirtualClock option '${name}' must be a finite number, got ${value}`
+      ``
     );
   }
killedBy: VirtualClock — option validation error messages initialMonotonic: NaN throws message containing 'must be a finite'
statusReason: expected [Function] to throw error matching /must be a finite/ but got ''

[Killed] OptionalChaining
src/testing/virtual-clock.ts:85:28
  * NOT frozen — mutable internal state required for advance(), set(), etc.
  */
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
-  const initialMonotonic = options?.initialMonotonic ?? 0;
+  const initialMonotonic = options.initialMonotonic ?? 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
killedBy: setupPeriodicClockEvaluation() DoD35-1: starts periodic interval via TimerSchedulerPort at configured intervalMs
statusReason: Cannot read properties of undefined (reading 'initialMonotonic')

[Killed] LogicalOperator
src/testing/virtual-clock.ts:85:28
  * NOT frozen — mutable internal state required for advance(), set(), etc.
  */
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
-  const initialMonotonic = options?.initialMonotonic ?? 0;
+  const initialMonotonic = options?.initialMonotonic && 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
killedBy: setupPeriodicClockEvaluation() DoD35-2: calls getDiagnostics() and getCapabilities() on each interval cycle
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] OptionalChaining
src/testing/virtual-clock.ts:86:28
  */
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
   const initialMonotonic = options?.initialMonotonic ?? 0;
-  const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
+  const initialWallClock = options.initialWallClock ?? DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
   const initialAutoAdvance = options?.autoAdvance ?? 0;
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: Cannot read properties of undefined (reading 'initialWallClock')

[Killed] LogicalOperator
src/testing/virtual-clock.ts:86:28
  */
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
   const initialMonotonic = options?.initialMonotonic ?? 0;
-  const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
+  const initialWallClock = options?.initialWallClock && DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
   const initialAutoAdvance = options?.autoAdvance ?? 0;
killedBy: setupPeriodicClockEvaluation() DoD35-7: does not invoke onDriftDetected when drift is within driftThresholdMs
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/testing/virtual-clock.ts:87:26
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
   const initialMonotonic = options?.initialMonotonic ?? 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
-  const initialHighRes = options?.initialHighRes ?? initialWallClock;
+  const initialHighRes = options?.initialHighRes && initialWallClock;
   const initialAutoAdvance = options?.autoAdvance ?? 0;
 
killedBy: VirtualClock jumpWallClock() moves wallClock and highRes but not monotonic
statusReason: expected NaN to be 1707753605000 // Object.is equality

[Killed] OptionalChaining
src/testing/virtual-clock.ts:87:26
 export function createVirtualClock(options?: VirtualClockOptions): VirtualClockAdapterInterface {
   const initialMonotonic = options?.initialMonotonic ?? 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
-  const initialHighRes = options?.initialHighRes ?? initialWallClock;
+  const initialHighRes = options.initialHighRes ?? initialWallClock;
   const initialAutoAdvance = options?.autoAdvance ?? 0;
 
killedBy: setupPeriodicClockEvaluation() DoD35-1: starts periodic interval via TimerSchedulerPort at configured intervalMs
statusReason: Cannot read properties of undefined (reading 'initialHighRes')

[Killed] LogicalOperator
src/testing/virtual-clock.ts:88:30
   const initialMonotonic = options?.initialMonotonic ?? 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
-  const initialAutoAdvance = options?.autoAdvance ?? 0;
+  const initialAutoAdvance = options?.autoAdvance && 0;
 
   // Validate options — reject non-finite values only
killedBy: VirtualClock auto-advance createVirtualClock({ autoAdvance: 10 }): first monotonicNow() returns 0, second returns 10
statusReason: expected +0 to be 10 // Object.is equality

[Killed] OptionalChaining
src/testing/virtual-clock.ts:88:30
   const initialMonotonic = options?.initialMonotonic ?? 0;
   const initialWallClock = options?.initialWallClock ?? DEFAULT_WALL_CLOCK;
   const initialHighRes = options?.initialHighRes ?? initialWallClock;
-  const initialAutoAdvance = options?.autoAdvance ?? 0;
+  const initialAutoAdvance = options.autoAdvance ?? 0;
 
   // Validate options — reject non-finite values only
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: Cannot read properties of undefined (reading 'autoAdvance')

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:91:7
   const initialAutoAdvance = options?.autoAdvance ?? 0;
 
   // Validate options — reject non-finite values only
-  if (options?.initialMonotonic !== undefined) {
+  if (false) {
     assertFiniteOption(options.initialMonotonic, "initialMonotonic");
   }
killedBy: VirtualClock createVirtualClock() throws TypeError when initialMonotonic is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] OptionalChaining
src/testing/virtual-clock.ts:91:7
   const initialAutoAdvance = options?.autoAdvance ?? 0;
 
   // Validate options — reject non-finite values only
-  if (options?.initialMonotonic !== undefined) {
+  if (options.initialMonotonic !== undefined) {
     assertFiniteOption(options.initialMonotonic, "initialMonotonic");
   }
killedBy: VirtualClock createVirtualClock() with defaults: monotonicNow returns 0
statusReason: Cannot read properties of undefined (reading 'initialMonotonic')

[Killed] EqualityOperator
src/testing/virtual-clock.ts:94:7
   if (options?.initialMonotonic !== undefined) {
     assertFiniteOption(options.initialMonotonic, "initialMonotonic");
   }
-  if (options?.initialWallClock !== undefined) {
+  if (options?.initialWallClock === undefined) {
     assertFiniteOption(options.initialWallClock, "initialWallClock");
   }
killedBy: VirtualClock createVirtualClock() with defaults: monotonicNow returns 0
statusReason: Cannot read properties of undefined (reading 'initialWallClock')

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:94:7
   if (options?.initialMonotonic !== undefined) {
     assertFiniteOption(options.initialMonotonic, "initialMonotonic");
   }
-  if (options?.initialWallClock !== undefined) {
+  if (true) {
     assertFiniteOption(options.initialWallClock, "initialWallClock");
   }
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: Cannot read properties of undefined (reading 'initialWallClock')

[Killed] EqualityOperator
src/testing/virtual-clock.ts:97:7
   if (options?.initialWallClock !== undefined) {
     assertFiniteOption(options.initialWallClock, "initialWallClock");
   }
-  if (options?.initialHighRes !== undefined) {
+  if (options?.initialHighRes === undefined) {
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
killedBy: VirtualClock createVirtualClock() with defaults: monotonicNow returns 0
statusReason: Cannot read properties of undefined (reading 'initialHighRes')

[Killed] OptionalChaining
src/testing/virtual-clock.ts:97:7
   if (options?.initialWallClock !== undefined) {
     assertFiniteOption(options.initialWallClock, "initialWallClock");
   }
-  if (options?.initialHighRes !== undefined) {
+  if (options.initialHighRes !== undefined) {
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
killedBy: VirtualClock createVirtualClock() with defaults: monotonicNow returns 0
statusReason: Cannot read properties of undefined (reading 'initialHighRes')

[Killed] OptionalChaining
src/testing/virtual-clock.ts:100:7
   if (options?.initialHighRes !== undefined) {
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
-  if (options?.autoAdvance !== undefined) {
+  if (options.autoAdvance !== undefined) {
     if (!Number.isFinite(options.autoAdvance) || options.autoAdvance < 0) {
       throw new TypeError(
killedBy: VirtualClock createVirtualClock() with defaults: monotonicNow returns 0
statusReason: Cannot read properties of undefined (reading 'autoAdvance')

[Killed] BlockStatement
src/testing/virtual-clock.ts:100:43
   if (options?.initialHighRes !== undefined) {
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
-  if (options?.autoAdvance !== undefined) {
-    if (!Number.isFinite(options.autoAdvance) || options.autoAdvance < 0) {
-      throw new TypeError(
-        `VirtualClock option 'autoAdvance' must be a non-negative finite number, got ${options.autoAdvance}`
-      );
-    }
-  }
+  if (options?.autoAdvance !== undefined) {}
 
   let monotonic = initialMonotonic;
killedBy: VirtualClock auto-advance createVirtualClock() throws TypeError when autoAdvance is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/testing/virtual-clock.ts:101:50
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
   if (options?.autoAdvance !== undefined) {
-    if (!Number.isFinite(options.autoAdvance) || options.autoAdvance < 0) {
+    if (!Number.isFinite(options.autoAdvance) || options.autoAdvance >= 0) {
       throw new TypeError(
         `VirtualClock option 'autoAdvance' must be a non-negative finite number, got ${options.autoAdvance}`
killedBy: VirtualClock auto-advance createVirtualClock({ autoAdvance: 10 }): first monotonicNow() returns 0, second returns 10
statusReason: VirtualClock option 'autoAdvance' must be a non-negative finite number, got 10

[Killed] EqualityOperator
src/testing/virtual-clock.ts:101:50
     assertFiniteOption(options.initialHighRes, "initialHighRes");
   }
   if (options?.autoAdvance !== undefined) {
-    if (!Number.isFinite(options.autoAdvance) || options.autoAdvance < 0) {
+    if (!Number.isFinite(options.autoAdvance) || options.autoAdvance <= 0) {
       throw new TypeError(
         `VirtualClock option 'autoAdvance' must be a non-negative finite number, got ${options.autoAdvance}`
killedBy: VirtualClock — option validation error messages autoAdvance: 0 (via constructor) is valid — does NOT throw
statusReason: expected [Function] to not throw an error but 'TypeError: VirtualClock option \'auto…' was thrown

[Killed] ArrayDeclaration
src/testing/virtual-clock.ts:113:57
   let highRes = initialHighRes;
   let autoAdvanceMs = initialAutoAdvance;
 
-  const advanceListeners: Array<(ms: number) => void> = [];
+  const advanceListeners: Array<(ms: number) => void> = ["Stryker was here"];
 
   const doAdvance = (ms: number): void => {
killedBy: delay() delegates to scheduler.sleep()
statusReason: listener is not a function

[Killed] BlockStatement
src/testing/virtual-clock.ts:115:43
 
   const advanceListeners: Array<(ms: number) => void> = [];
 
-  const doAdvance = (ms: number): void => {
-    monotonic += ms;
-    wallClock += ms;
-    highRes += ms;
-    for (const listener of advanceListeners) {
-      listener(ms);
-    }
-  };
+  const doAdvance = (ms: number): void => {};
 
   // The VirtualClockAdapterInterface is NOT frozen
killedBy: VirtualClock advance() moves all three time functions forward
statusReason: expected +0 to be 100 // Object.is equality

[Killed] AssignmentOperator
src/testing/virtual-clock.ts:116:5
   const advanceListeners: Array<(ms: number) => void> = [];
 
   const doAdvance = (ms: number): void => {
-    monotonic += ms;
+    monotonic -= ms;
     wallClock += ms;
     highRes += ms;
killedBy: VirtualClock advance() moves all three time functions forward
statusReason: expected -100 to be 100 // Object.is equality

[Killed] AssignmentOperator
src/testing/virtual-clock.ts:117:5
 
   const doAdvance = (ms: number): void => {
     monotonic += ms;
-    wallClock += ms;
+    wallClock -= ms;
     highRes += ms;
     for (const listener of advanceListeners) {
killedBy: VirtualClock advance() moves all three time functions forward
statusReason: expected 1707753599900 to be 1707753600100 // Object.is equality

[Killed] AssignmentOperator
src/testing/virtual-clock.ts:118:5
   const doAdvance = (ms: number): void => {
     monotonic += ms;
     wallClock += ms;
-    highRes += ms;
+    highRes -= ms;
     for (const listener of advanceListeners) {
       listener(ms);
killedBy: VirtualClock advance() moves all three time functions forward
statusReason: expected 1707753599900 to be 1707753600100 // Object.is equality

[Killed] BlockStatement
src/testing/virtual-clock.ts:119:46
     monotonic += ms;
     wallClock += ms;
     highRes += ms;
-    for (const listener of advanceListeners) {
-      listener(ms);
-    }
+    for (const listener of advanceListeners) {}
   };
 
killedBy: setupPeriodicClockEvaluation() DoD35-2: calls getDiagnostics() and getCapabilities() on each interval cycle
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/testing/virtual-clock.ts:126:20
 
   // The VirtualClockAdapterInterface is NOT frozen
   const adapter: VirtualClockAdapterInterface = {
-    monotonicNow() {
-      const value = asMonotonic(monotonic);
-      if (autoAdvanceMs > 0) {
-        doAdvance(autoAdvanceMs);
-      }
-      return value;
-    },
+    monotonicNow() {},
 
     wallClockNow() {
killedBy: delay() delegates to scheduler.sleep()
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:128:11
   const adapter: VirtualClockAdapterInterface = {
     monotonicNow() {
       const value = asMonotonic(monotonic);
-      if (autoAdvanceMs > 0) {
+      if (true) {
         doAdvance(autoAdvanceMs);
       }
killedBy: setupPeriodicClockEvaluation() DoD35-1: starts periodic interval via TimerSchedulerPort at configured intervalMs
statusReason: Maximum call stack size exceeded

[Killed] EqualityOperator
src/testing/virtual-clock.ts:128:11
   const adapter: VirtualClockAdapterInterface = {
     monotonicNow() {
       const value = asMonotonic(monotonic);
-      if (autoAdvanceMs > 0) {
+      if (autoAdvanceMs >= 0) {
         doAdvance(autoAdvanceMs);
       }
killedBy: delay() delegates to scheduler.sleep()
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
src/testing/virtual-clock.ts:134:20
       return value;
     },
 
-    wallClockNow() {
-      const value = asWallClock(wallClock);
-      // Stryker disable next-line all -- EQUIVALENT: doAdvance(0) is a no-op; CE(true) with advance(0) produces identical observable state
-      if (autoAdvanceMs > 0) {
-        doAdvance(autoAdvanceMs);
-      }
-      return value;
-    },
+    wallClockNow() {},
 
     highResNow() {
killedBy: VirtualClock createVirtualClock() with defaults: wallClockNow returns default epoch
statusReason: expected undefined to be 1707753600000 // Object.is equality

[Killed] BlockStatement
src/testing/virtual-clock.ts:143:18
       return value;
     },
 
-    highResNow() {
-      const value = asHighRes(highRes);
-      // Stryker disable next-line all -- EQUIVALENT: doAdvance(0) is a no-op; CE(true) with advance(0) produces identical observable state
-      if (autoAdvanceMs > 0) {
-        doAdvance(autoAdvanceMs);
-      }
-      return value;
-    },
+    highResNow() {},
 
     advance(ms: number): Result<void, ClockRangeError> {
killedBy: VirtualClock advance() moves all three time functions forward
statusReason: expected undefined to be NaN // Object.is equality

[Killed] BlockStatement
src/testing/virtual-clock.ts:152:56
       return value;
     },
 
-    advance(ms: number): Result<void, ClockRangeError> {
-      if (ms < 0) {
-        return err(
-          createClockRangeError("ms", ms, "advance() requires a non-negative value")
-        );
-      }
-      doAdvance(ms);
-      return ok(undefined);
-    },
+    advance(ms: number): Result<void, ClockRangeError> {},
 
     set(values: Partial<VirtualClockValues>): void {
killedBy: delay() delegates to scheduler.sleep()
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/testing/virtual-clock.ts:153:11
     },
 
     advance(ms: number): Result<void, ClockRangeError> {
-      if (ms < 0) {
+      if (ms <= 0) {
         return err(
           createClockRangeError("ms", ms, "advance() requires a non-negative value")
killedBy: delay() resolves for ms === 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:153:11
     },
 
     advance(ms: number): Result<void, ClockRangeError> {
-      if (ms < 0) {
+      if (true) {
         return err(
           createClockRangeError("ms", ms, "advance() requires a non-negative value")
killedBy: setupPeriodicClockEvaluation() DoD35-2: calls getDiagnostics() and getCapabilities() on each interval cycle
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:163:11
     },
 
     set(values: Partial<VirtualClockValues>): void {
-      if (values.monotonic !== undefined) {
+      if (true) {
         if (!Number.isFinite(values.monotonic)) {
           throw new TypeError(
killedBy: VirtualClock set() with empty object is a no-op
statusReason: set() 'monotonic' must be a finite number, got undefined

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:163:11
     },
 
     set(values: Partial<VirtualClockValues>): void {
-      if (values.monotonic !== undefined) {
+      if (false) {
         if (!Number.isFinite(values.monotonic)) {
           throw new TypeError(
killedBy: VirtualClock set() updates only specified time functions
statusReason: expected 100 to be 999 // Object.is equality

[Killed] BooleanLiteral
src/testing/virtual-clock.ts:164:13
 
     set(values: Partial<VirtualClockValues>): void {
       if (values.monotonic !== undefined) {
-        if (!Number.isFinite(values.monotonic)) {
+        if (Number.isFinite(values.monotonic)) {
           throw new TypeError(
             `set() 'monotonic' must be a finite number, got ${values.monotonic}`
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'monotonic' must be a finite number, got 999

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:164:13
 
     set(values: Partial<VirtualClockValues>): void {
       if (values.monotonic !== undefined) {
-        if (!Number.isFinite(values.monotonic)) {
+        if (true) {
           throw new TypeError(
             `set() 'monotonic' must be a finite number, got ${values.monotonic}`
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'monotonic' must be a finite number, got 999

[Killed] StringLiteral
src/testing/virtual-clock.ts:166:13
       if (values.monotonic !== undefined) {
         if (!Number.isFinite(values.monotonic)) {
           throw new TypeError(
-            `set() 'monotonic' must be a finite number, got ${values.monotonic}`
+            ``
           );
         }
killedBy: VirtualClock — set() and jumpWallClock() error messages set({ monotonic: NaN }) throws message containing 'monotonic'
statusReason: expected [Function] to throw error matching /monotonic/ but got ''

[Killed] EqualityOperator
src/testing/virtual-clock.ts:171:11
         }
         monotonic = values.monotonic;
       }
-      if (values.wallClock !== undefined) {
+      if (values.wallClock === undefined) {
         if (!Number.isFinite(values.wallClock)) {
           throw new TypeError(
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'wallClock' must be a finite number, got undefined

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:171:11
         }
         monotonic = values.monotonic;
       }
-      if (values.wallClock !== undefined) {
+      if (true) {
         if (!Number.isFinite(values.wallClock)) {
           throw new TypeError(
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'wallClock' must be a finite number, got undefined

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:172:13
         monotonic = values.monotonic;
       }
       if (values.wallClock !== undefined) {
-        if (!Number.isFinite(values.wallClock)) {
+        if (false) {
           throw new TypeError(
             `set() 'wallClock' must be a finite number, got ${values.wallClock}`
killedBy: VirtualClock set() throws TypeError when any field is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/testing/virtual-clock.ts:172:49
         monotonic = values.monotonic;
       }
       if (values.wallClock !== undefined) {
-        if (!Number.isFinite(values.wallClock)) {
-          throw new TypeError(
-            `set() 'wallClock' must be a finite number, got ${values.wallClock}`
-          );
-        }
+        if (!Number.isFinite(values.wallClock)) {}
         wallClock = values.wallClock;
       }
killedBy: VirtualClock set() throws TypeError when any field is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/testing/virtual-clock.ts:174:13
       if (values.wallClock !== undefined) {
         if (!Number.isFinite(values.wallClock)) {
           throw new TypeError(
-            `set() 'wallClock' must be a finite number, got ${values.wallClock}`
+            ``
           );
         }
killedBy: VirtualClock — set() and jumpWallClock() error messages set({ wallClock: NaN }) throws message containing 'wallClock'
statusReason: expected [Function] to throw error matching /wallClock/ but got ''

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:179:11
         }
         wallClock = values.wallClock;
       }
-      if (values.highRes !== undefined) {
+      if (true) {
         if (!Number.isFinite(values.highRes)) {
           throw new TypeError(
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'highRes' must be a finite number, got undefined

[Killed] EqualityOperator
src/testing/virtual-clock.ts:179:11
         }
         wallClock = values.wallClock;
       }
-      if (values.highRes !== undefined) {
+      if (values.highRes === undefined) {
         if (!Number.isFinite(values.highRes)) {
           throw new TypeError(
killedBy: VirtualClock set() updates only specified time functions
statusReason: set() 'highRes' must be a finite number, got undefined

[Killed] ConditionalExpression
src/testing/virtual-clock.ts:180:13
         wallClock = values.wallClock;
       }
       if (values.highRes !== undefined) {
-        if (!Number.isFinite(values.highRes)) {
+        if (false) {
           throw new TypeError(
             `set() 'highRes' must be a finite number, got ${values.highRes}`
killedBy: VirtualClock set() throws TypeError when any field is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/testing/virtual-clock.ts:180:47
         wallClock = values.wallClock;
       }
       if (values.highRes !== undefined) {
-        if (!Number.isFinite(values.highRes)) {
-          throw new TypeError(
-            `set() 'highRes' must be a finite number, got ${values.highRes}`
-          );
-        }
+        if (!Number.isFinite(values.highRes)) {}
         highRes = values.highRes;
       }
killedBy: VirtualClock set() throws TypeError when any field is NaN
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/testing/virtual-clock.ts:189:37
       }
     },
 
-    jumpWallClock(ms: number): void {
-      if (!Number.isFinite(ms)) {
-        throw new TypeError(`jumpWallClock() 'ms' must be a finite number, got ${ms}`);
-      }
-      wallClock += ms;
-      highRes += ms;
-      // monotonic is intentionally NOT affected
-    },
+    jumpWallClock(ms: number): void {},
 
     setAutoAdvance(ms: number): void {
killedBy: VirtualClock jumpWallClock() moves wallClock and highRes but not monotonic
statusReason: expected 1707753600000 to be 1707753605000 // Object.is equality

[Killed] BooleanLiteral
src/testing/virtual-clock.ts:190:11
     },
 
     jumpWallClock(ms: number): void {
-      if (!Number.isFinite(ms)) {
+      if (Number.isFinite(ms)) {
         throw new TypeError(`jumpWallClock() 'ms' must be a finite number, got ${ms}`);
       }
killedBy: VirtualClock jumpWallClock() moves wallClock and highRes but not monotonic
statusReason: jumpWallClock() 'ms' must be a finite number, got 5000

[Killed] BlockStatement
src/testing/virtual-clock.ts:190:33
     },
 
     jumpWallClock(ms: number): void {
-      if (!Number.isFinite(ms)) {
-        throw new TypeError(`jumpWallClock() 'ms' must be a finite number, got ${ms}`);
-      }
+      if (!Number.isFinite(ms)) {}
       wallClock += ms;
       highRes += ms;
killedBy: VirtualClock — set() and jumpWallClock() error messages jumpWallClock(NaN) throws TypeError
statusReason: expected function to throw an error, but it didn't

[Killed] AssignmentOperator
src/testing/virtual-clock.ts:193:7
       if (!Number.isFinite(ms)) {
         throw new TypeError(`jumpWallClock() 'ms' must be a finite number, got ${ms}`);
       }
-      wallClock += ms;
+      wallClock -= ms;
       highRes += ms;
       // monotonic is intentionally NOT affected
killedBy: VirtualClock jumpWallClock() moves wallClock and highRes but not monotonic
statusReason: expected 1707753595000 to be 1707753605000 // Object.is equality
