[Killed] BlockStatement
src/record-integrity.ts:25:67
 }
 
 /** Produce a sorted canonical JSON string from a plain context object. */
-function canonicalizeRecord(ctx: Record<string, unknown>): string {
-  const sorted: Record<string, unknown> = {};
-  const keys = Object.keys(ctx).sort();
-  for (const key of keys) {
-    sorted[key] = ctx[key];
-  }
-  return JSON.stringify(sorted);
-}
+function canonicalizeRecord(ctx: Record<string, unknown>): string {}
 
 /**
killedBy: computeTemporalContextDigest returns a frozen TemporalContextDigest
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/record-integrity.ts:27:16
 /** Produce a sorted canonical JSON string from a plain context object. */
 function canonicalizeRecord(ctx: Record<string, unknown>): string {
   const sorted: Record<string, unknown> = {};
-  const keys = Object.keys(ctx).sort();
+  const keys = Object.keys(ctx);
   for (const key of keys) {
     sorted[key] = ctx[key];
killedBy: computeTemporalContextDigest canonicalInput has fields in alphabetical order
statusReason: expected [ 'sequenceNumber', …(2) ] to deeply equal [ 'monotonicTimestamp', …(2) ]

[Killed] BlockStatement
src/record-integrity.ts:28:27
 function canonicalizeRecord(ctx: Record<string, unknown>): string {
   const sorted: Record<string, unknown> = {};
   const keys = Object.keys(ctx).sort();
-  for (const key of keys) {
-    sorted[key] = ctx[key];
-  }
+  for (const key of keys) {}
   return JSON.stringify(sorted);
 }
killedBy: computeTemporalContextDigest produces different digests for different inputs
statusReason: expected '005971e3005971e3005971e3005971e300597…' not to be '005971e3005971e3005971e3005971e300597…' // Object.is equality

[Killed] BlockStatement
src/record-integrity.ts:42:47
  * This synchronous variant provides a deterministic, collision-resistant
  * fingerprint suitable for record integrity checks.
  */
-function djb2HexDigest(input: string): string {
-  let hash = 5381;
-  for (let i = 0; i < input.length; i++) {
-    hash = ((hash << 5) + hash) ^ input.charCodeAt(i);
-    hash = hash >>> 0; // keep unsigned 32-bit
-  }
-  // Pad to 8 hex chars then repeat to produce a 64-char digest (like SHA-256 hex)
-  const part = hash.toString(16).padStart(8, "0");
-  return part.repeat(8);
-}
+function djb2HexDigest(input: string): string {}
 
 /**
killedBy: computeTemporalContextDigest produces hex-encoded digest string
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/record-integrity.ts:44:42
  */
 function djb2HexDigest(input: string): string {
   let hash = 5381;
-  for (let i = 0; i < input.length; i++) {
-    hash = ((hash << 5) + hash) ^ input.charCodeAt(i);
-    hash = hash >>> 0; // keep unsigned 32-bit
-  }
+  for (let i = 0; i < input.length; i++) {}
   // Pad to 8 hex chars then repeat to produce a 64-char digest (like SHA-256 hex)
   const part = hash.toString(16).padStart(8, "0");
killedBy: computeTemporalContextDigest produces different digests for different inputs
statusReason: expected '0000150500001505000015050000150500001…' not to be '0000150500001505000015050000150500001…' // Object.is equality

[Killed] ConditionalExpression
src/record-integrity.ts:44:19
  */
 function djb2HexDigest(input: string): string {
   let hash = 5381;
-  for (let i = 0; i < input.length; i++) {
+  for (let i = 0; false; i++) {
     hash = ((hash << 5) + hash) ^ input.charCodeAt(i);
     hash = hash >>> 0; // keep unsigned 32-bit
killedBy: computeTemporalContextDigest produces different digests for different inputs
statusReason: expected '0000150500001505000015050000150500001…' not to be '0000150500001505000015050000150500001…' // Object.is equality

[Killed] ArithmeticOperator
src/record-integrity.ts:45:13
 function djb2HexDigest(input: string): string {
   let hash = 5381;
   for (let i = 0; i < input.length; i++) {
-    hash = ((hash << 5) + hash) ^ input.charCodeAt(i);
+    hash = ((hash << 5) - hash) ^ input.charCodeAt(i);
     hash = hash >>> 0; // keep unsigned 32-bit
   }
killedBy: computeTemporalContextDigest digest matches exact known DJB2 value for seq=11,mono=11,wall=946684800000 (kills L45 and L49)
statusReason: expected 'fab86020fab86020fab86020fab86020fab86…' to be '0f63c8ce0f63c8ce0f63c8ce0f63c8ce0f63c…' // Object.is equality

[Killed] StringLiteral
src/record-integrity.ts:49:46
     hash = hash >>> 0; // keep unsigned 32-bit
   }
   // Pad to 8 hex chars then repeat to produce a 64-char digest (like SHA-256 hex)
-  const part = hash.toString(16).padStart(8, "0");
+  const part = hash.toString(16).padStart(8, "");
   return part.repeat(8);
 }
killedBy: computeTemporalContextDigest digest matches exact known DJB2 value for seq=11,mono=11,wall=946684800000 (kills L45 and L49)
statusReason: expected 'f63c8cef63c8cef63c8cef63c8cef63c8cef6…' to be '0f63c8ce0f63c8ce0f63c8ce0f63c8ce0f63c…' // Object.is equality

[Killed] BlockStatement
src/record-integrity.ts:59:91
  * Uses djb2 for synchronous computation. For full SHA-256, use
  * computeTemporalContextDigestAsync().
  */
-export function computeTemporalContextDigest(ctx: TemporalContext): TemporalContextDigest {
-  const asRecord: Record<string, unknown> = {
-    sequenceNumber: ctx.sequenceNumber,
-    monotonicTimestamp: ctx.monotonicTimestamp,
-    wallClockTimestamp: ctx.wallClockTimestamp,
-  };
-  const canonicalInput = canonicalizeRecord(asRecord);
-  const digest = djb2HexDigest(canonicalInput);
-
-  return Object.freeze({
-    _tag: "TemporalContextDigest" as const,
-    algorithm: "SHA-256" as const,
-    digest,
-    canonicalInput,
-  });
-}
+export function computeTemporalContextDigest(ctx: TemporalContext): TemporalContextDigest {}
 
 /**
killedBy: computeTemporalContextDigest has _tag 'TemporalContextDigest'
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/record-integrity.ts:81:26
  */
 export function computeOverflowTemporalContextDigest(
   ctx: OverflowTemporalContext
-): TemporalContextDigest {
-  const asRecord: Record<string, unknown> = {
-    _tag: ctx._tag,
-    sequenceNumber: ctx.sequenceNumber,
-    lastValidSequenceNumber: ctx.lastValidSequenceNumber,
-    monotonicTimestamp: ctx.monotonicTimestamp,
-    wallClockTimestamp: ctx.wallClockTimestamp,
-  };
-  const canonicalInput = canonicalizeRecord(asRecord);
-  const digest = djb2HexDigest(canonicalInput);
-
-  return Object.freeze({
-    _tag: "TemporalContextDigest" as const,
-    algorithm: "SHA-256" as const,
-    digest,
-    canonicalInput,
-  });
-}
+): TemporalContextDigest {}
 
 /**
killedBy: verifyTemporalContextDigest works for both TemporalContext and OverflowTemporalContext (roundtrip)
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ObjectLiteral
src/record-integrity.ts:92:24
   const canonicalInput = canonicalizeRecord(asRecord);
   const digest = djb2HexDigest(canonicalInput);
 
-  return Object.freeze({
-    _tag: "TemporalContextDigest" as const,
-    algorithm: "SHA-256" as const,
-    digest,
-    canonicalInput,
-  });
+  return Object.freeze({});
 }
 
killedBy: verifyTemporalContextDigest works for both TemporalContext and OverflowTemporalContext (roundtrip)
statusReason: expected undefined to be 'TemporalContextDigest' // Object.is equality

[Killed] BlockStatement
src/record-integrity.ts:107:12
 export function verifyTemporalContextDigest(
   ctx: TemporalContext,
   digest: TemporalContextDigest
-): boolean {
-  const recomputed = computeTemporalContextDigest(ctx);
-  return recomputed.digest === digest.digest;
-}
+): boolean {}
 
killedBy: verifyTemporalContextDigest returns true for matching context and digest
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/record-integrity.ts:109:10
   digest: TemporalContextDigest
 ): boolean {
   const recomputed = computeTemporalContextDigest(ctx);
-  return recomputed.digest === digest.digest;
+  return true;
 }
 
killedBy: verifyTemporalContextDigest returns false when sequenceNumber is modified
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/record-integrity.ts:109:10
   digest: TemporalContextDigest
 ): boolean {
   const recomputed = computeTemporalContextDigest(ctx);
-  return recomputed.digest === digest.digest;
+  return recomputed.digest !== digest.digest;
 }
 
killedBy: verifyTemporalContextDigest returns true for matching context and digest
statusReason: expected false to be true // Object.is equality
