[Killed] BlockStatement
src/testing/virtual-cached-clock.ts:20:23
  */
 export function createVirtualCachedClock(
   clock: VirtualClockAdapterInterface
-): CachedClockAdapter {
-  return Object.freeze({
-    recentMonotonicNow: () => clock.monotonicNow(),
-    recentWallClockNow: () => clock.wallClockNow(),
-    start: () => {
-      // no-op
-    },
-    stop: () => {
-      // no-op
-    },
-    isRunning: () => true,
-  });
-}
+): CachedClockAdapter {}
 
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: Cannot read properties of undefined (reading 'recentMonotonicNow')

[Killed] ObjectLiteral
src/testing/virtual-cached-clock.ts:21:24
 export function createVirtualCachedClock(
   clock: VirtualClockAdapterInterface
 ): CachedClockAdapter {
-  return Object.freeze({
-    recentMonotonicNow: () => clock.monotonicNow(),
-    recentWallClockNow: () => clock.wallClockNow(),
-    start: () => {
-      // no-op
-    },
-    stop: () => {
-      // no-op
-    },
-    isRunning: () => true,
-  });
+  return Object.freeze({});
 }
 
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: cached.recentMonotonicNow is not a function

[Killed] ArrowFunction
src/testing/virtual-cached-clock.ts:22:25
   clock: VirtualClockAdapterInterface
 ): CachedClockAdapter {
   return Object.freeze({
-    recentMonotonicNow: () => clock.monotonicNow(),
+    recentMonotonicNow: () => undefined,
     recentWallClockNow: () => clock.wallClockNow(),
     start: () => {
killedBy: VirtualCachedClock reads virtual clock directly (no background updater)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArrowFunction
src/testing/virtual-cached-clock.ts:23:25
 ): CachedClockAdapter {
   return Object.freeze({
     recentMonotonicNow: () => clock.monotonicNow(),
-    recentWallClockNow: () => clock.wallClockNow(),
+    recentWallClockNow: () => undefined,
     start: () => {
       // no-op
killedBy: VirtualCachedClock recentWallClockNow() returns exact clock wall-clock value (kills ArrowFunction mutant)
statusReason: expected NaN to be 1700000000000 // Object.is equality

[Killed] ArrowFunction
src/testing/virtual-cached-clock.ts:30:16
     stop: () => {
       // no-op
     },
-    isRunning: () => true,
+    isRunning: () => undefined,
   });
 }
killedBy: VirtualCachedClock isRunning() always returns true
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/testing/virtual-cached-clock.ts:30:22
     stop: () => {
       // no-op
     },
-    isRunning: () => true,
+    isRunning: () => false,
   });
 }
killedBy: VirtualCachedClock isRunning() always returns true
statusReason: expected false to be true // Object.is equality
