[Killed] LogicalOperator
src/introspection/flow-inspector.ts:43:28
  */
 export function createFlowInspector(config: FlowInspectorConfig): FlowInspector {
   const { registry, collector } = config;
-  const healthBufferSize = config.healthBufferSize ?? DEFAULT_HEALTH_BUFFER_SIZE;
+  const healthBufferSize = config.healthBufferSize && DEFAULT_HEALTH_BUFFER_SIZE;
   const effectBufferSize = config.effectBufferSize ?? DEFAULT_EFFECT_BUFFER_SIZE;
   const cacheTtlMs = config.cacheTtlMs ?? DEFAULT_CACHE_TTL_MS;
killedBy: FlowInspector getHealthEvents() returns from circular buffer with limit
statusReason: expected [] to have a length of 3 but got +0

[Killed] LogicalOperator
src/introspection/flow-inspector.ts:44:28
 export function createFlowInspector(config: FlowInspectorConfig): FlowInspector {
   const { registry, collector } = config;
   const healthBufferSize = config.healthBufferSize ?? DEFAULT_HEALTH_BUFFER_SIZE;
-  const effectBufferSize = config.effectBufferSize ?? DEFAULT_EFFECT_BUFFER_SIZE;
+  const effectBufferSize = config.effectBufferSize && DEFAULT_EFFECT_BUFFER_SIZE;
   const cacheTtlMs = config.cacheTtlMs ?? DEFAULT_CACHE_TTL_MS;
 
killedBy: FlowInspector getEffectHistory() returns records from buffer
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/introspection/flow-inspector.ts:45:22
   const { registry, collector } = config;
   const healthBufferSize = config.healthBufferSize ?? DEFAULT_HEALTH_BUFFER_SIZE;
   const effectBufferSize = config.effectBufferSize ?? DEFAULT_EFFECT_BUFFER_SIZE;
-  const cacheTtlMs = config.cacheTtlMs ?? DEFAULT_CACHE_TTL_MS;
+  const cacheTtlMs = config.cacheTtlMs && DEFAULT_CACHE_TTL_MS;
 
   const healthBuffer = new CircularBuffer<HealthEvent>(healthBufferSize);
killedBy: FlowInspector uses default cacheTtlMs when not specified
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/introspection/flow-inspector.ts:55:100
   let snapshotCache: { data: readonly MachineSnapshot<string, unknown>[]; expiresAt: number } | undefined;
 
   // Subscribe to collector for state history tracking
-  const unsubscribeCollector: Unsubscribe = collector.subscribe((event: FlowTransitionEventAny) => {
-    const key = event.machineId;
-    let history = stateHistories.get(key);
-    if (history === undefined) {
-      history = [event.prevState];
-      stateHistories.set(key, history);
-    }
-    history.push(event.nextState);
-  });
+  const unsubscribeCollector: Unsubscribe = collector.subscribe((event: FlowTransitionEventAny) => {});
 
   let disposed = false;
killedBy: FlowInspector getStateHistory() returns ordered state path
statusReason: expected [] to deeply equal [ 'idle', 'loading', 'success' ]

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:58:9
   const unsubscribeCollector: Unsubscribe = collector.subscribe((event: FlowTransitionEventAny) => {
     const key = event.machineId;
     let history = stateHistories.get(key);
-    if (history === undefined) {
+    if (true) {
       history = [event.prevState];
       stateHistories.set(key, history);
killedBy: FlowInspector getStateHistory() returns ordered state path
statusReason: expected [ 'loading', 'success' ] to deeply equal [ 'idle', 'loading', 'success' ]

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:58:9
   const unsubscribeCollector: Unsubscribe = collector.subscribe((event: FlowTransitionEventAny) => {
     const key = event.machineId;
     let history = stateHistories.get(key);
-    if (history === undefined) {
+    if (history !== undefined) {
       history = [event.prevState];
       stateHistories.set(key, history);
killedBy: FlowInspector getEventHistory() returns transitions from collector
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/introspection/flow-inspector.ts:65:18
     history.push(event.nextState);
   });
 
-  let disposed = false;
+  let disposed = true;
 
   const inspector: FlowInspector = {
killedBy: FlowInspector getEffectHistory() returns records from buffer
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/introspection/flow-inspector.ts:68:105
   let disposed = false;
 
   const inspector: FlowInspector = {
-    getMachineState(portName: string, instanceId: string): MachineSnapshot<string, unknown> | undefined {
-      const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return undefined;
-      return entry.snapshot();
-    },
+    getMachineState(portName: string, instanceId: string): MachineSnapshot<string, unknown> | undefined {},
 
     getValidTransitions(portName: string, instanceId: string): readonly string[] {
killedBy: FlowInspector getMachineState() returns snapshot from registry
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:70:11
   const inspector: FlowInspector = {
     getMachineState(portName: string, instanceId: string): MachineSnapshot<string, unknown> | undefined {
       const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return undefined;
+      if (false) return undefined;
       return entry.snapshot();
     },
killedBy: FlowInspector getMachineState() returns undefined for missing machine
statusReason: Cannot read properties of undefined (reading 'snapshot')

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:70:11
   const inspector: FlowInspector = {
     getMachineState(portName: string, instanceId: string): MachineSnapshot<string, unknown> | undefined {
       const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return undefined;
+      if (entry !== undefined) return undefined;
       return entry.snapshot();
     },
killedBy: FlowInspector getMachineState() returns snapshot from registry
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/introspection/flow-inspector.ts:74:82
       return entry.snapshot();
     },
 
-    getValidTransitions(portName: string, instanceId: string): readonly string[] {
-      const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
-      return entry.validEvents();
-    },
+    getValidTransitions(portName: string, instanceId: string): readonly string[] {},
 
     getRunningActivities(portName: string, instanceId: string): readonly ActivityInstance[] {
killedBy: FlowInspector getValidTransitions() returns event names from current state
statusReason: expected undefined to deeply equal [ 'FETCH', 'CANCEL' ]

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:76:11
 
     getValidTransitions(portName: string, instanceId: string): readonly string[] {
       const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
+      if (entry !== undefined) return [];
       return entry.validEvents();
     },
killedBy: FlowInspector getValidTransitions() returns event names from current state
statusReason: expected [] to deeply equal [ 'FETCH', 'CANCEL' ]

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:76:11
 
     getValidTransitions(portName: string, instanceId: string): readonly string[] {
       const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
+      if (false) return [];
       return entry.validEvents();
     },
killedBy: FlowInspector getValidTransitions() returns empty for missing machine
statusReason: Cannot read properties of undefined (reading 'validEvents')

[Killed] BlockStatement
src/introspection/flow-inspector.ts:80:93
       return entry.validEvents();
     },
 
-    getRunningActivities(portName: string, instanceId: string): readonly ActivityInstance[] {
-      const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
-      const snap = entry.snapshot();
-      return snap.activities.filter(a => a.status === "running");
-    },
+    getRunningActivities(portName: string, instanceId: string): readonly ActivityInstance[] {},
 
     getEventHistory(options?: { limit?: number; since?: number }): readonly FlowTransitionEventAny[] {
killedBy: FlowInspector getRunningActivities() returns activities from snapshot
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:82:11
 
     getRunningActivities(portName: string, instanceId: string): readonly ActivityInstance[] {
       const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
+      if (true) return [];
       const snap = entry.snapshot();
       return snap.activities.filter(a => a.status === "running");
killedBy: FlowInspector getRunningActivities() returns activities from snapshot
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:84:42
       const entry = registry.getMachine(portName, instanceId);
       if (entry === undefined) return [];
       const snap = entry.snapshot();
-      return snap.activities.filter(a => a.status === "running");
+      return snap.activities.filter(a => false);
     },
 
killedBy: FlowInspector getRunningActivities() returns activities from snapshot
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:84:42
       const entry = registry.getMachine(portName, instanceId);
       if (entry === undefined) return [];
       const snap = entry.snapshot();
-      return snap.activities.filter(a => a.status === "running");
+      return snap.activities.filter(a => true);
     },
 
killedBy: FlowInspector getRunningActivities() returns activities from snapshot
statusReason: expected [ { id: 'a1', …(3) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/introspection/flow-inspector.ts:87:102
       return snap.activities.filter(a => a.status === "running");
     },
 
-    getEventHistory(options?: { limit?: number; since?: number }): readonly FlowTransitionEventAny[] {
-      let transitions = collector.getTransitions();
-
-      if (options?.since !== undefined) {
-        const since = options.since;
-        transitions = transitions.filter(t => t.timestamp >= since);
-      }
-
-      if (options?.limit !== undefined && options.limit < transitions.length) {
-        transitions = transitions.slice(transitions.length - options.limit);
-      }
-
-      return transitions;
-    },
+    getEventHistory(options?: { limit?: number; since?: number }): readonly FlowTransitionEventAny[] {},
 
     getStateHistory(portName: string, instanceId: string): readonly string[] {
killedBy: FlowInspector getEventHistory() returns transitions from collector
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:90:11
     getEventHistory(options?: { limit?: number; since?: number }): readonly FlowTransitionEventAny[] {
       let transitions = collector.getTransitions();
 
-      if (options?.since !== undefined) {
+      if (false) {
         const since = options.since;
         transitions = transitions.filter(t => t.timestamp >= since);
killedBy: FlowInspector getEventHistory() with since filters by timestamp
statusReason: expected [ { id: 't1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] OptionalChaining
src/introspection/flow-inspector.ts:90:11
     getEventHistory(options?: { limit?: number; since?: number }): readonly FlowTransitionEventAny[] {
       let transitions = collector.getTransitions();
 
-      if (options?.since !== undefined) {
+      if (options.since !== undefined) {
         const since = options.since;
         transitions = transitions.filter(t => t.timestamp >= since);
killedBy: FlowInspector getEventHistory() returns transitions from collector
statusReason: Cannot read properties of undefined (reading 'since')

[Killed] MethodExpression
src/introspection/flow-inspector.ts:92:23
 
       if (options?.since !== undefined) {
         const since = options.since;
-        transitions = transitions.filter(t => t.timestamp >= since);
+        transitions = transitions;
       }
 
killedBy: FlowInspector getEventHistory() with since filters by timestamp
statusReason: expected [ { id: 't1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:92:47
 
       if (options?.since !== undefined) {
         const since = options.since;
-        transitions = transitions.filter(t => t.timestamp >= since);
+        transitions = transitions.filter(t => false);
       }
 
killedBy: FlowInspector getEventHistory() with since filters by timestamp
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:95:11
         transitions = transitions.filter(t => t.timestamp >= since);
       }
 
-      if (options?.limit !== undefined && options.limit < transitions.length) {
+      if (options?.limit === undefined && options.limit < transitions.length) {
         transitions = transitions.slice(transitions.length - options.limit);
       }
killedBy: FlowInspector getEventHistory() returns transitions from collector
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] BlockStatement
src/introspection/flow-inspector.ts:95:79
         transitions = transitions.filter(t => t.timestamp >= since);
       }
 
-      if (options?.limit !== undefined && options.limit < transitions.length) {
-        transitions = transitions.slice(transitions.length - options.limit);
-      }
+      if (options?.limit !== undefined && options.limit < transitions.length) {}
 
       return transitions;
killedBy: FlowInspector getEventHistory() with limit returns at most N items
statusReason: expected [ { id: 't1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] MethodExpression
src/introspection/flow-inspector.ts:96:23
       }
 
       if (options?.limit !== undefined && options.limit < transitions.length) {
-        transitions = transitions.slice(transitions.length - options.limit);
+        transitions = transitions;
       }
 
killedBy: FlowInspector getEventHistory() with limit returns at most N items
statusReason: expected [ { id: 't1', …(8) }, …(2) ] to have a length of 2 but got 3

[Killed] ArithmeticOperator
src/introspection/flow-inspector.ts:96:41
       }
 
       if (options?.limit !== undefined && options.limit < transitions.length) {
-        transitions = transitions.slice(transitions.length - options.limit);
+        transitions = transitions.slice(transitions.length + options.limit);
       }
 
killedBy: FlowInspector getEventHistory() with limit returns at most N items
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/introspection/flow-inspector.ts:102:78
       return transitions;
     },
 
-    getStateHistory(portName: string, instanceId: string): readonly string[] {
-      const entry = registry.getMachine(portName, instanceId);
-      if (entry === undefined) return [];
-      return stateHistories.get(entry.machineId) ?? [];
-    },
+    getStateHistory(portName: string, instanceId: string): readonly string[] {},
 
     getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
killedBy: FlowInspector getStateHistory() returns ordered state path
statusReason: expected undefined to deeply equal [ 'idle', 'loading', 'success' ]

[Killed] LogicalOperator
src/introspection/flow-inspector.ts:105:14
     getStateHistory(portName: string, instanceId: string): readonly string[] {
       const entry = registry.getMachine(portName, instanceId);
       if (entry === undefined) return [];
-      return stateHistories.get(entry.machineId) ?? [];
+      return stateHistories.get(entry.machineId) && [];
     },
 
killedBy: FlowInspector getStateHistory() returns ordered state path
statusReason: expected [] to deeply equal [ 'idle', 'loading', 'success' ]

[Killed] ArrayDeclaration
src/introspection/flow-inspector.ts:105:53
     getStateHistory(portName: string, instanceId: string): readonly string[] {
       const entry = registry.getMachine(portName, instanceId);
       if (entry === undefined) return [];
-      return stateHistories.get(entry.machineId) ?? [];
+      return stateHistories.get(entry.machineId) ?? ["Stryker was here"];
     },
 
killedBy: FlowInspector getStateHistory() returns empty array (not undefined) for registered machine with no events
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/introspection/flow-inspector.ts:108:83
       return stateHistories.get(entry.machineId) ?? [];
     },
 
-    getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
-      const all = effectBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
-        return all.slice(all.length - options.limit);
-      }
-      return all;
-    },
+    getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {},
 
     getAllMachinesSnapshot(): readonly MachineSnapshot<string, unknown>[] {
killedBy: FlowInspector getEffectHistory() returns records from buffer
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/introspection/flow-inspector.ts:110:11
 
     getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
       const all = effectBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
+      if (options?.limit !== undefined || options.limit < all.length) {
         return all.slice(all.length - options.limit);
       }
killedBy: FlowInspector getEffectHistory() returns records from buffer
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] OptionalChaining
src/introspection/flow-inspector.ts:110:11
 
     getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
       const all = effectBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
+      if (options.limit !== undefined && options.limit < all.length) {
         return all.slice(all.length - options.limit);
       }
killedBy: FlowInspector getEffectHistory() returns records from buffer
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] ArithmeticOperator
src/introspection/flow-inspector.ts:111:26
     getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
       const all = effectBuffer.toArray();
       if (options?.limit !== undefined && options.limit < all.length) {
-        return all.slice(all.length - options.limit);
+        return all.slice(all.length + options.limit);
       }
       return all;
killedBy: FlowInspector getEffectHistory() with limit returns most recent records
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/introspection/flow-inspector.ts:111:16
     getEffectHistory(options?: { limit?: number }): readonly EffectResultRecord[] {
       const all = effectBuffer.toArray();
       if (options?.limit !== undefined && options.limit < all.length) {
-        return all.slice(all.length - options.limit);
+        return all;
       }
       return all;
killedBy: FlowInspector getEffectHistory() with limit returns most recent records
statusReason: expected [ { portName: 'A', …(4) }, …(2) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/introspection/flow-inspector.ts:116:75
       return all;
     },
 
-    getAllMachinesSnapshot(): readonly MachineSnapshot<string, unknown>[] {
-      const now = Date.now();
-      if (snapshotCache !== undefined && now < snapshotCache.expiresAt) {
-        return snapshotCache.data;
-      }
-
-      const machines = registry.getAllMachines();
-      const snapshots = machines.map(entry => entry.snapshot());
-      snapshotCache = { data: snapshots, expiresAt: now + cacheTtlMs };
-      return snapshots;
-    },
+    getAllMachinesSnapshot(): readonly MachineSnapshot<string, unknown>[] {},
 
     getHealthEvents(options?: { limit?: number }): readonly HealthEvent[] {
killedBy: FlowInspector getAllMachinesSnapshot() returns all snapshots
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/introspection/flow-inspector.ts:118:73
 
     getAllMachinesSnapshot(): readonly MachineSnapshot<string, unknown>[] {
       const now = Date.now();
-      if (snapshotCache !== undefined && now < snapshotCache.expiresAt) {
-        return snapshotCache.data;
-      }
+      if (snapshotCache !== undefined && now < snapshotCache.expiresAt) {}
 
       const machines = registry.getAllMachines();
killedBy: FlowInspector getAllMachinesSnapshot() caches with TTL
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:118:11
 
     getAllMachinesSnapshot(): readonly MachineSnapshot<string, unknown>[] {
       const now = Date.now();
-      if (snapshotCache !== undefined && now < snapshotCache.expiresAt) {
+      if (snapshotCache === undefined && now < snapshotCache.expiresAt) {
         return snapshotCache.data;
       }
killedBy: FlowInspector getAllMachinesSnapshot() returns all snapshots
statusReason: Cannot read properties of undefined (reading 'expiresAt')

[Killed] ArrowFunction
src/introspection/flow-inspector.ts:123:38
       }
 
       const machines = registry.getAllMachines();
-      const snapshots = machines.map(entry => entry.snapshot());
+      const snapshots = machines.map(() => undefined);
       snapshotCache = { data: snapshots, expiresAt: now + cacheTtlMs };
       return snapshots;
killedBy: FlowInspector getAllMachinesSnapshot() caches with TTL
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArithmeticOperator
src/introspection/flow-inspector.ts:124:53
 
       const machines = registry.getAllMachines();
       const snapshots = machines.map(entry => entry.snapshot());
-      snapshotCache = { data: snapshots, expiresAt: now + cacheTtlMs };
+      snapshotCache = { data: snapshots, expiresAt: now - cacheTtlMs };
       return snapshots;
     },
killedBy: FlowInspector getAllMachinesSnapshot() caches with TTL
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/introspection/flow-inspector.ts:128:75
       return snapshots;
     },
 
-    getHealthEvents(options?: { limit?: number }): readonly HealthEvent[] {
-      const all = healthBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
-        return all.slice(all.length - options.limit);
-      }
-      return all;
-    },
+    getHealthEvents(options?: { limit?: number }): readonly HealthEvent[] {},
 
     getEffectResultStatistics(): ReadonlyMap<string, { ok: number; err: number }> {
killedBy: FlowInspector getHealthEvents() returns from circular buffer with limit
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/introspection/flow-inspector.ts:130:11
 
     getHealthEvents(options?: { limit?: number }): readonly HealthEvent[] {
       const all = healthBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
+      if (options?.limit !== undefined || options.limit < all.length) {
         return all.slice(all.length - options.limit);
       }
killedBy: FlowInspector getHealthEvents() returns from circular buffer with limit
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:130:11
 
     getHealthEvents(options?: { limit?: number }): readonly HealthEvent[] {
       const all = healthBuffer.toArray();
-      if (options?.limit !== undefined && options.limit < all.length) {
+      if (true) {
         return all.slice(all.length - options.limit);
       }
killedBy: FlowInspector getHealthEvents() returns from circular buffer with limit
statusReason: Cannot read properties of undefined (reading 'limit')

[Killed] BlockStatement
src/introspection/flow-inspector.ts:136:83
       return all;
     },
 
-    getEffectResultStatistics(): ReadonlyMap<string, { ok: number; err: number }> {
-      const stats = new Map<string, { ok: number; err: number }>();
-      for (const record of effectBuffer.toArray()) {
-        const key = `${record.portName}.${record.method}`;
-        let entry = stats.get(key);
-        if (entry === undefined) {
-          entry = { ok: 0, err: 0 };
-          stats.set(key, entry);
-        }
-        if (record.ok) {
-          entry.ok++;
-        } else {
-          entry.err++;
-        }
-      }
-      return stats;
-    },
+    getEffectResultStatistics(): ReadonlyMap<string, { ok: number; err: number }> {},
 
     getHighErrorRatePorts(threshold: number): readonly string[] {
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/introspection/flow-inspector.ts:138:52
 
     getEffectResultStatistics(): ReadonlyMap<string, { ok: number; err: number }> {
       const stats = new Map<string, { ok: number; err: number }>();
-      for (const record of effectBuffer.toArray()) {
-        const key = `${record.portName}.${record.method}`;
-        let entry = stats.get(key);
-        if (entry === undefined) {
-          entry = { ok: 0, err: 0 };
-          stats.set(key, entry);
-        }
-        if (record.ok) {
-          entry.ok++;
-        } else {
-          entry.err++;
-        }
-      }
+      for (const record of effectBuffer.toArray()) {}
       return stats;
     },
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected undefined to deeply equal { ok: 2, err: 1 }

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:141:13
       for (const record of effectBuffer.toArray()) {
         const key = `${record.portName}.${record.method}`;
         let entry = stats.get(key);
-        if (entry === undefined) {
+        if (true) {
           entry = { ok: 0, err: 0 };
           stats.set(key, entry);
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: +0, err: 1 } to deeply equal { ok: 2, err: 1 }

[Killed] EqualityOperator
src/introspection/flow-inspector.ts:141:13
       for (const record of effectBuffer.toArray()) {
         const key = `${record.portName}.${record.method}`;
         let entry = stats.get(key);
-        if (entry === undefined) {
+        if (entry !== undefined) {
           entry = { ok: 0, err: 0 };
           stats.set(key, entry);
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:145:13
           entry = { ok: 0, err: 0 };
           stats.set(key, entry);
         }
-        if (record.ok) {
+        if (true) {
           entry.ok++;
         } else {
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: 3, err: +0 } to deeply equal { ok: 2, err: 1 }

[Killed] ConditionalExpression
src/introspection/flow-inspector.ts:145:13
           entry = { ok: 0, err: 0 };
           stats.set(key, entry);
         }
-        if (record.ok) {
+        if (false) {
           entry.ok++;
         } else {
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: +0, err: 3 } to deeply equal { ok: 2, err: 1 }

[Killed] UpdateOperator
src/introspection/flow-inspector.ts:146:11
           stats.set(key, entry);
         }
         if (record.ok) {
-          entry.ok++;
+          entry.ok--;
         } else {
           entry.err++;
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: -2, err: 1 } to deeply equal { ok: 2, err: 1 }

[Killed] BlockStatement
src/introspection/flow-inspector.ts:147:16
         }
         if (record.ok) {
           entry.ok++;
-        } else {
-          entry.err++;
-        }
+        } else {}
       }
       return stats;
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: 2, err: +0 } to deeply equal { ok: 2, err: 1 }

[Killed] UpdateOperator
src/introspection/flow-inspector.ts:148:11
         if (record.ok) {
           entry.ok++;
         } else {
-          entry.err++;
+          entry.err--;
         }
       }
killedBy: FlowInspector getEffectResultStatistics() aggregates ok/err per port
statusReason: expected { ok: 2, err: -1 } to deeply equal { ok: 2, err: 1 }

[Killed] BlockStatement
src/introspection/flow-inspector.ts:154:65
       return stats;
     },
 
-    getHighErrorRatePorts(threshold: number): readonly string[] {
-      const stats = inspector.getEffectResultStatistics();
-      const result: string[] = [];
-      for (const [key, value] of stats) {
-        const total = value.ok + value.err;
-        if (total > 0 && value.err / total >= threshold) {
-          result.push(key);
-        }
-      }
-      return result;
-    },
+    getHighErrorRatePorts(threshold: number): readonly string[] {},
 
     recordEffectResult(record: EffectResultRecord): void {
killedBy: FlowInspector getHighErrorRatePorts() filters by threshold
statusReason: expected undefined to deeply equal [ 'Api.get' ]
