[Killed] BooleanLiteral
src/introspection/flow-tracing-hook.ts:25:48
  */
 export function createFlowTracingHook(options: FlowTracingHookOptions): FlowTracingHook {
   const { tracer, filter } = options;
-  const traceEffects = options.traceEffects ?? true;
+  const traceEffects = options.traceEffects ?? false;
 
   const hook: FlowTracingHook = {
killedBy: FlowTracingHook onEffectStart creates span with invoke format
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/introspection/flow-tracing-hook.ts:25:24
  */
 export function createFlowTracingHook(options: FlowTracingHookOptions): FlowTracingHook {
   const { tracer, filter } = options;
-  const traceEffects = options.traceEffects ?? true;
+  const traceEffects = options.traceEffects && true;
 
   const hook: FlowTracingHook = {
killedBy: FlowTracingHook onEffectStart creates span with invoke format
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/introspection/flow-tracing-hook.ts:28:93
   const traceEffects = options.traceEffects ?? true;
 
   const hook: FlowTracingHook = {
-    onTransitionStart(machineId: string, from: string, to: string, eventType: string): void {
-      if (filter !== undefined && !filter(machineId)) return;
-      tracer.pushSpan(`flow:${machineId}/${from}->${to}`, {
-        machine_id: machineId,
-        from_state: from,
-        to_state: to,
-        event_type: eventType,
-      });
-    },
+    onTransitionStart(machineId: string, from: string, to: string, eventType: string): void {},
 
     onTransitionEnd(machineId: string, ok: boolean): void {
killedBy: Introspection Integration full lifecycle: registry tracks instance, inspector queries work, tracing hook produces spans, dispose cleans up
statusReason: expected 1 to be greater than or equal to 2

[Killed] BooleanLiteral
src/introspection/flow-tracing-hook.ts:29:35
 
   const hook: FlowTracingHook = {
     onTransitionStart(machineId: string, from: string, to: string, eventType: string): void {
-      if (filter !== undefined && !filter(machineId)) return;
+      if (filter !== undefined && filter(machineId)) return;
       tracer.pushSpan(`flow:${machineId}/${from}->${to}`, {
         machine_id: machineId,
killedBy: FlowTracingHook filter option excludes specific machineIds
statusReason: expected [ { method: 'pushSpan', …(1) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/introspection/flow-tracing-hook.ts:29:11
 
   const hook: FlowTracingHook = {
     onTransitionStart(machineId: string, from: string, to: string, eventType: string): void {
-      if (filter !== undefined && !filter(machineId)) return;
+      if (filter !== undefined || !filter(machineId)) return;
       tracer.pushSpan(`flow:${machineId}/${from}->${to}`, {
         machine_id: machineId,
killedBy: Introspection Integration full lifecycle: registry tracks instance, inspector queries work, tracing hook produces spans, dispose cleans up
statusReason: filter is not a function

[Killed] BlockStatement
src/introspection/flow-tracing-hook.ts:38:59
       });
     },
 
-    onTransitionEnd(machineId: string, ok: boolean): void {
-      if (filter !== undefined && !filter(machineId)) return;
-      tracer.popSpan(ok ? "ok" : "error");
-    },
+    onTransitionEnd(machineId: string, ok: boolean): void {},
 
     onEffectStart(effectTag: string, detail: string): void {
killedBy: FlowTracingHook onTransitionEnd calls popSpan with 'ok' on success
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:39:11
     },
 
     onTransitionEnd(machineId: string, ok: boolean): void {
-      if (filter !== undefined && !filter(machineId)) return;
+      if (true) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: Introspection Integration full lifecycle: registry tracks instance, inspector queries work, tracing hook produces spans, dispose cleans up
statusReason: expected 1 to be greater than or equal to 2

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:39:11
     },
 
     onTransitionEnd(machineId: string, ok: boolean): void {
-      if (filter !== undefined && !filter(machineId)) return;
+      if (true && !filter(machineId)) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: FlowTracingHook onTransitionEnd calls popSpan with 'ok' on success
statusReason: filter is not a function

[Killed] StringLiteral
src/introspection/flow-tracing-hook.ts:40:34
 
     onTransitionEnd(machineId: string, ok: boolean): void {
       if (filter !== undefined && !filter(machineId)) return;
-      tracer.popSpan(ok ? "ok" : "error");
+      tracer.popSpan(ok ? "ok" : "");
     },
 
killedBy: FlowTracingHook onTransitionEnd calls popSpan with 'error' on failure
statusReason: expected '' to be 'error' // Object.is equality

[Killed] BlockStatement
src/introspection/flow-tracing-hook.ts:43:60
       tracer.popSpan(ok ? "ok" : "error");
     },
 
-    onEffectStart(effectTag: string, detail: string): void {
-      if (!traceEffects) return;
-      tracer.pushSpan(`flow:effect:${effectTag}:${detail}`, {
-        effect_tag: effectTag,
-        detail,
-      });
-    },
+    onEffectStart(effectTag: string, detail: string): void {},
 
     onEffectEnd(ok: boolean): void {
killedBy: FlowTracingHook onEffectStart creates span with invoke format
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:44:11
     },
 
     onEffectStart(effectTag: string, detail: string): void {
-      if (!traceEffects) return;
+      if (false) return;
       tracer.pushSpan(`flow:effect:${effectTag}:${detail}`, {
         effect_tag: effectTag,
killedBy: FlowTracingHook traceEffects=false disables effect-level spans
statusReason: expected [ { method: 'pushSpan', …(1) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:44:11
     },
 
     onEffectStart(effectTag: string, detail: string): void {
-      if (!traceEffects) return;
+      if (true) return;
       tracer.pushSpan(`flow:effect:${effectTag}:${detail}`, {
         effect_tag: effectTag,
killedBy: FlowTracingHook onEffectStart creates span with invoke format
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/introspection/flow-tracing-hook.ts:45:61
 
     onEffectStart(effectTag: string, detail: string): void {
       if (!traceEffects) return;
-      tracer.pushSpan(`flow:effect:${effectTag}:${detail}`, {
-        effect_tag: effectTag,
-        detail,
-      });
+      tracer.pushSpan(`flow:effect:${effectTag}:${detail}`, {});
     },
 
killedBy: FlowTracingHook shared span stack: parent-child correlation
statusReason: expected [ { method: 'pushSpan', …(1) }, …(3) ] to deeply equal [ { method: 'pushSpan', …(1) }, …(3) ]

[Killed] BlockStatement
src/introspection/flow-tracing-hook.ts:51:36
       });
     },
 
-    onEffectEnd(ok: boolean): void {
-      if (!traceEffects) return;
-      tracer.popSpan(ok ? "ok" : "error");
-    },
+    onEffectEnd(ok: boolean): void {},
   };
 
killedBy: FlowTracingHook onEffectEnd calls popSpan with correct status
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:52:11
     },
 
     onEffectEnd(ok: boolean): void {
-      if (!traceEffects) return;
+      if (false) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: FlowTracingHook traceEffects=false disables effect-level spans
statusReason: expected [ { method: 'popSpan', …(1) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/introspection/flow-tracing-hook.ts:52:11
     },
 
     onEffectEnd(ok: boolean): void {
-      if (!traceEffects) return;
+      if (true) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: FlowTracingHook onEffectEnd calls popSpan with correct status
statusReason: expected undefined to be 'ok' // Object.is equality

[Killed] StringLiteral
src/introspection/flow-tracing-hook.ts:53:27
 
     onEffectEnd(ok: boolean): void {
       if (!traceEffects) return;
-      tracer.popSpan(ok ? "ok" : "error");
+      tracer.popSpan(ok ? "" : "error");
     },
   };
killedBy: FlowTracingHook onEffectEnd calls popSpan with correct status
statusReason: expected '' to be 'ok' // Object.is equality

[Killed] StringLiteral
src/introspection/flow-tracing-hook.ts:53:34
 
     onEffectEnd(ok: boolean): void {
       if (!traceEffects) return;
-      tracer.popSpan(ok ? "ok" : "error");
+      tracer.popSpan(ok ? "ok" : "");
     },
   };
killedBy: FlowTracingHook onEffectEnd calls popSpan with correct status
statusReason: expected '' to be 'error' // Object.is equality
