[Killed] ArrowFunction
src/combinators/timeout.ts:34:28
   ms: number,
 ): Promise<Result<HttpResponse, HttpRequestError>> {
   const controller = new AbortController();
-  const timer = setTimeout(() => controller.abort(), ms);
+  const timer = setTimeout(() => undefined, ms);
 
   // Propagate any existing signal's abort into our controller.
killedBy: timeout — expiry returns Err when the abortable client is aborted by the timeout signal
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/combinators/timeout.ts:38:7
 
   // Propagate any existing signal's abort into our controller.
   const existingSignal = req.signal;
-  if (existingSignal !== undefined && !existingSignal.aborted) {
+  if (false) {
     existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
   } else if (existingSignal?.aborted === true) {
killedBy: timeout — signal propagation aborting the existing signal causes the inner signal to also be aborted
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/combinators/timeout.ts:38:7
 
   // Propagate any existing signal's abort into our controller.
   const existingSignal = req.signal;
-  if (existingSignal !== undefined && !existingSignal.aborted) {
+  if (existingSignal !== undefined || !existingSignal.aborted) {
     existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
   } else if (existingSignal?.aborted === true) {
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] ArrowFunction
src/combinators/timeout.ts:39:46
   // Propagate any existing signal's abort into our controller.
   const existingSignal = req.signal;
   if (existingSignal !== undefined && !existingSignal.aborted) {
-    existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
+    existingSignal.addEventListener("abort", () => undefined, { once: true });
   } else if (existingSignal?.aborted === true) {
     clearTimeout(timer);
killedBy: timeout — signal propagation aborting the existing signal causes the inner signal to also be aborted
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
src/combinators/timeout.ts:39:80
   // Propagate any existing signal's abort into our controller.
   const existingSignal = req.signal;
   if (existingSignal !== undefined && !existingSignal.aborted) {
-    existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
+    existingSignal.addEventListener("abort", () => controller.abort(), { once: false });
   } else if (existingSignal?.aborted === true) {
     clearTimeout(timer);

[Killed] OptionalChaining
src/combinators/timeout.ts:40:14
   const existingSignal = req.signal;
   if (existingSignal !== undefined && !existingSignal.aborted) {
     existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
-  } else if (existingSignal?.aborted === true) {
+  } else if (existingSignal.aborted === true) {
     clearTimeout(timer);
     return err(
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: Cannot read properties of undefined (reading 'aborted')

[Killed] ConditionalExpression
src/combinators/timeout.ts:40:14
   const existingSignal = req.signal;
   if (existingSignal !== undefined && !existingSignal.aborted) {
     existingSignal.addEventListener("abort", () => controller.abort(), { once: true });
-  } else if (existingSignal?.aborted === true) {
+  } else if (true) {
     clearTimeout(timer);
     return err(
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: expected 'Err' to be 'Ok' // Object.is equality

[Killed] StringLiteral
src/combinators/timeout.ts:43:24
   } else if (existingSignal?.aborted === true) {
     clearTimeout(timer);
     return err(
-      httpRequestError("Aborted", req, `Request was aborted before timeout: ${req.method} ${req.url}`),
+      httpRequestError("", req, `Request was aborted before timeout: ${req.method} ${req.url}`),
     );
   }
killedBy: timeout — pre-aborted signal returns Err with reason=Aborted when the request signal is already aborted
statusReason: expected '' to be 'Aborted' // Object.is equality

[Killed] ObjectLiteral
src/combinators/timeout.ts:47:39
     );
   }
 
-  const reqWithSignal = Object.freeze({ ...req, signal: controller.signal });
+  const reqWithSignal = Object.freeze({});
 
   try {
killedBy: timeout — basic behaviour attaches a signal to the request object (replacing undefined)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/combinators/timeout.ts:49:7
 
   const reqWithSignal = Object.freeze({ ...req, signal: controller.signal });
 
-  try {
-    const result = await execute(reqWithSignal);
-    clearTimeout(timer);
-
-    if (result._tag === "Ok") {
-      return ok(result.value);
-    }
-
-    // If the controller was aborted by our timer, normalise to a Timeout error.
-    if (controller.signal.aborted) {
-      return err(
-        httpRequestError(
-          "Timeout",
-          req,
-          `Request timed out after ${ms}ms: ${req.method} ${req.url}`,
-          result.error,
-        ),
-      );
-    }
-
-    return err(result.error);
-  } catch (cause) {
+  try {} catch (cause) {
     clearTimeout(timer);
     return err(
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ConditionalExpression
src/combinators/timeout.ts:53:9
     const result = await execute(reqWithSignal);
     clearTimeout(timer);
 
-    if (result._tag === "Ok") {
+    if (true) {
       return ok(result.value);
     }
killedBy: timeout — expiry returns Err when the abortable client is aborted by the timeout signal
statusReason: expected 'Ok' to be 'Err' // Object.is equality

[Killed] BlockStatement
src/combinators/timeout.ts:53:31
     const result = await execute(reqWithSignal);
     clearTimeout(timer);
 
-    if (result._tag === "Ok") {
-      return ok(result.value);
-    }
+    if (result._tag === "Ok") {}
 
     // If the controller was aborted by our timer, normalise to a Timeout error.
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: expected 'Err' to be 'Ok' // Object.is equality

[Killed] ConditionalExpression
src/combinators/timeout.ts:58:9
     }
 
     // If the controller was aborted by our timer, normalise to a Timeout error.
-    if (controller.signal.aborted) {
+    if (true) {
       return err(
         httpRequestError(
killedBy: timeout — mutation-killing: error passthrough when controller is not aborted passes through the original error when inner client fails before the timeout fires
statusReason: expected 'Timeout' to be 'Transport' // Object.is equality

[Killed] ConditionalExpression
src/combinators/timeout.ts:58:9
     }
 
     // If the controller was aborted by our timer, normalise to a Timeout error.
-    if (controller.signal.aborted) {
+    if (false) {
       return err(
         httpRequestError(
killedBy: timeout — execute returns Err while timeout is aborted returns the original Err (not a Timeout error) when execute returns Err and timer is aborted
statusReason: expected 'Transport' to be 'Timeout' // Object.is equality

[Killed] BlockStatement
src/combinators/timeout.ts:70:19
     }
 
     return err(result.error);
-  } catch (cause) {
-    clearTimeout(timer);
-    return err(
-      httpRequestError(
-        "Timeout",
-        req,
-        `Request timed out after ${ms}ms: ${req.method} ${req.url}`,
-        cause,
-      ),
-    );
-  }
+  } catch (cause) {}
 }
 
killedBy: timeout — catch block (execute throws) returns Err with Transport reason when the inner execute throws an exception
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/combinators/timeout.ts:100:73
  * When both a per-request `HttpRequest.withTimeout(ms)` and this combinator are
  * used, the shorter timeout wins because both signals feed into the transport.
  */
-export function timeout(ms: number): (client: HttpClient) => HttpClient {
-  return (client) =>
-    createHttpClient((req) =>
-      ResultAsync.fromResult(executeWithTimeout(client.execute, req, ms)),
-    );
-}
+export function timeout(ms: number): (client: HttpClient) => HttpClient {}
 
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: (0 , __vite_ssr_import_3__.timeout)(...) is not a function

[Killed] ArrowFunction
src/combinators/timeout.ts:101:10
  * used, the shorter timeout wins because both signals feed into the transport.
  */
 export function timeout(ms: number): (client: HttpClient) => HttpClient {
-  return (client) =>
-    createHttpClient((req) =>
-      ResultAsync.fromResult(executeWithTimeout(client.execute, req, ms)),
-    );
+  return () => undefined;
 }
 
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: Cannot read properties of undefined (reading 'execute')

[Killed] ArrowFunction
src/combinators/timeout.ts:102:22
  */
 export function timeout(ms: number): (client: HttpClient) => HttpClient {
   return (client) =>
-    createHttpClient((req) =>
-      ResultAsync.fromResult(executeWithTimeout(client.execute, req, ms)),
+    createHttpClient(() => undefined,
     );
 }
killedBy: timeout — basic behaviour passes through a successful response when request completes within the timeout
statusReason: Cannot read properties of undefined (reading '_tag')
