[Killed] BlockStatement
src/errors/guards.ts:13:79
   HttpBodyError,
 } from "./index.js";
 
-export function isHttpRequestError(value: unknown): value is HttpRequestError {
-  return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpRequestError"
-  );
-}
+export function isHttpRequestError(value: unknown): value is HttpRequestError {}
 
 export function isHttpResponseError(value: unknown): value is HttpResponseError {
killedBy: retryTransient retries Transport errors
statusReason: expected 'Err' to be 'Ok' // Object.is equality

[Killed] LogicalOperator
src/errors/guards.ts:15:5
 
 export function isHttpRequestError(value: unknown): value is HttpRequestError {
   return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
+    typeof value === "object" && value !== null || "_tag" in value &&
     (value as { _tag: unknown })._tag === "HttpRequestError"
   );
killedBy: isHttpRequestError returns false for null
statusReason: Cannot use 'in' operator to search for '_tag' in null

[Killed] LogicalOperator
src/errors/guards.ts:15:5
 
 export function isHttpRequestError(value: unknown): value is HttpRequestError {
   return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpRequestError"
+    typeof value === "object" && value !== null && "_tag" in value || (value as {
+  _tag: unknown;
+})._tag === "HttpRequestError"
   );
 }
killedBy: retryTransient — HttpResponseError transient status codes (kills no-cov in isTransientError) retries HttpResponseError with status 429 (rate limit is transient)
statusReason: expected 'Err' to be 'Ok' // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:16:5
 export function isHttpRequestError(value: unknown): value is HttpRequestError {
   return (
     typeof value === "object" &&
-    value !== null &&
+    true &&
     "_tag" in value &&
     (value as { _tag: unknown })._tag === "HttpRequestError"
killedBy: isHttpRequestError returns false for null
statusReason: Cannot use 'in' operator to search for '_tag' in null

[Killed] EqualityOperator
src/errors/guards.ts:16:5
 export function isHttpRequestError(value: unknown): value is HttpRequestError {
   return (
     typeof value === "object" &&
-    value !== null &&
+    value === null &&
     "_tag" in value &&
     (value as { _tag: unknown })._tag === "HttpRequestError"
killedBy: isHttpRequestError returns true for HttpRequestError
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:18:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpRequestError"
+    true
   );
 }
killedBy: isHttpRequestError returns false for HttpResponseError
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:18:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpRequestError"
+    (value as {
+  _tag: unknown;
+})._tag !== "HttpRequestError"
   );
 }
killedBy: isHttpRequestError returns true for HttpRequestError
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:22:81
   );
 }
 
-export function isHttpResponseError(value: unknown): value is HttpResponseError {
-  return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpResponseError"
-  );
-}
+export function isHttpResponseError(value: unknown): value is HttpResponseError {}
 
 export function isHttpBodyError(value: unknown): value is HttpBodyError {
killedBy: isHttpResponseError returns true for HttpResponseError
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/errors/guards.ts:24:5
 
 export function isHttpResponseError(value: unknown): value is HttpResponseError {
   return (
-    typeof value === "object" &&
-    value !== null &&
+    typeof value === "object" || value !== null &&
     "_tag" in value &&
     (value as { _tag: unknown })._tag === "HttpResponseError"
killedBy: isHttpResponseError returns false for null
statusReason: Cannot use 'in' operator to search for '_tag' in null

[Killed] ConditionalExpression
src/errors/guards.ts:24:5
 
 export function isHttpResponseError(value: unknown): value is HttpResponseError {
   return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpResponseError"
+    false
   );
 }
killedBy: isHttpResponseError returns true for HttpResponseError
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/errors/guards.ts:26:5
   return (
     typeof value === "object" &&
     value !== null &&
-    "_tag" in value &&
+    "" in value &&
     (value as { _tag: unknown })._tag === "HttpResponseError"
   );
killedBy: isHttpResponseError returns true for HttpResponseError
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:27:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpResponseError"
+    true
   );
 }
killedBy: isHttpResponseError returns false for HttpRequestError
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:27:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpResponseError"
+    (value as {
+  _tag: unknown;
+})._tag !== "HttpResponseError"
   );
 }
killedBy: isHttpResponseError returns true for HttpResponseError
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:31:73
   );
 }
 
-export function isHttpBodyError(value: unknown): value is HttpBodyError {
-  return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpBodyError"
-  );
-}
+export function isHttpBodyError(value: unknown): value is HttpBodyError {}
 
 export function isHttpClientError(value: unknown): value is HttpClientError {
killedBy: isHttpBodyError returns true for HttpBodyError
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:33:5
 
 export function isHttpBodyError(value: unknown): value is HttpBodyError {
   return (
-    typeof value === "object" &&
-    value !== null &&
-    "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpBodyError"
+    false
   );
 }
killedBy: isHttpBodyError returns true for HttpBodyError
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:36:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpBodyError"
+    true
   );
 }
killedBy: isHttpBodyError returns false for HttpRequestError
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:36:5
     typeof value === "object" &&
     value !== null &&
     "_tag" in value &&
-    (value as { _tag: unknown })._tag === "HttpBodyError"
+    (value as {
+  _tag: unknown;
+})._tag !== "HttpBodyError"
   );
 }
killedBy: isHttpBodyError returns true for HttpBodyError
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:40:77
   );
 }
 
-export function isHttpClientError(value: unknown): value is HttpClientError {
-  return isHttpRequestError(value) || isHttpResponseError(value) || isHttpBodyError(value);
-}
+export function isHttpClientError(value: unknown): value is HttpClientError {}
 
 /**
killedBy: isHttpClientError returns true for HttpRequestError
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/errors/guards.ts:41:10
 }
 
 export function isHttpClientError(value: unknown): value is HttpClientError {
-  return isHttpRequestError(value) || isHttpResponseError(value) || isHttpBodyError(value);
+  return (isHttpRequestError(value) || isHttpResponseError(value)) && isHttpBodyError(value);
 }
 
killedBy: isHttpClientError returns true for HttpRequestError
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/errors/guards.ts:41:10
 }
 
 export function isHttpClientError(value: unknown): value is HttpClientError {
-  return isHttpRequestError(value) || isHttpResponseError(value) || isHttpBodyError(value);
+  return isHttpRequestError(value) && isHttpResponseError(value) || isHttpBodyError(value);
 }
 
killedBy: isHttpClientError returns true for HttpRequestError
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:50:67
  * - HttpRequestError with reason "Transport" or "Timeout"
  * - HttpResponseError with reason "StatusCode" and status 429 or 5xx (except 501, 505)
  */
-export function isTransientError(error: HttpClientError): boolean {
-  if (isHttpRequestError(error)) {
-    return error.reason === "Transport" || error.reason === "Timeout";
-  }
-  if (isHttpResponseError(error) && error.reason === "StatusCode") {
-    const { status } = error;
-    if (status === 429) return true;
-    if (status >= 500 && status <= 599 && status !== 501 && status !== 505) return true;
-  }
-  return false;
-}
+export function isTransientError(error: HttpClientError): boolean {}
 
 /** Check if an error is a rate limit (429). */
killedBy: isTransientError returns true for HttpRequestError with reason Transport
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:51:7
  * - HttpResponseError with reason "StatusCode" and status 429 or 5xx (except 501, 505)
  */
 export function isTransientError(error: HttpClientError): boolean {
-  if (isHttpRequestError(error)) {
+  if (false) {
     return error.reason === "Transport" || error.reason === "Timeout";
   }
killedBy: isTransientError returns true for HttpRequestError with reason Transport
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:51:34
  * - HttpResponseError with reason "StatusCode" and status 429 or 5xx (except 501, 505)
  */
 export function isTransientError(error: HttpClientError): boolean {
-  if (isHttpRequestError(error)) {
-    return error.reason === "Transport" || error.reason === "Timeout";
-  }
+  if (isHttpRequestError(error)) {}
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
     const { status } = error;
killedBy: isTransientError returns true for HttpRequestError with reason Transport
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:52:44
  */
 export function isTransientError(error: HttpClientError): boolean {
   if (isHttpRequestError(error)) {
-    return error.reason === "Transport" || error.reason === "Timeout";
+    return error.reason === "Transport" || error.reason !== "Timeout";
   }
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
killedBy: isTransientError returns true for HttpRequestError with reason Timeout
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:52:12
  */
 export function isTransientError(error: HttpClientError): boolean {
   if (isHttpRequestError(error)) {
-    return error.reason === "Transport" || error.reason === "Timeout";
+    return false;
   }
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
killedBy: isTransientError returns true for HttpRequestError with reason Transport
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:54:37
   if (isHttpRequestError(error)) {
     return error.reason === "Transport" || error.reason === "Timeout";
   }
-  if (isHttpResponseError(error) && error.reason === "StatusCode") {
+  if (isHttpResponseError(error) && true) {
     const { status } = error;
     if (status === 429) return true;
killedBy: isTransientError returns false for HttpResponseError with reason Decode (not StatusCode)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:54:37
   if (isHttpRequestError(error)) {
     return error.reason === "Transport" || error.reason === "Timeout";
   }
-  if (isHttpResponseError(error) && error.reason === "StatusCode") {
+  if (isHttpResponseError(error) && error.reason !== "StatusCode") {
     const { status } = error;
     if (status === 429) return true;
killedBy: isTransientError returns true for HttpResponseError StatusCode 429
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:56:9
   }
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
     const { status } = error;
-    if (status === 429) return true;
+    if (status !== 429) return true;
     if (status >= 500 && status <= 599 && status !== 501 && status !== 505) return true;
   }
killedBy: isTransientError returns true for HttpResponseError StatusCode 429
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:56:9
   }
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
     const { status } = error;
-    if (status === 429) return true;
+    if (false) return true;
     if (status >= 500 && status <= 599 && status !== 501 && status !== 505) return true;
   }
killedBy: isTransientError returns true for HttpResponseError StatusCode 429
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:57:9
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
     const { status } = error;
     if (status === 429) return true;
-    if (status >= 500 && status <= 599 && status !== 501 && status !== 505) return true;
+    if (status > 500 && status <= 599 && status !== 501 && status !== 505) return true;
   }
   return false;
killedBy: isTransientError returns true for HttpResponseError StatusCode 500
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:57:61
   if (isHttpResponseError(error) && error.reason === "StatusCode") {
     const { status } = error;
     if (status === 429) return true;
-    if (status >= 500 && status <= 599 && status !== 501 && status !== 505) return true;
+    if (status >= 500 && status <= 599 && status !== 501 && true) return true;
   }
   return false;
killedBy: isTransientError returns false for HttpResponseError StatusCode 505
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/errors/guards.ts:63:67
 }
 
 /** Check if an error is a rate limit (429). */
-export function isRateLimitError(error: HttpClientError): boolean {
-  return isHttpResponseError(error) && error.reason === "StatusCode" && error.status === 429;
-}
+export function isRateLimitError(error: HttpClientError): boolean {}
 
killedBy: isRateLimitError returns true for HttpResponseError StatusCode 429
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/guards.ts:64:73
 
 /** Check if an error is a rate limit (429). */
 export function isRateLimitError(error: HttpClientError): boolean {
-  return isHttpResponseError(error) && error.reason === "StatusCode" && error.status === 429;
+  return isHttpResponseError(error) && error.reason === "StatusCode" && true;
 }
 
killedBy: isRateLimitError returns false for HttpResponseError StatusCode 200
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/guards.ts:64:73
 
 /** Check if an error is a rate limit (429). */
 export function isRateLimitError(error: HttpClientError): boolean {
-  return isHttpResponseError(error) && error.reason === "StatusCode" && error.status === 429;
+  return isHttpResponseError(error) && error.reason === "StatusCode" && error.status !== 429;
 }
 
killedBy: isRateLimitError returns true for HttpResponseError StatusCode 429
statusReason: expected false to be true // Object.is equality
