[Killed] BlockStatement
src/errors/http-request-error.ts:25:21
   request: HttpRequest,
   message: string,
   cause?: unknown,
-): HttpRequestError {
-  return Object.freeze({
-    _tag: "HttpRequestError" as const,
-    reason,
-    request,
-    message,
-    cause,
-  });
-}
+): HttpRequestError {}
 
killedBy: mapRequest propagates errors from the inner client
statusReason: Cannot read properties of undefined (reading '_tag')
