[Killed] StringLiteral
src/inspection/library-inspector-bridge.ts:15:9
  * Port for the HTTP client library inspector bridge.
  */
 export const HttpClientLibraryInspectorPort = createLibraryInspectorPort({
-  name: "HttpClientLibraryInspector",
+  name: "",
   description: "Library inspector bridge for HTTP client",
 });
killedBy: HttpClientLibraryInspectorPort has __portName 'HttpClientLibraryInspector'
statusReason: expected '' to be 'HttpClientLibraryInspector' // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-bridge.ts:31:21
  */
 export function createHttpClientLibraryInspector(
   getSnapshotFn: () => HttpClientSnapshot,
-): LibraryInspector {
-  return {
-    name: "http-client",
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      const snapshot = getSnapshotFn();
-      return Object.freeze({
-        name: "http-client",
-        requestCount: snapshot.requestCount,
-        errorCount: snapshot.errorCount,
-        activeRequests: snapshot.activeRequests,
-        registeredClients: snapshot.registeredClients,
-      });
-    },
-    // No subscribe — HTTP client inspector is pull-only
-  };
-}
+): LibraryInspector {}
 
killedBy: createHttpClientLibraryInspector — identity returns a LibraryInspector with name 'http-client'
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
src/inspection/library-inspector-bridge.ts:32:10
 export function createHttpClientLibraryInspector(
   getSnapshotFn: () => HttpClientSnapshot,
 ): LibraryInspector {
-  return {
-    name: "http-client",
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      const snapshot = getSnapshotFn();
-      return Object.freeze({
-        name: "http-client",
-        requestCount: snapshot.requestCount,
-        errorCount: snapshot.errorCount,
-        activeRequests: snapshot.activeRequests,
-        registeredClients: snapshot.registeredClients,
-      });
-    },
-    // No subscribe — HTTP client inspector is pull-only
-  };
+  return {};
 }
 
killedBy: createHttpClientLibraryInspector — identity returns a LibraryInspector with name 'http-client'
statusReason: expected undefined to be 'http-client' // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-bridge.ts:34:54
 ): LibraryInspector {
   return {
     name: "http-client",
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      const snapshot = getSnapshotFn();
-      return Object.freeze({
-        name: "http-client",
-        requestCount: snapshot.requestCount,
-        errorCount: snapshot.errorCount,
-        activeRequests: snapshot.activeRequests,
-        registeredClients: snapshot.registeredClients,
-      });
-    },
+    getSnapshot(): Readonly<Record<string, unknown>> {},
     // No subscribe — HTTP client inspector is pull-only
   };
killedBy: createHttpClientLibraryInspector — getSnapshot() includes 'name' field with value 'http-client'
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] ObjectLiteral
src/inspection/library-inspector-bridge.ts:36:28
     name: "http-client",
     getSnapshot(): Readonly<Record<string, unknown>> {
       const snapshot = getSnapshotFn();
-      return Object.freeze({
-        name: "http-client",
-        requestCount: snapshot.requestCount,
-        errorCount: snapshot.errorCount,
-        activeRequests: snapshot.activeRequests,
-        registeredClients: snapshot.registeredClients,
-      });
+      return Object.freeze({});
     },
     // No subscribe — HTTP client inspector is pull-only
killedBy: createHttpClientLibraryInspector — getSnapshot() includes 'name' field with value 'http-client'
statusReason: expected undefined to be 'http-client' // Object.is equality
