[Killed] ObjectLiteral
src/ports/http-client-port.ts:130:50
  *
  * @see §26 of the http-client spec
  */
-export const HttpClientPort = port<HttpClient>()({
-  name: "HttpClient",
-  direction: "outbound",
-  description: "Platform-agnostic HTTP client for making outbound requests",
-  category: "infrastructure",
-  tags: ["http", "network", "io"],
-});
+export const HttpClientPort = port<HttpClient>()({});
 
 // =============================================================================
killedBy: HttpClientPort has __portName "HttpClient"
statusReason: expected undefined to be 'HttpClient' // Object.is equality

[Killed] StringLiteral
src/ports/http-client-port.ts:131:9
  * @see §26 of the http-client spec
  */
 export const HttpClientPort = port<HttpClient>()({
-  name: "HttpClient",
+  name: "",
   direction: "outbound",
   description: "Platform-agnostic HTTP client for making outbound requests",
killedBy: HttpClientPort has __portName "HttpClient"
statusReason: expected '' to be 'HttpClient' // Object.is equality

[Killed] StringLiteral
src/ports/http-client-port.ts:132:14
  */
 export const HttpClientPort = port<HttpClient>()({
   name: "HttpClient",
-  direction: "outbound",
+  direction: "",
   description: "Platform-agnostic HTTP client for making outbound requests",
   category: "infrastructure",
killedBy: DI graph integration HttpClientPort has expected metadata
statusReason: expected '' to be 'outbound' // Object.is equality
