[Killed] BlockStatement
src/adapters/adapter-bridge.ts:53:107
  */
 export function bridgeCreateAdapter(config: BridgeConfigNoDeps): AdapterConstraint;
 export function bridgeCreateAdapter(config: BridgeConfigWithDeps): AdapterConstraint;
-export function bridgeCreateAdapter(config: BridgeConfigNoDeps | BridgeConfigWithDeps): AdapterConstraint {
-  return Object.freeze({
-    provides: config.provides,
-    requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "singleton",
-    factoryKind: SYNC,
-    factory: config.factory,
-    clonable: FALSE,
-  });
-}
+export function bridgeCreateAdapter(config: BridgeConfigNoDeps | BridgeConfigWithDeps): AdapterConstraint {}
 
killedBy: createStreamedQueryAdapter returns an Adapter with streamed fetcher
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/adapters/adapter-bridge.ts:57:15
   return Object.freeze({
     provides: config.provides,
     requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "singleton",
+    lifetime: config.lifetime && "singleton",
     factoryKind: SYNC,
     factory: config.factory,
killedBy: createStreamedQueryAdapter custom lifetime is preserved
statusReason: expected 'singleton' to be 'transient' // Object.is equality

[NoCoverage] StringLiteral
src/adapters/adapter-bridge.ts:57:34
   return Object.freeze({
     provides: config.provides,
     requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "singleton",
+    lifetime: config.lifetime ?? "",
     factoryKind: SYNC,
     factory: config.factory,
