[Killed] BlockStatement
src/adapters/query-adapter.ts:94:22
 export function createQueryAdapter(
   port: AnyQueryPort,
   config: QueryAdapterConfigNoDeps<AnyQueryPort> | QueryAdapterConfigWithDeps<AnyQueryPort, ReadonlyArray<Port<unknown, string>>>,
-): AdapterConstraint {
-  if (config.requires !== undefined) {
-    return bridgeCreateAdapter({
-      provides: port,
-      requires: config.requires,
-      lifetime: config.lifetime ?? "singleton",
-      factory: config.factory,
-    });
-  }
-  return bridgeCreateAdapter({
-    provides: port,
-    lifetime: config.lifetime ?? "singleton",
-    factory: config.factory,
-  });
-}
+): AdapterConstraint {}
 
killedBy: createQueryAdapter returns a frozen Adapter object
statusReason: expected undefined to be defined

[NoCoverage] ObjectLiteral
src/adapters/query-adapter.ts:96:32
   config: QueryAdapterConfigNoDeps<AnyQueryPort> | QueryAdapterConfigWithDeps<AnyQueryPort, ReadonlyArray<Port<unknown, string>>>,
 ): AdapterConstraint {
   if (config.requires !== undefined) {
-    return bridgeCreateAdapter({
-      provides: port,
-      requires: config.requires,
-      lifetime: config.lifetime ?? "singleton",
-      factory: config.factory,
-    });
+    return bridgeCreateAdapter({});
   }
   return bridgeCreateAdapter({
