[Killed] ArrowFunction
src/client/query-client.ts:246:47
 
 export function createQueryClient(config: QueryClientConfig): QueryClient {
   const { container } = config;
-  const clock: Clock = config.clock ?? { now: () => Date.now() };
+  const clock: Clock = config.clock ?? { now: () => undefined };
   const defaults: QueryDefaults = { ...DEFAULT_QUERY_OPTIONS, ...config.defaults };
 
killedBy: QueryClient fetch uses cached data when fresh (respects staleTime)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/client/query-client.ts:246:24
 
 export function createQueryClient(config: QueryClientConfig): QueryClient {
   const { container } = config;
-  const clock: Clock = config.clock ?? { now: () => Date.now() };
+  const clock: Clock = config.clock && {
+  now: () => Date.now()
+};
   const defaults: QueryDefaults = { ...DEFAULT_QUERY_OPTIONS, ...config.defaults };
 
killedBy: dehydrate includes both success and error entries
statusReason: Cannot read properties of undefined (reading 'now')

[Killed] LogicalOperator
src/client/query-client.ts:250:23
   const defaults: QueryDefaults = { ...DEFAULT_QUERY_OPTIONS, ...config.defaults };
 
   // Resolve tracing: explicit tracingHook takes precedence over tracer shorthand
-  const tracingHook = config.tracingHook
-    ?? (config.tracer !== undefined ? createQueryTracingHook({ tracer: config.tracer }) : undefined);
+  const tracingHook = config.tracingHook && (config.tracer !== undefined ? createQueryTracingHook({
+  tracer: config.tracer
+}) : undefined);
 
   const cache = createQueryCache({ clock });
killedBy: QueryClient tracing integration emits onFetchStart and onFetchEnd on successful fetch
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/client/query-client.ts:251:9
 
   // Resolve tracing: explicit tracingHook takes precedence over tracer shorthand
   const tracingHook = config.tracingHook
-    ?? (config.tracer !== undefined ? createQueryTracingHook({ tracer: config.tracer }) : undefined);
+    ?? (config.tracer === undefined ? createQueryTracingHook({ tracer: config.tracer }) : undefined);
 
   const cache = createQueryCache({ clock });
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'pushSpan')

[Killed] ConditionalExpression
src/client/query-client.ts:251:9
 
   // Resolve tracing: explicit tracingHook takes precedence over tracer shorthand
   const tracingHook = config.tracingHook
-    ?? (config.tracer !== undefined ? createQueryTracingHook({ tracer: config.tracer }) : undefined);
+    ?? (true ? createQueryTracingHook({ tracer: config.tracer }) : undefined);
 
   const cache = createQueryCache({ clock });
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'pushSpan')

[Killed] BlockStatement
src/client/query-client.ts:261:27
   const persistenceManager = config.persister
     ? createPersistenceManager(config.persister, cache, clock)
     : undefined;
-  if (persistenceManager) {
-    persistenceUnsubscribe = cache.subscribe(persistenceManager.createListener());
-    void persistenceManager.restore();
-  }
+  if (persistenceManager) {}
 
   const cancellationControllers = new Map<string, AbortController>();
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/client/query-client.ts:261:7
   const persistenceManager = config.persister
     ? createPersistenceManager(config.persister, cache, clock)
     : undefined;
-  if (persistenceManager) {
+  if (false) {
     persistenceUnsubscribe = cache.subscribe(persistenceManager.createListener());
     void persistenceManager.restore();
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: expected "vi.fn()" to be called at least once

[Survived] LogicalOperator
src/client/query-client.ts:273:32
   let mutatingCount = 0;
 
   // Invalidation depth tracking
-  const maxInvalidationDepth = config.maxInvalidationDepth ?? 10;
+  const maxInvalidationDepth = config.maxInvalidationDepth && 10;
   let invalidationDepth = 0;
 

[Killed] BooleanLiteral
src/client/query-client.ts:277:16
   let invalidationDepth = 0;
 
   // Pause state
-  let paused = false;
+  let paused = true;
 
   // Event listeners
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:307:11
   function triggerRefetch(
     getSetting: (record: ObserverRecord) => boolean | "always",
     trigger: FetchTrigger
-  ): void {
-    if (disposed || paused) return;
-
-    for (const record of activeObservers) {
-      const setting = getSetting(record);
-      if (!setting) continue;
-
-      const entry = record.getEntry();
-      if (!entry) continue;
-
-      const shouldRefetch =
-        setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
-
-      if (shouldRefetch) {
-        if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
-          record.invalidate();
-        }
-        record.refetch(trigger);
-      }
-    }
-  }
+  ): void {}
 
   function onWindowFocus(): void {
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:308:9
     getSetting: (record: ObserverRecord) => boolean | "always",
     trigger: FetchTrigger
   ): void {
-    if (disposed || paused) return;
+    if (true) return;
 
     for (const record of activeObservers) {
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Survived] ConditionalExpression
src/client/query-client.ts:308:9
     getSetting: (record: ObserverRecord) => boolean | "always",
     trigger: FetchTrigger
   ): void {
-    if (disposed || paused) return;
+    if (false) return;
 
     for (const record of activeObservers) {

[Killed] BlockStatement
src/client/query-client.ts:310:43
   ): void {
     if (disposed || paused) return;
 
-    for (const record of activeObservers) {
-      const setting = getSetting(record);
-      if (!setting) continue;
-
-      const entry = record.getEntry();
-      if (!entry) continue;
-
-      const shouldRefetch =
-        setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
-
-      if (shouldRefetch) {
-        if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
-          record.invalidate();
-        }
-        record.refetch(trigger);
-      }
-    }
+    for (const record of activeObservers) {}
   }
 
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/client/query-client.ts:312:11
 
     for (const record of activeObservers) {
       const setting = getSetting(record);
-      if (!setting) continue;
+      if (setting) continue;
 
       const entry = record.getEntry();
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:312:11
 
     for (const record of activeObservers) {
       const setting = getSetting(record);
-      if (!setting) continue;
+      if (true) continue;
 
       const entry = record.getEntry();
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/client/query-client.ts:315:11
       if (!setting) continue;
 
       const entry = record.getEntry();
-      if (!entry) continue;
+      if (entry) continue;
 
       const shouldRefetch =
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:315:11
       if (!setting) continue;
 
       const entry = record.getEntry();
-      if (!entry) continue;
+      if (true) continue;
 
       const shouldRefetch =
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/client/query-client.ts:318:9
       if (!entry) continue;
 
       const shouldRefetch =
-        setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
+        setting !== "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
 
       if (shouldRefetch) {
killedBy: window-focus refetch refetchOnWindowFocus: 'always' — refetches fresh data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:318:9
       if (!entry) continue;
 
       const shouldRefetch =
-        setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
+        false;
 
       if (shouldRefetch) {
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:320:11
       const shouldRefetch =
         setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
 
-      if (shouldRefetch) {
+      if (false) {
         if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
           record.invalidate();
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:320:26
       const shouldRefetch =
         setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
 
-      if (shouldRefetch) {
-        if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
-          record.invalidate();
-        }
-        record.refetch(trigger);
-      }
+      if (shouldRefetch) {}
     }
   }
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/client/query-client.ts:321:37
         setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
 
       if (shouldRefetch) {
-        if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
+        if (setting === "always" && isStale(entry.dataUpdatedAt, record.getStaleTime())) {
           record.invalidate();
         }
killedBy: window-focus refetch refetchOnWindowFocus: 'always' — refetches fresh data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:321:13
         setting === "always" || isStale(entry.dataUpdatedAt, record.getStaleTime());
 
       if (shouldRefetch) {
-        if (setting === "always" && !isStale(entry.dataUpdatedAt, record.getStaleTime())) {
+        if (false) {
           record.invalidate();
         }
killedBy: window-focus refetch refetchOnWindowFocus: 'always' — refetches fresh data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:329:34
     }
   }
 
-  function onWindowFocus(): void {
-    triggerRefetch((r) => r.getRefetchOnWindowFocus(), "refetch-focus");
-  }
+  function onWindowFocus(): void {}
 
   function onNetworkReconnect(): void {
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/client/query-client.ts:330:20
   }
 
   function onWindowFocus(): void {
-    triggerRefetch((r) => r.getRefetchOnWindowFocus(), "refetch-focus");
+    triggerRefetch(() => undefined, "refetch-focus");
   }
 
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Survived] StringLiteral
src/client/query-client.ts:330:56
   }
 
   function onWindowFocus(): void {
-    triggerRefetch((r) => r.getRefetchOnWindowFocus(), "refetch-focus");
+    triggerRefetch((r) => r.getRefetchOnWindowFocus(), "");
   }
 

[Killed] BlockStatement
src/client/query-client.ts:333:39
     triggerRefetch((r) => r.getRefetchOnWindowFocus(), "refetch-focus");
   }
 
-  function onNetworkReconnect(): void {
-    triggerRefetch((r) => r.getRefetchOnReconnect(), "refetch-reconnect");
-  }
+  function onNetworkReconnect(): void {}
 
   const hasWindow = typeof globalThis.window !== "undefined";
killedBy: reconnect refetch refetchOnReconnect: true — refetches stale data on reconnect
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/client/query-client.ts:334:20
   }
 
   function onNetworkReconnect(): void {
-    triggerRefetch((r) => r.getRefetchOnReconnect(), "refetch-reconnect");
+    triggerRefetch(() => undefined, "refetch-reconnect");
   }
 
killedBy: reconnect refetch refetchOnReconnect: true — refetches stale data on reconnect
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:337:21
     triggerRefetch((r) => r.getRefetchOnReconnect(), "refetch-reconnect");
   }
 
-  const hasWindow = typeof globalThis.window !== "undefined";
+  const hasWindow = false;
   if (hasWindow) {
     globalThis.window.addEventListener("focus", onWindowFocus);
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/client/query-client.ts:337:21
     triggerRefetch((r) => r.getRefetchOnReconnect(), "refetch-reconnect");
   }
 
-  const hasWindow = typeof globalThis.window !== "undefined";
+  const hasWindow = typeof globalThis.window === "undefined";
   if (hasWindow) {
     globalThis.window.addEventListener("focus", onWindowFocus);
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:338:18
   }
 
   const hasWindow = typeof globalThis.window !== "undefined";
-  if (hasWindow) {
-    globalThis.window.addEventListener("focus", onWindowFocus);
-    globalThis.window.addEventListener("online", onNetworkReconnect);
-  }
+  if (hasWindow) {}
 
   function emitEvent(event: QueryClientEvent): void {
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:338:7
   }
 
   const hasWindow = typeof globalThis.window !== "undefined";
-  if (hasWindow) {
+  if (false) {
     globalThis.window.addEventListener("focus", onWindowFocus);
     globalThis.window.addEventListener("online", onNetworkReconnect);
killedBy: window-focus refetch refetchOnWindowFocus: true — refetches stale data on focus
statusReason: expected 1 to be 2 // Object.is equality

[Killed] StringLiteral
src/client/query-client.ts:340:40
   const hasWindow = typeof globalThis.window !== "undefined";
   if (hasWindow) {
     globalThis.window.addEventListener("focus", onWindowFocus);
-    globalThis.window.addEventListener("online", onNetworkReconnect);
+    globalThis.window.addEventListener("", onNetworkReconnect);
   }
 
killedBy: reconnect refetch refetchOnReconnect: true — refetches stale data on reconnect
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:343:53
     globalThis.window.addEventListener("online", onNetworkReconnect);
   }
 
-  function emitEvent(event: QueryClientEvent): void {
-    for (const listener of eventListeners) {
-      listener(event);
-    }
-  }
+  function emitEvent(event: QueryClientEvent): void {}
 
   function incrementFetching(portName: string): void {
killedBy: QueryClient subscribeToEvents delivers fetch-started event with portName
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/client/query-client.ts:344:44
   }
 
   function emitEvent(event: QueryClientEvent): void {
-    for (const listener of eventListeners) {
-      listener(event);
-    }
+    for (const listener of eventListeners) {}
   }
 
killedBy: QueryClient subscribeToEvents delivers fetch-started event with portName
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/client/query-client.ts:349:54
     }
   }
 
-  function incrementFetching(portName: string): void {
-    fetchingCounts.set(portName, (fetchingCounts.get(portName) ?? 0) + 1);
-  }
+  function incrementFetching(portName: string): void {}
 
   function decrementFetching(portName: string): void {
killedBy: QueryClient isFetching with filters filter by port returns per-port count
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/client/query-client.ts:350:35
   }
 
   function incrementFetching(portName: string): void {
-    fetchingCounts.set(portName, (fetchingCounts.get(portName) ?? 0) + 1);
+    fetchingCounts.set(portName, (fetchingCounts.get(portName) && 0) + 1);
   }
 
killedBy: QueryClient isFetching with filters filter by port returns per-port count
statusReason: expected NaN to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/client/query-client.ts:350:34
   }
 
   function incrementFetching(portName: string): void {
-    fetchingCounts.set(portName, (fetchingCounts.get(portName) ?? 0) + 1);
+    fetchingCounts.set(portName, (fetchingCounts.get(portName) ?? 0) - 1);
   }
 
killedBy: QueryClient isFetching with filters filter by port returns per-port count
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:353:54
     fetchingCounts.set(portName, (fetchingCounts.get(portName) ?? 0) + 1);
   }
 
-  function decrementFetching(portName: string): void {
-    const current = fetchingCounts.get(portName) ?? 0;
-    if (current <= 1) {
-      fetchingCounts.delete(portName);
-    } else {
-      fetchingCounts.set(portName, current - 1);
-    }
-  }
+  function decrementFetching(portName: string): void {}
 
   function assertNotDisposed(portName: string): Result<void, QueryResolutionError> {
killedBy: QueryClient isFetching with filters returns 0 when all fetches complete
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
src/client/query-client.ts:354:21
   }
 
   function decrementFetching(portName: string): void {
-    const current = fetchingCounts.get(portName) ?? 0;
+    const current = fetchingCounts.get(portName) && 0;
     if (current <= 1) {
       fetchingCounts.delete(portName);
killedBy: QueryClient fetchingCounts decrement isFetching decreases after a fetch completes
statusReason: expected NaN to be +0 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:355:23
 
   function decrementFetching(portName: string): void {
     const current = fetchingCounts.get(portName) ?? 0;
-    if (current <= 1) {
-      fetchingCounts.delete(portName);
-    } else {
+    if (current <= 1) {} else {
       fetchingCounts.set(portName, current - 1);
     }
killedBy: QueryClient isFetching with filters returns 0 when all fetches complete
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/client/query-client.ts:355:9
 
   function decrementFetching(portName: string): void {
     const current = fetchingCounts.get(portName) ?? 0;
-    if (current <= 1) {
+    if (current > 1) {
       fetchingCounts.delete(portName);
     } else {
killedBy: QueryClient fetchingCounts decrement isFetching decreases after a fetch completes
statusReason: expected -1 to be +0 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:357:12
     const current = fetchingCounts.get(portName) ?? 0;
     if (current <= 1) {
       fetchingCounts.delete(portName);
-    } else {
-      fetchingCounts.set(portName, current - 1);
-    }
+    } else {}
   }
 
killedBy: QueryClient fetchingCounts decrement isFetching decreases after a fetch completes
statusReason: expected 2 to be less than or equal to 1

[Killed] ArithmeticOperator
src/client/query-client.ts:358:36
     if (current <= 1) {
       fetchingCounts.delete(portName);
     } else {
-      fetchingCounts.set(portName, current - 1);
+      fetchingCounts.set(portName, current + 1);
     }
   }
killedBy: QueryClient fetchingCounts decrement isFetching decreases after a fetch completes
statusReason: expected 3 to be less than or equal to 1

[Killed] BlockStatement
src/client/query-client.ts:362:84
     }
   }
 
-  function assertNotDisposed(portName: string): Result<void, QueryResolutionError> {
-    if (disposed) {
-      return err(queryDisposed(portName));
-    }
-    return ok(undefined);
-  }
+  function assertNotDisposed(portName: string): Result<void, QueryResolutionError> {}
 
   function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] BlockStatement
src/client/query-client.ts:363:19
   }
 
   function assertNotDisposed(portName: string): Result<void, QueryResolutionError> {
-    if (disposed) {
-      return err(queryDisposed(portName));
-    }
+    if (disposed) {}
     return ok(undefined);
   }
killedBy: QueryClient fetch error path disposed client returns QueryDisposed error
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:363:9
   }
 
   function assertNotDisposed(portName: string): Result<void, QueryResolutionError> {
-    if (disposed) {
+    if (true) {
       return err(queryDisposed(portName));
     }
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:369:79
     return ok(undefined);
   }
 
-  function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
-    return {
-      retry: portDefaults?.retry ?? defaults.retry,
-      retryDelay: portDefaults?.retryDelay ?? defaults.retryDelay,
-    };
-  }
+  function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {}
 
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
killedBy: QueryClient cancelQueries cancels specific key with params
statusReason: Cannot destructure property 'retry' of 'config' as it is undefined.

[Killed] OptionalChaining
src/client/query-client.ts:371:14
 
   function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
     return {
-      retry: portDefaults?.retry ?? defaults.retry,
+      retry: portDefaults.retry ?? defaults.retry,
       retryDelay: portDefaults?.retryDelay ?? defaults.retryDelay,
     };
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'retry')

[Killed] LogicalOperator
src/client/query-client.ts:371:14
 
   function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
     return {
-      retry: portDefaults?.retry ?? defaults.retry,
+      retry: portDefaults?.retry && defaults.retry,
       retryDelay: portDefaults?.retryDelay ?? defaults.retryDelay,
     };
killedBy: QueryClient cancelQueries cancels specific key with params
statusReason: retry is not a function

[Killed] OptionalChaining
src/client/query-client.ts:372:19
   function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
     return {
       retry: portDefaults?.retry ?? defaults.retry,
-      retryDelay: portDefaults?.retryDelay ?? defaults.retryDelay,
+      retryDelay: portDefaults.retryDelay ?? defaults.retryDelay,
     };
   }
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'retryDelay')

[Killed] LogicalOperator
src/client/query-client.ts:372:19
   function getRetryConfig(portDefaults?: Partial<QueryDefaults>): RetryConfig {
     return {
       retry: portDefaults?.retry ?? defaults.retry,
-      retryDelay: portDefaults?.retryDelay ?? defaults.retryDelay,
+      retryDelay: portDefaults?.retryDelay && defaults.retryDelay,
     };
   }
killedBy: QueryInspector event handler coverage retry updates pending retryAttempt
statusReason: retryDelay is not a function

[Killed] BlockStatement
src/client/query-client.ts:376:83
     };
   }
 
-  function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
-    if (dataUpdatedAt === undefined) return true;
-    if (staleTime === 0) return true;
-    return clock.now() - dataUpdatedAt > staleTime;
-  }
+  function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {}
 
   /**
killedBy: QueryClient fetch refetches when data is stale
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/client/query-client.ts:377:9
   }
 
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
-    if (dataUpdatedAt === undefined) return true;
+    if (dataUpdatedAt !== undefined) return true;
     if (staleTime === 0) return true;
     return clock.now() - dataUpdatedAt > staleTime;
killedBy: QueryClient fetch uses cached data when fresh (respects staleTime)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:377:9
   }
 
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
-    if (dataUpdatedAt === undefined) return true;
+    if (true) return true;
     if (staleTime === 0) return true;
     return clock.now() - dataUpdatedAt > staleTime;
killedBy: QueryClient fetch uses cached data when fresh (respects staleTime)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/client/query-client.ts:378:33
 
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
     if (dataUpdatedAt === undefined) return true;
-    if (staleTime === 0) return true;
+    if (staleTime === 0) return false;
     return clock.now() - dataUpdatedAt > staleTime;
   }
killedBy: QueryClient fetch refetches when data is stale
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:378:9
 
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
     if (dataUpdatedAt === undefined) return true;
-    if (staleTime === 0) return true;
+    if (true) return true;
     return clock.now() - dataUpdatedAt > staleTime;
   }
killedBy: QueryClient fetch uses cached data when fresh (respects staleTime)
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/client/query-client.ts:379:12
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
     if (dataUpdatedAt === undefined) return true;
     if (staleTime === 0) return true;
-    return clock.now() - dataUpdatedAt > staleTime;
+    return clock.now() - dataUpdatedAt <= staleTime;
   }
 
killedBy: QueryInspector event handler coverage cache-hit increments totalCacheHits (affects cacheHitRate)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/client/query-client.ts:379:12
   function isStale(dataUpdatedAt: number | undefined, staleTime: number): boolean {
     if (dataUpdatedAt === undefined) return true;
     if (staleTime === 0) return true;
-    return clock.now() - dataUpdatedAt > staleTime;
+    return false;
   }
 
killedBy: QueryClient isStale boundary (targeted) data becomes stale exactly when clock exceeds staleTime
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/client/query-client.ts:386:43
    * Safely invoke a user-provided callback, swallowing any thrown exceptions.
    * This prevents user callbacks from breaking the never-reject invariant.
    */
-  function safeCall(fn: () => void): void {
-    fromThrowable(fn, () => undefined);
-  }
+  function safeCall(fn: () => void): void {}
 
   /**
killedBy: QueryClient mutation callbacks onSuccess callback receives data, input, and context
statusReason: expected "vi.fn()" to be called with arguments: [ 'id-1', { name: 'Alice' }, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/client/query-client.ts:394:80
    * Safely invoke an async user-provided callback, wrapping the result
    * in a ResultAsync that captures thrown exceptions as Err values.
    */
-  function safeCallAsync<T>(fn: () => T | Promise<T>): ResultAsync<T, unknown> {
-    return ResultAsync.fromPromise(
-      Promise.resolve().then(fn),
-      (cause) => cause
-    );
-  }
+  function safeCallAsync<T>(fn: () => T | Promise<T>): ResultAsync<T, unknown> {}
 
   /**
killedBy: QueryClient mutation callbacks onMutate callback receives input
statusReason: Cannot read properties of undefined (reading 'isErr')

[Survived] ArrowFunction
src/client/query-client.ts:397:7
   function safeCallAsync<T>(fn: () => T | Promise<T>): ResultAsync<T, unknown> {
     return ResultAsync.fromPromise(
       Promise.resolve().then(fn),
-      (cause) => cause
+      () => undefined
     );
   }
