[Killed] EqualityOperator
src/inspector/query-inspector.ts:509:47
     // Since we work with snapshots here, we check via the cache's reactive entries.
     const cacheTime = client.defaults.cacheTime;
     if (entry.dataUpdatedAt !== undefined && Date.now() - entry.dataUpdatedAt > cacheTime) return true;
-    if (entry.errorUpdatedAt !== undefined && Date.now() - entry.errorUpdatedAt > cacheTime) return true;
+    if (entry.errorUpdatedAt !== undefined && Date.now() - entry.errorUpdatedAt <= cacheTime) return true;
     return false;
   }
killedBy: QueryInspector isGcEligible via getStats gcEligibleCount entry with expired errorUpdatedAt is gc eligible
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/inspector/query-inspector.ts:510:12
     const cacheTime = client.defaults.cacheTime;
     if (entry.dataUpdatedAt !== undefined && Date.now() - entry.dataUpdatedAt > cacheTime) return true;
     if (entry.errorUpdatedAt !== undefined && Date.now() - entry.errorUpdatedAt > cacheTime) return true;
-    return false;
+    return true;
   }
 
killedBy: QueryInspector isGcEligible via getStats gcEligibleCount entry not expired and no observers is not gc eligible
statusReason: expected 1 to be +0 // Object.is equality

[Killed] StringLiteral
src/inspector/query-inspector.ts:516:46
   const DATA_TRUNCATION_THRESHOLD = 100_000;
 
   function buildEntrySnapshot(key: CacheKey, entry: CacheEntrySnapshot): QueryEntrySnapshot {
-    const isFetchingNow = pendingFetches.has(`${key[0]}:${key[1]}`);
+    const isFetchingNow = pendingFetches.has(``);
     let data: unknown | "[truncated]" = entry.data;
     if (data !== undefined) {
killedBy: QueryInspector isFetching snapshot during in-flight fetch (mutant-killing) getSnapshots.fetchStatus is true for pending entry while fetch is in flight
statusReason: expected 'idle' to be 'fetching' // Object.is equality

[Survived] BlockStatement
src/inspector/query-inspector.ts:518:29
   function buildEntrySnapshot(key: CacheKey, entry: CacheEntrySnapshot): QueryEntrySnapshot {
     const isFetchingNow = pendingFetches.has(`${key[0]}:${key[1]}`);
     let data: unknown | "[truncated]" = entry.data;
-    if (data !== undefined) {
-      const serialized = stableStringify(data);
-      if (serialized.length > DATA_TRUNCATION_THRESHOLD) {
-        data = "[truncated]";
-      }
-    }
+    if (data !== undefined) {}
 
     // Check subscriber status via reactive entry

[Survived] ConditionalExpression
src/inspector/query-inspector.ts:518:9
   function buildEntrySnapshot(key: CacheKey, entry: CacheEntrySnapshot): QueryEntrySnapshot {
     const isFetchingNow = pendingFetches.has(`${key[0]}:${key[1]}`);
     let data: unknown | "[truncated]" = entry.data;
-    if (data !== undefined) {
+    if (true) {
       const serialized = stableStringify(data);
       if (serialized.length > DATA_TRUNCATION_THRESHOLD) {

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:520:11
     let data: unknown | "[truncated]" = entry.data;
     if (data !== undefined) {
       const serialized = stableStringify(data);
-      if (serialized.length > DATA_TRUNCATION_THRESHOLD) {
+      if (true) {
         data = "[truncated]";
       }
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected '[truncated]' to deeply equal [ 'Alice', 'Bob' ]

[Killed] EqualityOperator
src/inspector/query-inspector.ts:520:11
     let data: unknown | "[truncated]" = entry.data;
     if (data !== undefined) {
       const serialized = stableStringify(data);
-      if (serialized.length > DATA_TRUNCATION_THRESHOLD) {
+      if (serialized.length <= DATA_TRUNCATION_THRESHOLD) {
         data = "[truncated]";
       }
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected '[truncated]' to deeply equal [ 'Alice', 'Bob' ]

[NoCoverage] StringLiteral
src/inspector/query-inspector.ts:521:16
     if (data !== undefined) {
       const serialized = stableStringify(data);
       if (serialized.length > DATA_TRUNCATION_THRESHOLD) {
-        data = "[truncated]";
+        data = "";
       }
     }

[Killed] LogicalOperator
src/inspector/query-inspector.ts:527:33
 
     // Check subscriber status via reactive entry
     const reactiveEntry = cache.getEntry({ __portName: key[0] }, parseJsonSafe(key[1]));
-    const entryHasSubscribers = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
+    const entryHasSubscribers = reactiveEntry !== undefined || hasSubscribers(reactiveEntry);
 
     return {
killedBy: QueryInspector getQuerySnapshot fields (targeted) hasSubscribers is false when no subscribers
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:527:33
 
     // Check subscriber status via reactive entry
     const reactiveEntry = cache.getEntry({ __portName: key[0] }, parseJsonSafe(key[1]));
-    const entryHasSubscribers = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
+    const entryHasSubscribers = true;
 
     return {
killedBy: QueryInspector getQuerySnapshot fields (targeted) hasSubscribers is false when no subscribers
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/inspector/query-inspector.ts:530:13
     const entryHasSubscribers = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
 
     return {
-      kind: "query-entry",
+      kind: "",
       portName: key[0],
       params: key[1] !== undefined ? parseJsonSafe(key[1]) : undefined,
killedBy: QueryInspector getQuerySnapshot snapshot has kind 'query-entry'
statusReason: expected '' to be 'query-entry' // Object.is equality

[Survived] ConditionalExpression
src/inspector/query-inspector.ts:532:15
     return {
       kind: "query-entry",
       portName: key[0],
-      params: key[1] !== undefined ? parseJsonSafe(key[1]) : undefined,
+      params: true ? parseJsonSafe(key[1]) : undefined,
       cacheKey: key,
       status: entry.status,

[Survived] ConditionalExpression
src/inspector/query-inspector.ts:532:15
     return {
       kind: "query-entry",
       portName: key[0],
-      params: key[1] !== undefined ? parseJsonSafe(key[1]) : undefined,
+      params: false ? parseJsonSafe(key[1]) : undefined,
       cacheKey: key,
       status: entry.status,

[Killed] BooleanLiteral
src/inspector/query-inspector.ts:552:48
   return {
     getSnapshot(): QuerySnapshot {
       const entries: QueryEntrySnapshot[] = [];
-      const allCacheEntries = cache.find(() => true);
+      const allCacheEntries = cache.find(() => false);
 
       for (const [key, entry] of allCacheEntries) {
killedBy: QueryInspector getSnapshot returns entries for cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/inspector/query-inspector.ts:552:42
   return {
     getSnapshot(): QuerySnapshot {
       const entries: QueryEntrySnapshot[] = [];
-      const allCacheEntries = cache.find(() => true);
+      const allCacheEntries = cache.find(() => undefined);
 
       for (const [key, entry] of allCacheEntries) {
killedBy: QueryInspector getSnapshot returns entries for cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/inspector/query-inspector.ts:554:51
       const entries: QueryEntrySnapshot[] = [];
       const allCacheEntries = cache.find(() => true);
 
-      for (const [key, entry] of allCacheEntries) {
-        entries.push(buildEntrySnapshot(key, entry));
-      }
+      for (const [key, entry] of allCacheEntries) {}
 
       // Build in-flight snapshots from pendingFetches
killedBy: QueryInspector getSnapshot returns entries for cached queries
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArrayDeclaration
src/inspector/query-inspector.ts:559:44
       }
 
       // Build in-flight snapshots from pendingFetches
-      const inFlight: InFlightSnapshot[] = [];
+      const inFlight: InFlightSnapshot[] = ["Stryker was here"];
       const now = Date.now();
       for (const [eventKey, pending] of pendingFetches) {

[Survived] BlockStatement
src/inspector/query-inspector.ts:561:57
       // Build in-flight snapshots from pendingFetches
       const inFlight: InFlightSnapshot[] = [];
       const now = Date.now();
-      for (const [eventKey, pending] of pendingFetches) {
-        const separatorIdx = eventKey.indexOf(":");
-        const portName = eventKey.substring(0, separatorIdx);
-        const paramsStr = eventKey.substring(separatorIdx + 1);
-        inFlight.push({
-          kind: "in-flight",
-          portName,
-          params: parseJsonSafe(paramsStr),
-          cacheKey: eventKey,
-          startedAt: pending.timestamp,
-          elapsedMs: now - pending.timestamp,
-          retryAttempt: pending.retryAttempt,
-        });
-      }
+      for (const [eventKey, pending] of pendingFetches) {}
 
       return {

[Survived] MethodExpression
src/inspector/query-inspector.ts:563:26
       const now = Date.now();
       for (const [eventKey, pending] of pendingFetches) {
         const separatorIdx = eventKey.indexOf(":");
-        const portName = eventKey.substring(0, separatorIdx);
+        const portName = eventKey;
         const paramsStr = eventKey.substring(separatorIdx + 1);
         inFlight.push({

[Survived] MethodExpression
src/inspector/query-inspector.ts:564:27
       for (const [eventKey, pending] of pendingFetches) {
         const separatorIdx = eventKey.indexOf(":");
         const portName = eventKey.substring(0, separatorIdx);
-        const paramsStr = eventKey.substring(separatorIdx + 1);
+        const paramsStr = eventKey;
         inFlight.push({
           kind: "in-flight",

[Survived] ArithmeticOperator
src/inspector/query-inspector.ts:564:46
       for (const [eventKey, pending] of pendingFetches) {
         const separatorIdx = eventKey.indexOf(":");
         const portName = eventKey.substring(0, separatorIdx);
-        const paramsStr = eventKey.substring(separatorIdx + 1);
+        const paramsStr = eventKey.substring(separatorIdx - 1);
         inFlight.push({
           kind: "in-flight",

[Survived] ObjectLiteral
src/inspector/query-inspector.ts:565:23
         const separatorIdx = eventKey.indexOf(":");
         const portName = eventKey.substring(0, separatorIdx);
         const paramsStr = eventKey.substring(separatorIdx + 1);
-        inFlight.push({
-          kind: "in-flight",
-          portName,
-          params: parseJsonSafe(paramsStr),
-          cacheKey: eventKey,
-          startedAt: pending.timestamp,
-          elapsedMs: now - pending.timestamp,
-          retryAttempt: pending.retryAttempt,
-        });
+        inFlight.push({});
       }
 

[Survived] StringLiteral
src/inspector/query-inspector.ts:566:17
         const portName = eventKey.substring(0, separatorIdx);
         const paramsStr = eventKey.substring(separatorIdx + 1);
         inFlight.push({
-          kind: "in-flight",
+          kind: "",
           portName,
           params: parseJsonSafe(paramsStr),

[Survived] ArithmeticOperator
src/inspector/query-inspector.ts:571:22
           params: parseJsonSafe(paramsStr),
           cacheKey: eventKey,
           startedAt: pending.timestamp,
-          elapsedMs: now - pending.timestamp,
+          elapsedMs: now + pending.timestamp,
           retryAttempt: pending.retryAttempt,
         });

[Killed] BlockStatement
src/inspector/query-inspector.ts:584:111
       };
     },
 
-    getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {
-      const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
-      if (portEntries.length === 0) return undefined;
-
-      if (params !== undefined) {
-        const paramStr = JSON.stringify(params);
-        const match = portEntries.find(([k]) => k[1] === paramStr);
-        if (!match) return undefined;
-        return buildEntrySnapshot(match[0], match[1]);
-      }
-
-      const [key, entry] = portEntries[0];
-      return buildEntrySnapshot(key, entry);
-    },
+    getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {},
 
     subscribe(listener: CacheListener): () => void {
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:585:53
     },
 
     getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {
-      const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
+      const portEntries = cache.find((_entry, k) => false);
       if (portEntries.length === 0) return undefined;
 
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/inspector/query-inspector.ts:585:38
     },
 
     getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {
-      const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
+      const portEntries = cache.find(() => undefined);
       if (portEntries.length === 0) return undefined;
 
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:586:11
 
     getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {
       const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
-      if (portEntries.length === 0) return undefined;
+      if (true) return undefined;
 
       if (params !== undefined) {
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/inspector/query-inspector.ts:586:11
 
     getQuerySnapshot(port: { readonly __portName: string }, params?: unknown): QueryEntrySnapshot | undefined {
       const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
-      if (portEntries.length === 0) return undefined;
+      if (portEntries.length !== 0) return undefined;
 
       if (params !== undefined) {
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/inspector/query-inspector.ts:588:11
       const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
       if (portEntries.length === 0) return undefined;
 
-      if (params !== undefined) {
+      if (params === undefined) {
         const paramStr = JSON.stringify(params);
         const match = portEntries.find(([k]) => k[1] === paramStr);
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:588:11
       const portEntries = cache.find((_entry, k) => k[0] === port.__portName);
       if (portEntries.length === 0) return undefined;
 
-      if (params !== undefined) {
+      if (true) {
         const paramStr = JSON.stringify(params);
         const match = portEntries.find(([k]) => k[1] === paramStr);
killedBy: QueryInspector getQuerySnapshot returns snapshot for existing query
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/inspector/query-inspector.ts:590:49
 
       if (params !== undefined) {
         const paramStr = JSON.stringify(params);
-        const match = portEntries.find(([k]) => k[1] === paramStr);
+        const match = portEntries.find(([k]) => k[1] !== paramStr);
         if (!match) return undefined;
         return buildEntrySnapshot(match[0], match[1]);
killedBy: QueryInspector getQuerySnapshot fields (targeted) isStale is true when entry.dataUpdatedAt is undefined
statusReason: Cannot read properties of undefined (reading 'isStale')

[Killed] ArrowFunction
src/inspector/query-inspector.ts:590:40
 
       if (params !== undefined) {
         const paramStr = JSON.stringify(params);
-        const match = portEntries.find(([k]) => k[1] === paramStr);
+        const match = portEntries.find(() => undefined);
         if (!match) return undefined;
         return buildEntrySnapshot(match[0], match[1]);
killedBy: QueryInspector getQuerySnapshot fields (targeted) isStale is true when entry.dataUpdatedAt is undefined
statusReason: Cannot read properties of undefined (reading 'isStale')

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:591:13
       if (params !== undefined) {
         const paramStr = JSON.stringify(params);
         const match = portEntries.find(([k]) => k[1] === paramStr);
-        if (!match) return undefined;
+        if (true) return undefined;
         return buildEntrySnapshot(match[0], match[1]);
       }
killedBy: QueryInspector getQuerySnapshot fields (targeted) isStale is true when entry.dataUpdatedAt is undefined
statusReason: Cannot read properties of undefined (reading 'isStale')

[Killed] BooleanLiteral
src/inspector/query-inspector.ts:591:13
       if (params !== undefined) {
         const paramStr = JSON.stringify(params);
         const match = portEntries.find(([k]) => k[1] === paramStr);
-        if (!match) return undefined;
+        if (match) return undefined;
         return buildEntrySnapshot(match[0], match[1]);
       }
killedBy: QueryInspector getQuerySnapshot fields (targeted) isStale is true when entry.dataUpdatedAt is undefined
statusReason: Cannot read properties of undefined (reading 'isStale')

[Killed] BlockStatement
src/inspector/query-inspector.ts:599:52
       return buildEntrySnapshot(key, entry);
     },
 
-    subscribe(listener: CacheListener): () => void {
-      return cache.subscribe(listener);
-    },
+    subscribe(listener: CacheListener): () => void {},
 
     getCacheStats(): CacheStats {
killedBy: QueryInspector subscribe fires cache events on mutations
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/inspector/query-inspector.ts:610:48
       let errorCount = 0;
       let gcEligible = 0;
 
-      const allCacheEntries = cache.find(() => true);
+      const allCacheEntries = cache.find(() => false);
       for (const [key, entry] of allCacheEntries) {
         total++;
killedBy: QueryInspector getSnapshot includes stats in snapshot
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/inspector/query-inspector.ts:610:42
       let errorCount = 0;
       let gcEligible = 0;
 
-      const allCacheEntries = cache.find(() => true);
+      const allCacheEntries = cache.find(() => undefined);
       for (const [key, entry] of allCacheEntries) {
         total++;
killedBy: QueryInspector getSnapshot includes stats in snapshot
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/inspector/query-inspector.ts:611:51
       let gcEligible = 0;
 
       const allCacheEntries = cache.find(() => true);
-      for (const [key, entry] of allCacheEntries) {
-        total++;
-        const params = parseJsonSafe(key[1]);
-        const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
-        const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
-        if (entryHasSubs) active++;
-        if (isStale(entry)) stale++;
-        if (entry.status === "error") errorCount++;
-        // GC eligibility: must not have subscribers AND must be expired
-        if (!entryHasSubs && isGcEligible(entry)) gcEligible++;
-      }
+      for (const [key, entry] of allCacheEntries) {}
 
       const history = fetchHistory.toArray();
killedBy: QueryInspector getSnapshot includes stats in snapshot
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/inspector/query-inspector.ts:612:9
 
       const allCacheEntries = cache.find(() => true);
       for (const [key, entry] of allCacheEntries) {
-        total++;
+        total--;
         const params = parseJsonSafe(key[1]);
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
killedBy: QueryInspector getSnapshot includes stats in snapshot
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:615:30
         total++;
         const params = parseJsonSafe(key[1]);
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
-        const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
+        const entryHasSubs = false;
         if (entryHasSubs) active++;
         if (isStale(entry)) stale++;
killedBy: QueryInspector getCacheStats counts active entries (with observers)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/inspector/query-inspector.ts:615:30
         total++;
         const params = parseJsonSafe(key[1]);
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
-        const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
+        const entryHasSubs = reactiveEntry !== undefined || hasSubscribers(reactiveEntry);
         if (entryHasSubs) active++;
         if (isStale(entry)) stale++;
killedBy: QueryInspector isGcEligible via getStats gcEligibleCount entry with expired dataUpdatedAt and no observers is gc eligible
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/inspector/query-inspector.ts:616:27
         const params = parseJsonSafe(key[1]);
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
-        if (entryHasSubs) active++;
+        if (entryHasSubs) active--;
         if (isStale(entry)) stale++;
         if (entry.status === "error") errorCount++;
killedBy: QueryInspector getCacheStats counts active entries (with observers)
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:616:13
         const params = parseJsonSafe(key[1]);
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
-        if (entryHasSubs) active++;
+        if (true) active++;
         if (isStale(entry)) stale++;
         if (entry.status === "error") errorCount++;
killedBy: Introspection Integration stats show active entries when observers are present
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:617:13
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
         if (entryHasSubs) active++;
-        if (isStale(entry)) stale++;
+        if (false) stale++;
         if (entry.status === "error") errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
killedBy: QueryInspector getDiagnostics (extended) reports staleQueries for invalidated entries
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:617:13
         const reactiveEntry = cache.getEntry({ __portName: key[0] }, params);
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
         if (entryHasSubs) active++;
-        if (isStale(entry)) stale++;
+        if (true) stale++;
         if (entry.status === "error") errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
killedBy: QueryInspector getStats computations (targeted) staleEntries counts entries that are stale
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:618:13
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
         if (entryHasSubs) active++;
         if (isStale(entry)) stale++;
-        if (entry.status === "error") errorCount++;
+        if (false) errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
         if (!entryHasSubs && isGcEligible(entry)) gcEligible++;
killedBy: QueryInspector getCacheStats counts error entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:618:13
         const entryHasSubs = reactiveEntry !== undefined && hasSubscribers(reactiveEntry);
         if (entryHasSubs) active++;
         if (isStale(entry)) stale++;
-        if (entry.status === "error") errorCount++;
+        if (entry.status !== "error") errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
         if (!entryHasSubs && isGcEligible(entry)) gcEligible++;
killedBy: QueryInspector getCacheStats counts error entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/inspector/query-inspector.ts:620:13
         if (isStale(entry)) stale++;
         if (entry.status === "error") errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
-        if (!entryHasSubs && isGcEligible(entry)) gcEligible++;
+        if (!entryHasSubs || isGcEligible(entry)) gcEligible++;
       }
 
killedBy: QueryInspector isGcEligible via getStats gcEligibleCount entry with observers is not gc eligible
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:620:13
         if (isStale(entry)) stale++;
         if (entry.status === "error") errorCount++;
         // GC eligibility: must not have subscribers AND must be expired
-        if (!entryHasSubs && isGcEligible(entry)) gcEligible++;
+        if (true) gcEligible++;
       }
 
killedBy: QueryInspector isGcEligible via getStats gcEligibleCount entry with observers is not gc eligible
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/inspector/query-inspector.ts:624:56
       }
 
       const history = fetchHistory.toArray();
-      const totalDuration = history.reduce((sum, h) => sum + h.durationMs, 0);
+      const totalDuration = history.reduce((sum, h) => sum - h.durationMs, 0);
 
       return {
killedBy: QueryInspector non-zero fetch duration (mutant-killing) avgFetchDurationMs is positive when fetches have non-zero duration
statusReason: expected -51 to be greater than 0

[Killed] ArrowFunction
src/inspector/query-inspector.ts:624:44
       }
 
       const history = fetchHistory.toArray();
-      const totalDuration = history.reduce((sum, h) => sum + h.durationMs, 0);
+      const totalDuration = history.reduce(() => undefined, 0);
 
       return {
killedBy: QueryInspector getDiagnostics (extended) avgFetchDurationMs is computed from fetch history
statusReason: expected NaN to be greater than or equal to 0

[Killed] ArithmeticOperator
src/inspector/query-inspector.ts:632:48
         staleEntries: stale,
         errorEntries: errorCount,
         inFlightCount: client.isFetching(),
-        cacheHitRate: totalFetchRequests > 0 ? totalCacheHits / totalFetchRequests : 0,
+        cacheHitRate: totalFetchRequests > 0 ? totalCacheHits * totalFetchRequests : 0,
         avgFetchDurationMs: history.length > 0 ? totalDuration / history.length : 0,
         gcEligibleCount: gcEligible,
killedBy: QueryInspector event handler coverage cache-hit increases cacheHitRate relative to total fetch requests
statusReason: expected 2 to be 0.5 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:632:23
         staleEntries: stale,
         errorEntries: errorCount,
         inFlightCount: client.isFetching(),
-        cacheHitRate: totalFetchRequests > 0 ? totalCacheHits / totalFetchRequests : 0,
+        cacheHitRate: totalFetchRequests >= 0 ? totalCacheHits / totalFetchRequests : 0,
         avgFetchDurationMs: history.length > 0 ? totalDuration / history.length : 0,
         gcEligibleCount: gcEligible,
killedBy: QueryInspector getStats computations (targeted) cacheHitRate division: 0 fetch requests → rate is 0
statusReason: expected NaN to be +0 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:633:29
         errorEntries: errorCount,
         inFlightCount: client.isFetching(),
         cacheHitRate: totalFetchRequests > 0 ? totalCacheHits / totalFetchRequests : 0,
-        avgFetchDurationMs: history.length > 0 ? totalDuration / history.length : 0,
+        avgFetchDurationMs: history.length <= 0 ? totalDuration / history.length : 0,
         gcEligibleCount: gcEligible,
       };
killedBy: QueryInspector getStats computations (targeted) avgFetchDurationMs division: 0 history entries → avg is 0
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:633:29
         errorEntries: errorCount,
         inFlightCount: client.isFetching(),
         cacheHitRate: totalFetchRequests > 0 ? totalCacheHits / totalFetchRequests : 0,
-        avgFetchDurationMs: history.length > 0 ? totalDuration / history.length : 0,
+        avgFetchDurationMs: false ? totalDuration / history.length : 0,
         gcEligibleCount: gcEligible,
       };
killedBy: QueryInspector non-zero fetch duration (mutant-killing) avgFetchDurationMs is positive when fetches have non-zero duration
statusReason: expected 0 to be greater than 0
