[Killed] BlockStatement
src/inspector/query-inspector.ts:641:19
     getFetchHistory(filter?: FetchHistoryFilter): ReadonlyArray<FetchHistoryEntry> {
       let entries = fetchHistory.toArray();
 
-      if (filter) {
-        if (filter.portName !== undefined) {
-          entries = entries.filter((e) => e.portName === filter.portName);
-        }
-        if (filter.result !== undefined) {
-          entries = entries.filter((e) => e.result === filter.result);
-        }
-        if (filter.minDurationMs !== undefined) {
-          const min = filter.minDurationMs;
-          entries = entries.filter((e) => e.durationMs >= min);
-        }
-        if (filter.since !== undefined) {
-          const since = filter.since;
-          entries = entries.filter((e) => e.timestamp >= since);
-        }
-        if (filter.trigger !== undefined) {
-          entries = entries.filter((e) => e.trigger === filter.trigger);
-        }
-        if (filter.limit !== undefined) {
-          entries = entries.slice(-filter.limit);
-        }
-      }
+      if (filter) {}
 
       return entries;
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/inspector/query-inspector.ts:642:44
       let entries = fetchHistory.toArray();
 
       if (filter) {
-        if (filter.portName !== undefined) {
-          entries = entries.filter((e) => e.portName === filter.portName);
-        }
+        if (filter.portName !== undefined) {}
         if (filter.result !== undefined) {
           entries = entries.filter((e) => e.result === filter.result);
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:642:13
       let entries = fetchHistory.toArray();
 
       if (filter) {
-        if (filter.portName !== undefined) {
+        if (false) {
           entries = entries.filter((e) => e.portName === filter.portName);
         }
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/inspector/query-inspector.ts:643:21
 
       if (filter) {
         if (filter.portName !== undefined) {
-          entries = entries.filter((e) => e.portName === filter.portName);
+          entries = entries;
         }
         if (filter.result !== undefined) {
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:643:43
 
       if (filter) {
         if (filter.portName !== undefined) {
-          entries = entries.filter((e) => e.portName === filter.portName);
+          entries = entries.filter((e) => e.portName !== filter.portName);
         }
         if (filter.result !== undefined) {
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected 'InspPosts' to be 'InspUsers' // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:645:13
         if (filter.portName !== undefined) {
           entries = entries.filter((e) => e.portName === filter.portName);
         }
-        if (filter.result !== undefined) {
+        if (true) {
           entries = entries.filter((e) => e.result === filter.result);
         }
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:645:13
         if (filter.portName !== undefined) {
           entries = entries.filter((e) => e.portName === filter.portName);
         }
-        if (filter.result !== undefined) {
+        if (filter.result === undefined) {
           entries = entries.filter((e) => e.result === filter.result);
         }
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/inspector/query-inspector.ts:646:21
           entries = entries.filter((e) => e.portName === filter.portName);
         }
         if (filter.result !== undefined) {
-          entries = entries.filter((e) => e.result === filter.result);
+          entries = entries;
         }
         if (filter.minDurationMs !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by result:'error' returns empty when all fetches succeed
statusReason: expected [ …(2) ] to deeply equal []

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:646:43
           entries = entries.filter((e) => e.portName === filter.portName);
         }
         if (filter.result !== undefined) {
-          entries = entries.filter((e) => e.result === filter.result);
+          entries = entries.filter((e) => true);
         }
         if (filter.minDurationMs !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by result:'error' returns empty when all fetches succeed
statusReason: expected [ …(2) ] to deeply equal []

[Killed] EqualityOperator
src/inspector/query-inspector.ts:648:13
         if (filter.result !== undefined) {
           entries = entries.filter((e) => e.result === filter.result);
         }
-        if (filter.minDurationMs !== undefined) {
+        if (filter.minDurationMs === undefined) {
           const min = filter.minDurationMs;
           entries = entries.filter((e) => e.durationMs >= min);
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:648:13
         if (filter.result !== undefined) {
           entries = entries.filter((e) => e.result === filter.result);
         }
-        if (filter.minDurationMs !== undefined) {
+        if (false) {
           const min = filter.minDurationMs;
           entries = entries.filter((e) => e.durationMs >= min);
killedBy: QueryInspector getFetchHistory filters filter by minDurationMs excludes fast fetches
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/inspector/query-inspector.ts:650:36
         }
         if (filter.minDurationMs !== undefined) {
           const min = filter.minDurationMs;
-          entries = entries.filter((e) => e.durationMs >= min);
+          entries = entries.filter(() => undefined);
         }
         if (filter.since !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by minDurationMs=0 includes all fetches
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:650:43
         }
         if (filter.minDurationMs !== undefined) {
           const min = filter.minDurationMs;
-          entries = entries.filter((e) => e.durationMs >= min);
+          entries = entries.filter((e) => false);
         }
         if (filter.since !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by minDurationMs=0 includes all fetches
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:652:13
           const min = filter.minDurationMs;
           entries = entries.filter((e) => e.durationMs >= min);
         }
-        if (filter.since !== undefined) {
+        if (true) {
           const since = filter.since;
           entries = entries.filter((e) => e.timestamp >= since);
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:652:13
           const min = filter.minDurationMs;
           entries = entries.filter((e) => e.durationMs >= min);
         }
-        if (filter.since !== undefined) {
+        if (filter.since === undefined) {
           const since = filter.since;
           entries = entries.filter((e) => e.timestamp >= since);
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:654:43
         }
         if (filter.since !== undefined) {
           const since = filter.since;
-          entries = entries.filter((e) => e.timestamp >= since);
+          entries = entries.filter((e) => true);
         }
         if (filter.trigger !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by since timestamp excludes older entries
statusReason: expected 2 to be less than or equal to 1

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:654:43
         }
         if (filter.since !== undefined) {
           const since = filter.since;
-          entries = entries.filter((e) => e.timestamp >= since);
+          entries = entries.filter((e) => false);
         }
         if (filter.trigger !== undefined) {
killedBy: QueryInspector getFetchHistory filter combinations (targeted) filter.since boundary: exact timestamp match is included (>=)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/inspector/query-inspector.ts:656:13
           const since = filter.since;
           entries = entries.filter((e) => e.timestamp >= since);
         }
-        if (filter.trigger !== undefined) {
+        if (filter.trigger === undefined) {
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:656:13
           const since = filter.since;
           entries = entries.filter((e) => e.timestamp >= since);
         }
-        if (filter.trigger !== undefined) {
+        if (true) {
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
killedBy: QueryInspector getFetchHistory filters by portName
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:657:43
           entries = entries.filter((e) => e.timestamp >= since);
         }
         if (filter.trigger !== undefined) {
-          entries = entries.filter((e) => e.trigger === filter.trigger);
+          entries = entries.filter((e) => false);
         }
         if (filter.limit !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by trigger returns matching entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:657:43
           entries = entries.filter((e) => e.timestamp >= since);
         }
         if (filter.trigger !== undefined) {
-          entries = entries.filter((e) => e.trigger === filter.trigger);
+          entries = entries.filter((e) => true);
         }
         if (filter.limit !== undefined) {
killedBy: QueryInspector getFetchHistory filters filter by trigger returns matching entries
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:659:13
         if (filter.trigger !== undefined) {
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
-        if (filter.limit !== undefined) {
+        if (false) {
           entries = entries.slice(-filter.limit);
         }
killedBy: QueryInspector getFetchHistory filters by limit
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/inspector/query-inspector.ts:659:41
         if (filter.trigger !== undefined) {
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
-        if (filter.limit !== undefined) {
-          entries = entries.slice(-filter.limit);
-        }
+        if (filter.limit !== undefined) {}
       }
 
killedBy: QueryInspector getFetchHistory filters by limit
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/inspector/query-inspector.ts:660:21
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
         if (filter.limit !== undefined) {
-          entries = entries.slice(-filter.limit);
+          entries = entries;
         }
       }
killedBy: QueryInspector getFetchHistory filters by limit
statusReason: expected 2 to be 1 // Object.is equality

[Killed] UnaryOperator
src/inspector/query-inspector.ts:660:35
           entries = entries.filter((e) => e.trigger === filter.trigger);
         }
         if (filter.limit !== undefined) {
-          entries = entries.slice(-filter.limit);
+          entries = entries.slice(+filter.limit);
         }
       }
killedBy: QueryInspector getFetchHistory filters filter by limit returns last N entries from filtered set
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/inspector/query-inspector.ts:669:43
 
     getInvalidationGraph(): InvalidationGraph {
       // Derive query port names from cache entries
-      const allEntries = cache.find(() => true);
+      const allEntries = cache.find(() => false);
       const nodeSet = new Set<string>();
       for (const [key] of allEntries) {
killedBy: QueryInspector invalidation graph query port nodes (mutant-killing) fetched query ports without mutation effects appear as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(2) ] to include 'InspComments'

[Killed] ArrowFunction
src/inspector/query-inspector.ts:669:37
 
     getInvalidationGraph(): InvalidationGraph {
       // Derive query port names from cache entries
-      const allEntries = cache.find(() => true);
+      const allEntries = cache.find(() => undefined);
       const nodeSet = new Set<string>();
       for (const [key] of allEntries) {
killedBy: QueryInspector invalidation graph query port nodes (mutant-killing) fetched query ports without mutation effects appear as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(2) ] to include 'InspComments'

[Killed] BlockStatement
src/inspector/query-inspector.ts:671:39
       // Derive query port names from cache entries
       const allEntries = cache.find(() => true);
       const nodeSet = new Set<string>();
-      for (const [key] of allEntries) {
-        nodeSet.add(key[0]);
-      }
+      for (const [key] of allEntries) {}
 
       const edges: Array<{ from: string; to: string; type: "invalidates" | "removes" }> = [];
killedBy: QueryInspector invalidation graph query port nodes (mutant-killing) fetched query ports without mutation effects appear as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(2) ] to include 'InspComments'

[Killed] ArrayDeclaration
src/inspector/query-inspector.ts:675:91
         nodeSet.add(key[0]);
       }
 
-      const edges: Array<{ from: string; to: string; type: "invalidates" | "removes" }> = [];
+      const edges: Array<{ from: string; to: string; type: "invalidates" | "removes" }> = ["Stryker was here"];
       const adjacency = new Map<string, string[]>();
 
killedBy: QueryInspector edge cases invalidation graph with only query ports (no mutations) has no edges
statusReason: expected 1 to be +0 // Object.is equality

[Killed] OptionalChaining
src/inspector/query-inspector.ts:682:25
       // and will be wired through the container inspector in Phase 5.
       // For now, we derive what we can from the registered mutation ports
       // passed via inspector options.
-      for (const mp of (options?.mutationPorts ?? [])) {
+      for (const mp of (options.mutationPorts ?? [])) {
         nodeSet.add(mp.name);
         if (mp.effects?.invalidates) {
killedBy: QueryInspector computeMaxCascadeDepth via invalidation graph returns 0 when there are no edges
statusReason: Cannot read properties of undefined (reading 'mutationPorts')

[Killed] LogicalOperator
src/inspector/query-inspector.ts:682:25
       // and will be wired through the container inspector in Phase 5.
       // For now, we derive what we can from the registered mutation ports
       // passed via inspector options.
-      for (const mp of (options?.mutationPorts ?? [])) {
+      for (const mp of (options?.mutationPorts && [])) {
         nodeSet.add(mp.name);
         if (mp.effects?.invalidates) {
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [] to include 'InspUsers'

[Killed] BlockStatement
src/inspector/query-inspector.ts:684:38
       // passed via inspector options.
       for (const mp of (options?.mutationPorts ?? [])) {
         nodeSet.add(mp.name);
-        if (mp.effects?.invalidates) {
-          for (const target of mp.effects.invalidates) {
-            nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "invalidates" });
-            const adj = adjacency.get(mp.name) ?? [];
-            adj.push(target.__portName);
-            adjacency.set(mp.name, adj);
-          }
-        }
+        if (mp.effects?.invalidates) {}
         if (mp.effects?.removes) {
           for (const target of mp.effects.removes) {
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', …(2) ] to include 'InspUsers'

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:684:13
       // passed via inspector options.
       for (const mp of (options?.mutationPorts ?? [])) {
         nodeSet.add(mp.name);
-        if (mp.effects?.invalidates) {
+        if (false) {
           for (const target of mp.effects.invalidates) {
             nodeSet.add(target.__portName);
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', …(2) ] to include 'InspUsers'

[Killed] BlockStatement
src/inspector/query-inspector.ts:685:56
       for (const mp of (options?.mutationPorts ?? [])) {
         nodeSet.add(mp.name);
         if (mp.effects?.invalidates) {
-          for (const target of mp.effects.invalidates) {
-            nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "invalidates" });
-            const adj = adjacency.get(mp.name) ?? [];
-            adj.push(target.__portName);
-            adjacency.set(mp.name, adj);
-          }
+          for (const target of mp.effects.invalidates) {}
         }
         if (mp.effects?.removes) {
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', …(2) ] to include 'InspUsers'

[Killed] StringLiteral
src/inspector/query-inspector.ts:687:70
         if (mp.effects?.invalidates) {
           for (const target of mp.effects.invalidates) {
             nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "invalidates" });
+            edges.push({ from: mp.name, to: target.__portName, type: "" });
             const adj = adjacency.get(mp.name) ?? [];
             adj.push(target.__portName);
killedBy: QueryInspector getInvalidationGraph includes invalidation edges from mutation effects
statusReason: expected '' to be 'invalidates' // Object.is equality

[Killed] LogicalOperator
src/inspector/query-inspector.ts:688:25
           for (const target of mp.effects.invalidates) {
             nodeSet.add(target.__portName);
             edges.push({ from: mp.name, to: target.__portName, type: "invalidates" });
-            const adj = adjacency.get(mp.name) ?? [];
+            const adj = adjacency.get(mp.name) && [];
             adj.push(target.__portName);
             adjacency.set(mp.name, adj);
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/inspector/query-inspector.ts:693:34
             adjacency.set(mp.name, adj);
           }
         }
-        if (mp.effects?.removes) {
-          for (const target of mp.effects.removes) {
-            nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "removes" });
-            const adj = adjacency.get(mp.name) ?? [];
-            adj.push(target.__portName);
-            adjacency.set(mp.name, adj);
-          }
-        }
+        if (mp.effects?.removes) {}
       }
 
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(1) ] to include 'InspPosts'

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:693:13
             adjacency.set(mp.name, adj);
           }
         }
-        if (mp.effects?.removes) {
+        if (false) {
           for (const target of mp.effects.removes) {
             nodeSet.add(target.__portName);
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(1) ] to include 'InspPosts'

[Killed] BlockStatement
src/inspector/query-inspector.ts:694:52
           }
         }
         if (mp.effects?.removes) {
-          for (const target of mp.effects.removes) {
-            nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "removes" });
-            const adj = adjacency.get(mp.name) ?? [];
-            adj.push(target.__portName);
-            adjacency.set(mp.name, adj);
-          }
+          for (const target of mp.effects.removes) {}
         }
       }
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: expected [ 'InspDeleteUser', 'InspUsers', …(1) ] to include 'InspPosts'

[Killed] ObjectLiteral
src/inspector/query-inspector.ts:696:24
         if (mp.effects?.removes) {
           for (const target of mp.effects.removes) {
             nodeSet.add(target.__portName);
-            edges.push({ from: mp.name, to: target.__portName, type: "removes" });
+            edges.push({});
             const adj = adjacency.get(mp.name) ?? [];
             adj.push(target.__portName);
killedBy: QueryInspector getInvalidationGraph includes removal edges from mutation effects
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/inspector/query-inspector.ts:697:25
           for (const target of mp.effects.removes) {
             nodeSet.add(target.__portName);
             edges.push({ from: mp.name, to: target.__portName, type: "removes" });
-            const adj = adjacency.get(mp.name) ?? [];
+            const adj = adjacency.get(mp.name) && [];
             adj.push(target.__portName);
             adjacency.set(mp.name, adj);
killedBy: QueryInspector getInvalidationGraph includes registered query and mutation ports as nodes
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
src/inspector/query-inspector.ts:707:19
       // Build runtime edges from tracked invalidation events
       const runtimeEdges: RuntimeInvalidationEdge[] = [];
       const staticEdgeKeys = new Set(
-        edges.map((e) => `${e.from}→${e.to}→${e.type}`)
+        edges.map(() => undefined)
       );
 
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected [ …(2) ] to have a length of +0 but got 2

[Killed] StringLiteral
src/inspector/query-inspector.ts:707:26
       // Build runtime edges from tracked invalidation events
       const runtimeEdges: RuntimeInvalidationEdge[] = [];
       const staticEdgeKeys = new Set(
-        edges.map((e) => `${e.from}→${e.to}→${e.type}`)
+        edges.map((e) => ``)
       );
 
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected [ …(2) ] to have a length of +0 but got 2

[Killed] BlockStatement
src/inspector/query-inspector.ts:710:59
         edges.map((e) => `${e.from}→${e.to}→${e.type}`)
       );
 
-      for (const [key, tracking] of runtimeInvalidations) {
-        const [from, to, effect] = key.split("→");
-        nodeSet.add(from);
-        nodeSet.add(to);
-        runtimeEdges.push({
-          from,
-          to,
-          effect: effect === "removes" ? "removes" : "invalidates",
-          count: tracking.count,
-          lastTriggered: tracking.lastTriggered,
-          totalEntriesAffected: tracking.totalEntriesAffected,
-        });
-
-        // Merge runtime edges into adjacency for cycle detection
-        if (!adjacency.has(from)) {
-          adjacency.set(from, []);
-        }
-        const adj = adjacency.get(from);
-        if (adj && !adj.includes(to)) {
-          adj.push(to);
-        }
-      }
+      for (const [key, tracking] of runtimeInvalidations) {}
 
       const nodes = [...nodeSet];
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/inspector/query-inspector.ts:711:46
       );
 
       for (const [key, tracking] of runtimeInvalidations) {
-        const [from, to, effect] = key.split("→");
+        const [from, to, effect] = key.split("");
         nodeSet.add(from);
         nodeSet.add(to);
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/inspector/query-inspector.ts:714:27
         const [from, to, effect] = key.split("→");
         nodeSet.add(from);
         nodeSet.add(to);
-        runtimeEdges.push({
-          from,
-          to,
-          effect: effect === "removes" ? "removes" : "invalidates",
-          count: tracking.count,
-          lastTriggered: tracking.lastTriggered,
-          totalEntriesAffected: tracking.totalEntriesAffected,
-        });
+        runtimeEdges.push({});
 
         // Merge runtime edges into adjacency for cycle detection
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:717:19
         runtimeEdges.push({
           from,
           to,
-          effect: effect === "removes" ? "removes" : "invalidates",
+          effect: true ? "removes" : "invalidates",
           count: tracking.count,
           lastTriggered: tracking.lastTriggered,
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected 'removes' to be 'invalidates' // Object.is equality

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:717:19
         runtimeEdges.push({
           from,
           to,
-          effect: effect === "removes" ? "removes" : "invalidates",
+          effect: false ? "removes" : "invalidates",
           count: tracking.count,
           lastTriggered: tracking.lastTriggered,
killedBy: Introspection Integration runtime invalidation graph tracks mutation effects end-to-end
statusReason: expected 'invalidates' to be 'removes' // Object.is equality

[Survived] BooleanLiteral
src/inspector/query-inspector.ts:724:13
         });
 
         // Merge runtime edges into adjacency for cycle detection
-        if (!adjacency.has(from)) {
+        if (adjacency.has(from)) {
           adjacency.set(from, []);
         }

[Survived] ConditionalExpression
src/inspector/query-inspector.ts:724:13
         });
 
         // Merge runtime edges into adjacency for cycle detection
-        if (!adjacency.has(from)) {
+        if (false) {
           adjacency.set(from, []);
         }

[Survived] ArrayDeclaration
src/inspector/query-inspector.ts:725:31
 
         // Merge runtime edges into adjacency for cycle detection
         if (!adjacency.has(from)) {
-          adjacency.set(from, []);
+          adjacency.set(from, ["Stryker was here"]);
         }
         const adj = adjacency.get(from);

[Survived] ConditionalExpression
src/inspector/query-inspector.ts:728:13
           adjacency.set(from, []);
         }
         const adj = adjacency.get(from);
-        if (adj && !adj.includes(to)) {
+        if (true) {
           adj.push(to);
         }

[Survived] LogicalOperator
src/inspector/query-inspector.ts:728:13
           adjacency.set(from, []);
         }
         const adj = adjacency.get(from);
-        if (adj && !adj.includes(to)) {
+        if (adj || !adj.includes(to)) {
           adj.push(to);
         }

[Killed] ConditionalExpression
src/inspector/query-inspector.ts:738:11
       const maxCascadeDepth = computeMaxCascadeDepth(adjacency);
 
       const warnings: string[] = [];
-      if (cycles.length > 0) {
+      if (false) {
         warnings.push(`Detected ${cycles.length} invalidation cycle(s)`);
       }
killedBy: QueryInspector invalidation graph warnings warns when cycles are detected
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/inspector/query-inspector.ts:738:11
       const maxCascadeDepth = computeMaxCascadeDepth(adjacency);
 
       const warnings: string[] = [];
-      if (cycles.length > 0) {
+      if (cycles.length >= 0) {
         warnings.push(`Detected ${cycles.length} invalidation cycle(s)`);
       }
killedBy: QueryInspector invalidation graph warnings (exact assertions) acyclic graph with depth <= 3 has exactly 0 warnings
statusReason: expected 1 to be +0 // Object.is equality
