[Killed] ConditionalExpression
src/persistence/persistence-manager.ts:54:9
 
   async function restore(): Promise<void> {
     const entriesResult = await persister.restoreAll();
-    if (entriesResult.isErr()) return;
+    if (true) return;
     const entries = entriesResult.value;
 
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Survived] ConditionalExpression
src/persistence/persistence-manager.ts:54:9
 
   async function restore(): Promise<void> {
     const entriesResult = await persister.restoreAll();
-    if (entriesResult.isErr()) return;
+    if (false) return;
     const entries = entriesResult.value;
 

[Killed] ConditionalExpression
src/persistence/persistence-manager.ts:58:49
     const entries = entriesResult.value;
 
     // Check buster marker
-    const busterEntry = entries.find(([key]) => key[0] === BUSTER_PORT_NAME);
+    const busterEntry = entries.find(([key]) => false);
     if (busterEntry) {
       // The buster value is stored in the data field of the cache entry
killedBy: CachePersister integration buster change discards persisted data
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/persistence/persistence-manager.ts:58:38
     const entries = entriesResult.value;
 
     // Check buster marker
-    const busterEntry = entries.find(([key]) => key[0] === BUSTER_PORT_NAME);
+    const busterEntry = entries.find(() => undefined);
     if (busterEntry) {
       // The buster value is stored in the data field of the cache entry
killedBy: CachePersister integration buster change discards persisted data
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/persistence/persistence-manager.ts:59:9
 
     // Check buster marker
     const busterEntry = entries.find(([key]) => key[0] === BUSTER_PORT_NAME);
-    if (busterEntry) {
+    if (false) {
       // The buster value is stored in the data field of the cache entry
       const storedBuster = busterEntry[1].data;
killedBy: CachePersister integration buster change discards persisted data
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/persistence/persistence-manager.ts:59:22
 
     // Check buster marker
     const busterEntry = entries.find(([key]) => key[0] === BUSTER_PORT_NAME);
-    if (busterEntry) {
-      // The buster value is stored in the data field of the cache entry
-      const storedBuster = busterEntry[1].data;
-      if (storedBuster !== buster) {
-        await persister.clear();
-        await persistBusterMarker();
-        return;
-      }
-    }
+    if (busterEntry) {}
 
     const now = clock.now();
killedBy: CachePersister integration buster change discards persisted data
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/persistence/persistence-manager.ts:62:11
     if (busterEntry) {
       // The buster value is stored in the data field of the cache entry
       const storedBuster = busterEntry[1].data;
-      if (storedBuster !== buster) {
+      if (storedBuster === buster) {
         await persister.clear();
         await persistBusterMarker();
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Killed] BlockStatement
src/persistence/persistence-manager.ts:62:36
     if (busterEntry) {
       // The buster value is stored in the data field of the cache entry
       const storedBuster = busterEntry[1].data;
-      if (storedBuster !== buster) {
-        await persister.clear();
-        await persistBusterMarker();
-        return;
-      }
+      if (storedBuster !== buster) {}
     }
 
killedBy: CachePersister integration buster change discards persisted data
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/persistence/persistence-manager.ts:71:41
 
     const now = clock.now();
 
-    for (const [key, entry] of entries) {
-      // Skip the buster marker itself
-      if (key[0] === BUSTER_PORT_NAME) continue;
-
-      // Discard stale entries
-      if (entry.dataUpdatedAt !== undefined && now - entry.dataUpdatedAt > maxAge) {
-        continue;
-      }
-
-      // Restore valid entries into cache
-      cache.set({ __portName: key[0] }, deserializeParams(key), entry.data);
-    }
+    for (const [key, entry] of entries) {}
 
     // Ensure buster marker is persisted
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Killed] ConditionalExpression
src/persistence/persistence-manager.ts:73:11
 
     for (const [key, entry] of entries) {
       // Skip the buster marker itself
-      if (key[0] === BUSTER_PORT_NAME) continue;
+      if (true) continue;
 
       // Discard stale entries
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Killed] EqualityOperator
src/persistence/persistence-manager.ts:73:11
 
     for (const [key, entry] of entries) {
       // Skip the buster marker itself
-      if (key[0] === BUSTER_PORT_NAME) continue;
+      if (key[0] !== BUSTER_PORT_NAME) continue;
 
       // Discard stale entries
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Killed] ArithmeticOperator
src/persistence/persistence-manager.ts:76:48
       if (key[0] === BUSTER_PORT_NAME) continue;
 
       // Discard stale entries
-      if (entry.dataUpdatedAt !== undefined && now - entry.dataUpdatedAt > maxAge) {
+      if (entry.dataUpdatedAt !== undefined && now + entry.dataUpdatedAt > maxAge) {
         continue;
       }
killedBy: CachePersister integration restores entries on client creation
statusReason: expected undefined to deeply equal [ 'Bob', 'Carol' ]

[Killed] BlockStatement
src/persistence/persistence-manager.ts:76:84
       if (key[0] === BUSTER_PORT_NAME) continue;
 
       // Discard stale entries
-      if (entry.dataUpdatedAt !== undefined && now - entry.dataUpdatedAt > maxAge) {
-        continue;
-      }
+      if (entry.dataUpdatedAt !== undefined && now - entry.dataUpdatedAt > maxAge) {}
 
       // Restore valid entries into cache
killedBy: CachePersister integration stale persisted entries are discarded based on maxAge
statusReason: expected [ 'stale-users' ] to be undefined

[Survived] BlockStatement
src/persistence/persistence-manager.ts:85:23
     }
 
     // Ensure buster marker is persisted
-    if (!busterEntry) {
-      await persistBusterMarker();
-    }
+    if (!busterEntry) {}
   }
 

[Survived] BooleanLiteral
src/persistence/persistence-manager.ts:85:9
     }
 
     // Ensure buster marker is persisted
-    if (!busterEntry) {
+    if (busterEntry) {
       await persistBusterMarker();
     }

[Survived] BlockStatement
src/persistence/persistence-manager.ts:90:55
     }
   }
 
-  async function persistBusterMarker(): Promise<void> {
-    const busterKey = createCacheKeyFromName(BUSTER_PORT_NAME, undefined);
-    await persister.persistQuery(busterKey, {
-      result: undefined,
-      data: buster,
-      error: null,
-      status: "success",
-      fetchStatus: "idle",
-      dataUpdatedAt: clock.now(),
-      errorUpdatedAt: undefined,
-      fetchCount: 0,
-      isInvalidated: false,
-    });
-  }
+  async function persistBusterMarker(): Promise<void> {}
 
   function createListener(): CacheListener {

[Survived] BooleanLiteral
src/persistence/persistence-manager.ts:101:22
       dataUpdatedAt: clock.now(),
       errorUpdatedAt: undefined,
       fetchCount: 0,
-      isInvalidated: false,
+      isInvalidated: true,
     });
   }

[Killed] BlockStatement
src/persistence/persistence-manager.ts:105:44
     });
   }
 
-  function createListener(): CacheListener {
-    return (event) => {
-      switch (event.type) {
-        case "added":
-        case "updated":
-          void persister.persistQuery(event.key, event.entry);
-          break;
-        case "removed":
-          void persister.removeQuery(event.key);
-          break;
-        case "cleared":
-          void persister.clear();
-          break;
-      }
-    };
-  }
+  function createListener(): CacheListener {}
 
   function dispose(): void {
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: listener is not a function

[Killed] BlockStatement
src/persistence/persistence-manager.ts:106:23
   }
 
   function createListener(): CacheListener {
-    return (event) => {
-      switch (event.type) {
-        case "added":
-        case "updated":
-          void persister.persistQuery(event.key, event.entry);
-          break;
-        case "removed":
-          void persister.removeQuery(event.key);
-          break;
-        case "cleared":
-          void persister.clear();
-          break;
-      }
-    };
+    return (event) => {};
   }
 
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: expected '__hex_query_buster__' to be 'users' // Object.is equality

[Killed] ConditionalExpression
src/persistence/persistence-manager.ts:109:9
     return (event) => {
       switch (event.type) {
         case "added":
-        case "updated":
-          void persister.persistQuery(event.key, event.entry);
-          break;
+        case "updated":
         case "removed":
           void persister.removeQuery(event.key);
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: expected '__hex_query_buster__' to be 'users' // Object.is equality

[NoCoverage] ConditionalExpression
src/persistence/persistence-manager.ts:112:9
         case "updated":
           void persister.persistQuery(event.key, event.entry);
           break;
-        case "removed":
-          void persister.removeQuery(event.key);
-          break;
+        case "removed":
         case "cleared":
           void persister.clear();

[NoCoverage] ConditionalExpression
src/persistence/persistence-manager.ts:115:9
         case "removed":
           void persister.removeQuery(event.key);
           break;
-        case "cleared":
-          void persister.clear();
-          break;
+        case "cleared":
       }
     };

[Killed] ObjectLiteral
src/persistence/persistence-manager.ts:127:10
     // (the caller is responsible for calling the unsubscribe function)
   }
 
-  return { restore, createListener, dispose };
+  return {};
 }
 
killedBy: CachePersister integration persists on cache update via setQueryData
statusReason: persistenceManager.createListener is not a function

[Survived] BlockStatement
src/persistence/persistence-manager.ts:139:52
  * Cache keys store params as a JSON string in position [1].
  * We parse it back to the original value.
  */
-function deserializeParams(key: CacheKey): unknown {
-  try {
-    return JSON.parse(key[1]) as unknown;
-  } catch {
-    return undefined;
-  }
-}
+function deserializeParams(key: CacheKey): unknown {}
 

[Survived] BlockStatement
src/persistence/persistence-manager.ts:140:7
  * We parse it back to the original value.
  */
 function deserializeParams(key: CacheKey): unknown {
-  try {
-    return JSON.parse(key[1]) as unknown;
-  } catch {
+  try {} catch {
     return undefined;
   }

[Survived] BlockStatement
src/persistence/persistence-manager.ts:142:11
 function deserializeParams(key: CacheKey): unknown {
   try {
     return JSON.parse(key[1]) as unknown;
-  } catch {
-    return undefined;
-  }
+  } catch {}
 }
 
