[Survived] ArrayDeclaration
src/reactivity/system-factory.ts:110:49
   let notifyIndex = 0;
   let queuedLength = 0;
   let activeSub: ReactiveNode | undefined;
-  const queued: Array<EffectNode | undefined> = [];
+  const queued: Array<EffectNode | undefined> = ["Stryker was here"];
 
   // Create the low-level reactive system from alien-signals/system

[Killed] BlockStatement
src/reactivity/system-factory.ts:114:41
 
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
-    update(node: ReactiveNode): boolean {
-      if (node.depsTail !== undefined) {
-        return updateComputed(node as ComputedNode);
-      }
-      return updateSignal(node as SignalNode);
-    },
+    update(node: ReactiveNode): boolean {},
     notify(effectNode: ReactiveNode): void {
       const e = effectNode as EffectNode;
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected 'pending' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:115:11
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
     update(node: ReactiveNode): boolean {
-      if (node.depsTail !== undefined) {
+      if (false) {
         return updateComputed(node as ComputedNode);
       }
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] BlockStatement
src/reactivity/system-factory.ts:115:40
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
     update(node: ReactiveNode): boolean {
-      if (node.depsTail !== undefined) {
-        return updateComputed(node as ComputedNode);
-      }
+      if (node.depsTail !== undefined) {}
       return updateSignal(node as SignalNode);
     },
killedBy: createIsolatedReactiveSystem HexDI signal wrappers work with isolated system
statusReason: expected [ 'HELLO' ] to deeply equal [ 'HELLO', 'WORLD' ]

[Killed] BlockStatement
src/reactivity/system-factory.ts:120:44
       }
       return updateSignal(node as SignalNode);
     },
-    notify(effectNode: ReactiveNode): void {
-      const e = effectNode as EffectNode;
-      let insertIndex = queuedLength;
-      const firstInsertedIndex = insertIndex;
-      let current: EffectNode | undefined = e;
-      while (current !== undefined) {
-        queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
-        const nextSub = current.subs?.sub as EffectNode | undefined;
-        current = (nextSub !== undefined && (nextSub.flags & WATCHING)) ? nextSub : undefined;
-      }
-      queuedLength = insertIndex;
-      let lo = firstInsertedIndex;
-      let hi = insertIndex - 1;
-      while (lo < hi) {
-        const left = queued[lo];
-        queued[lo++] = queued[hi];
-        queued[hi--] = left;
-      }
-    },
+    notify(effectNode: ReactiveNode): void {},
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] EqualityOperator
src/reactivity/system-factory.ts:125:14
       let insertIndex = queuedLength;
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
-      while (current !== undefined) {
+      while (current === undefined) {
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:125:14
       let insertIndex = queuedLength;
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
-      while (current !== undefined) {
+      while (false) {
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Killed] UpdateOperator
src/reactivity/system-factory.ts:126:16
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
       while (current !== undefined) {
-        queued[insertIndex++] = current;
+        queued[insertIndex--] = current;
         current.flags &= ~WATCHING;
         const nextSub = current.subs?.sub as EffectNode | undefined;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Killed] LogicalOperator
src/reactivity/system-factory.ts:129:20
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
         const nextSub = current.subs?.sub as EffectNode | undefined;
-        current = (nextSub !== undefined && (nextSub.flags & WATCHING)) ? nextSub : undefined;
+        current = (nextSub !== undefined || nextSub.flags & WATCHING) ? nextSub : undefined;
       }
       queuedLength = insertIndex;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: Cannot read properties of undefined (reading 'flags')

[Killed] EqualityOperator
src/reactivity/system-factory.ts:129:20
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
         const nextSub = current.subs?.sub as EffectNode | undefined;
-        current = (nextSub !== undefined && (nextSub.flags & WATCHING)) ? nextSub : undefined;
+        current = (nextSub === undefined && (nextSub.flags & WATCHING)) ? nextSub : undefined;
       }
       queuedLength = insertIndex;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: Cannot read properties of undefined (reading 'flags')

[NoCoverage] BlockStatement
src/reactivity/system-factory.ts:134:23
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;
       let hi = insertIndex - 1;
-      while (lo < hi) {
-        const left = queued[lo];
-        queued[lo++] = queued[hi];
-        queued[hi--] = left;
-      }
+      while (lo < hi) {}
     },
     unwatched(node: ReactiveNode): void {

[Survived] BlockStatement
src/reactivity/system-factory.ts:143:47
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
         effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
-        node.depsTail = undefined;
-        node.flags = MUTABLE | DIRTY;
-        purgeDeps(node);
-      }
+      } else if (node.depsTail !== undefined) {}
     },
   });

[Survived] EqualityOperator
src/reactivity/system-factory.ts:143:18
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
         effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
+      } else if (node.depsTail === undefined) {
         node.depsTail = undefined;
         node.flags = MUTABLE | DIRTY;

[Killed] EqualityOperator
src/reactivity/system-factory.ts:163:14
     activeSub = c;
     try {
       const oldValue = c.value;
-      return oldValue !== (c.value = c.getter(oldValue));
+      return oldValue === (c.value = c.getter(oldValue));
     } finally {
       activeSub = prevSub;
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:173:12
 
   function updateSignal(s: SignalNode): boolean {
     s.flags = MUTABLE;
-    return s.currentValue !== (s.currentValue = s.pendingValue);
+    return true;
   }
 
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected 'pending' to be 'success' // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:176:37
     return s.currentValue !== (s.currentValue = s.pendingValue);
   }
 
-  function run(e: EffectNode): void {
-    const flags = e.flags;
-    if (
-      flags & DIRTY ||
-      (flags & PENDING && checkDirty(e.deps!, e))
-    ) {
-      ++cycle;
-      e.depsTail = undefined;
-      e.flags = WATCHING | RECURSED_CHECK;
-      const prevSub = activeSub;
-      activeSub = e;
-      try {
-        e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-        purgeDeps(e);
-      }
-    } else {
-      e.flags = WATCHING;
-    }
-  }
+  function run(e: EffectNode): void {}
 
   function flush(): void {
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] LogicalOperator
src/reactivity/system-factory.ts:179:7
   function run(e: EffectNode): void {
     const flags = e.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING && checkDirty(e.deps!, e))
+      flags & DIRTY && flags & PENDING && checkDirty(e.deps!, e)
     ) {
       ++cycle;
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:179:7
   function run(e: EffectNode): void {
     const flags = e.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING && checkDirty(e.deps!, e))
+      false
     ) {
       ++cycle;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:180:8
     const flags = e.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING && checkDirty(e.deps!, e))
+      (false)
     ) {
       ++cycle;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Survived] LogicalOperator
src/reactivity/system-factory.ts:180:8
     const flags = e.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING && checkDirty(e.deps!, e))
+      (flags & PENDING || checkDirty(e.deps!, e))
     ) {
       ++cycle;

[Killed] BlockStatement
src/reactivity/system-factory.ts:181:7
     if (
       flags & DIRTY ||
       (flags & PENDING && checkDirty(e.deps!, e))
-    ) {
-      ++cycle;
-      e.depsTail = undefined;
-      e.flags = WATCHING | RECURSED_CHECK;
-      const prevSub = activeSub;
-      activeSub = e;
-      try {
-        e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-        purgeDeps(e);
-      }
-    } else {
+    ) {} else {
       e.flags = WATCHING;
     }
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[Killed] BlockStatement
src/reactivity/system-factory.ts:204:32
       while (notifyIndex < queuedLength) {
         const eff = queued[notifyIndex];
         queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
-          run(eff);
-        }
+        if (eff !== undefined) {}
       }
     } finally {
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [ 100 ] to deeply equal [ 100, 50 ]

[NoCoverage] BlockStatement
src/reactivity/system-factory.ts:209:42
         }
       }
     } finally {
-      while (notifyIndex < queuedLength) {
-        const eff = queued[notifyIndex];
-        queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
-          eff.flags |= WATCHING | 8; // WATCHING | RECURSED
-        }
-      }
+      while (notifyIndex < queuedLength) {}
       notifyIndex = 0;
       queuedLength = 0;

[NoCoverage] ConditionalExpression
src/reactivity/system-factory.ts:212:13
       while (notifyIndex < queuedLength) {
         const eff = queued[notifyIndex];
         queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
+        if (true) {
           eff.flags |= WATCHING | 8; // WATCHING | RECURSED
         }

[Survived] BlockStatement
src/reactivity/system-factory.ts:221:47
     }
   }
 
-  function purgeDeps(sub: ReactiveNode): void {
-    const depsTail = sub.depsTail;
-    let dep = depsTail !== undefined ? depsTail.nextDep : sub.deps;
-    while (dep !== undefined) {
-      dep = unlink(dep, sub) as Link | undefined;
-    }
-  }
+  function purgeDeps(sub: ReactiveNode): void {}
 
   function effectScopeOper(node: ReactiveNode): void {

[Killed] EqualityOperator
src/reactivity/system-factory.ts:223:15
 
   function purgeDeps(sub: ReactiveNode): void {
     const depsTail = sub.depsTail;
-    let dep = depsTail !== undefined ? depsTail.nextDep : sub.deps;
+    let dep = depsTail === undefined ? depsTail.nextDep : sub.deps;
     while (dep !== undefined) {
       dep = unlink(dep, sub) as Link | undefined;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: Cannot read properties of undefined (reading 'nextDep')

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:223:15
 
   function purgeDeps(sub: ReactiveNode): void {
     const depsTail = sub.depsTail;
-    let dep = depsTail !== undefined ? depsTail.nextDep : sub.deps;
+    let dep = false ? depsTail.nextDep : sub.deps;
     while (dep !== undefined) {
       dep = unlink(dep, sub) as Link | undefined;
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected [ 'success' ] to deeply equal [ 'success', 'error' ]

[Killed] EqualityOperator
src/reactivity/system-factory.ts:224:12
   function purgeDeps(sub: ReactiveNode): void {
     const depsTail = sub.depsTail;
     let dep = depsTail !== undefined ? depsTail.nextDep : sub.deps;
-    while (dep !== undefined) {
+    while (dep === undefined) {
       dep = unlink(dep, sub) as Link | undefined;
     }
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: Cannot read properties of undefined (reading 'dep')

[Survived] ConditionalExpression
src/reactivity/system-factory.ts:224:12
   function purgeDeps(sub: ReactiveNode): void {
     const depsTail = sub.depsTail;
     let dep = depsTail !== undefined ? depsTail.nextDep : sub.deps;
-    while (dep !== undefined) {
+    while (false) {
       dep = unlink(dep, sub) as Link | undefined;
     }

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:244:9
   // =========================================================================
 
   function signalOper(node: SignalNode, ...value: unknown[]): unknown {
-    if (value.length) {
+    if (true) {
       if (node.pendingValue !== (node.pendingValue = value[0])) {
         node.flags = MUTABLE | DIRTY;
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected 'pending' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:244:9
   // =========================================================================
 
   function signalOper(node: SignalNode, ...value: unknown[]): unknown {
-    if (value.length) {
+    if (false) {
       if (node.pendingValue !== (node.pendingValue = value[0])) {
         node.flags = MUTABLE | DIRTY;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected 42 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:245:11
 
   function signalOper(node: SignalNode, ...value: unknown[]): unknown {
     if (value.length) {
-      if (node.pendingValue !== (node.pendingValue = value[0])) {
+      if (false) {
         node.flags = MUTABLE | DIRTY;
         const subs = node.subs;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected 42 to be 100 // Object.is equality

[Killed] LogicalOperator
src/reactivity/system-factory.ts:280:7
   function computedOper(node: ComputedNode): unknown {
     const flags = node.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+      flags & DIRTY && flags & PENDING && (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false))
     ) {
       if (updateComputed(node)) {
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected 'pending' to be 'success' // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:280:7
   function computedOper(node: ComputedNode): unknown {
     const flags = node.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+      false
     ) {
       if (updateComputed(node)) {
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected 200 to be 100 // Object.is equality

[Killed] LogicalOperator
src/reactivity/system-factory.ts:281:8
     const flags = node.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+      (flags & PENDING || checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false))
     ) {
       if (updateComputed(node)) {
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: Cannot read properties of undefined (reading 'dep')

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:281:8
     const flags = node.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+      (false)
     ) {
       if (updateComputed(node)) {
killedBy: createIsolatedReactiveSystem two systems are fully independent
statusReason: expected 11 to be 12 // Object.is equality

[Killed] LogicalOperator
src/reactivity/system-factory.ts:282:10
     if (
       flags & DIRTY ||
       (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+        (checkDirty(node.deps!, node) && (node.flags = flags & ~PENDING, false)))
     ) {
       if (updateComputed(node)) {
killedBy: createReactiveCacheEntry works with isolated reactive system
statusReason: expected 'pending' to be 'success' // Object.is equality

[Survived] ConditionalExpression
src/reactivity/system-factory.ts:282:10
     if (
       flags & DIRTY ||
       (flags & PENDING &&
-        (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
+        (true))
     ) {
       if (updateComputed(node)) {

[Killed] BlockStatement
src/reactivity/system-factory.ts:283:7
       flags & DIRTY ||
       (flags & PENDING &&
         (checkDirty(node.deps!, node) || (node.flags = flags & ~PENDING, false)))
-    ) {
-      if (updateComputed(node)) {
-        const subs = node.subs;
-        if (subs !== undefined) {
-          shallowPropagate(subs);
-        }
-      }
-    } else if (!flags) {
+    ) {} else if (!flags) {
       node.flags = MUTABLE | RECURSED_CHECK;
       const prevSub = activeSub;
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected 200 to be 100 // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:309:61
   }
 
   return {
-    signal<T>(initialValue: T): { (): T; (value: T): void } {
-      const node: SignalNode = {
-        currentValue: initialValue,
-        pendingValue: initialValue,
-        subs: undefined,
-        subsTail: undefined,
-        flags: MUTABLE,
-      };
-      return ((...value: unknown[]) => signalOper(node, ...value)) as { (): T; (value: T): void };
-    },
+    signal<T>(initialValue: T): { (): T; (value: T): void } {},
 
     computed<T>(getter: (previousValue?: T) => T): () => T {
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: s is not a function

[Killed] BlockStatement
src/reactivity/system-factory.ts:320:60
       return ((...value: unknown[]) => signalOper(node, ...value)) as { (): T; (value: T): void };
     },
 
-    computed<T>(getter: (previousValue?: T) => T): () => T {
-      const node: ComputedNode = {
-        value: undefined,
-        subs: undefined,
-        subsTail: undefined,
-        deps: undefined,
-        depsTail: undefined,
-        flags: 0,
-        getter: getter as (previousValue?: unknown) => unknown,
-      };
-      return (() => computedOper(node)) as () => T;
-    },
+    computed<T>(getter: (previousValue?: T) => T): () => T {},
 
     effect(fn: () => void): () => void {
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: c is not a function

[Killed] BlockStatement
src/reactivity/system-factory.ts:333:40
       return (() => computedOper(node)) as () => T;
     },
 
-    effect(fn: () => void): () => void {
-      const e: EffectNode = {
-        fn,
-        subs: undefined,
-        subsTail: undefined,
-        deps: undefined,
-        depsTail: undefined,
-        flags: WATCHING | RECURSED_CHECK,
-      };
-      const prevSub = activeSub;
-      activeSub = e;
-      if (prevSub !== undefined) {
-        link(e, prevSub, 0);
-      }
-      try {
-        e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-      }
-      return effectScopeOper.bind(undefined, e);
-    },
+    effect(fn: () => void): () => void {},
 
     startBatch(): void {
killedBy: createIsolatedReactiveSystem creates an isolated system with signal/computed/effect
statusReason: expected [] to deeply equal [ 100 ]

[Killed] BooleanLiteral
src/reactivity/system-factory.ts:361:11
     },
 
     endBatch(): void {
-      if (!--batchDepth) {
+      if (--batchDepth) {
         flush();
       }
killedBy: createIsolatedReactiveSystem batching is scoped to the system
statusReason: expected [ +0 ] to deeply equal [ +0, 3 ]
