[Killed] BlockStatement
src/cache/query-cache.ts:271:18
       const results: Array<readonly [CacheKey, CacheEntrySnapshot]> = [];
       for (const [serialized, entry] of entries) {
         const key = keyMap.get(serialized);
-        if (key) {
-          const snapshot = getSnapshot(entry);
-          if (predicate(snapshot, key)) {
-            results.push([key, snapshot] as const);
-          }
-        }
+        if (key) {}
       }
       return results;
killedBy: QueryCache find(predicate) returns matching entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:271:13
       const results: Array<readonly [CacheKey, CacheEntrySnapshot]> = [];
       for (const [serialized, entry] of entries) {
         const key = keyMap.get(serialized);
-        if (key) {
+        if (false) {
           const snapshot = getSnapshot(entry);
           if (predicate(snapshot, key)) {
killedBy: QueryCache find(predicate) returns matching entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:273:15
         const key = keyMap.get(serialized);
         if (key) {
           const snapshot = getSnapshot(entry);
-          if (predicate(snapshot, key)) {
+          if (false) {
             results.push([key, snapshot] as const);
           }
killedBy: QueryCache find(predicate) returns matching entries
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:273:15
         const key = keyMap.get(serialized);
         if (key) {
           const snapshot = getSnapshot(entry);
-          if (predicate(snapshot, key)) {
+          if (true) {
             results.push([key, snapshot] as const);
           }
killedBy: QueryCache find(predicate) returns matching entries
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:281:97
       return results;
     },
 
-    getEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> | undefined {
-      const serialized = getSerializedKey(port, params);
-      return entries.get(serialized);
-    },
+    getEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> | undefined {},
 
     getOrCreateEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> {
killedBy: QueryClient invalidateQueries refetch behavior (targeted) invalidateQueries refetches observed queries
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:286:93
       return entries.get(serialized);
     },
 
-    getOrCreateEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> {
-      const { serialized, cacheKey } = ensureCacheKey(port, params);
-      const existing = entries.get(serialized);
-      if (existing) return existing;
-
-      const entry = createReactiveCacheEntry(serialized, system);
-      entries.set(serialized, entry);
-      emit({ type: "added", key: cacheKey, entry: getSnapshot(entry) });
-      return entry;
-    },
+    getOrCreateEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> {},
 
     set(
killedBy: QueryCache set stores entry retrievable by get
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ConditionalExpression
src/cache/query-cache.ts:289:11
     getOrCreateEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> {
       const { serialized, cacheKey } = ensureCacheKey(port, params);
       const existing = entries.get(serialized);
-      if (existing) return existing;
+      if (true) return existing;
 
       const entry = createReactiveCacheEntry(serialized, system);
killedBy: QueryClient fetch returns ResultAsync<TData, TError | QueryResolutionError>
statusReason: Cannot read properties of undefined (reading 'result$')

[Killed] ConditionalExpression
src/cache/query-cache.ts:289:11
     getOrCreateEntry(port: PortLike, params: unknown): ReactiveCacheEntry<unknown, unknown> {
       const { serialized, cacheKey } = ensureCacheKey(port, params);
       const existing = entries.get(serialized);
-      if (existing) return existing;
+      if (false) return existing;
 
       const entry = createReactiveCacheEntry(serialized, system);
killedBy: CacheEntry fetchCount increments on each fetch
statusReason: expected 1 to be 2 // Object.is equality

[Killed] StringLiteral
src/cache/query-cache.ts:293:20
 
       const entry = createReactiveCacheEntry(serialized, system);
       entries.set(serialized, entry);
-      emit({ type: "added", key: cacheKey, entry: getSnapshot(entry) });
+      emit({ type: "", key: cacheKey, entry: getSnapshot(entry) });
       return entry;
     },
killedBy: QueryCache getOrCreate Idempotency emits 'added' only on first creation, not on subsequent getOrCreate
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/cache/query-cache.ts:304:21
       options?: { readonly structuralSharing?: boolean }
     ): void {
       const { serialized, cacheKey } = ensureCacheKey(port, params);
-      const isNew = !entries.has(serialized);
+      const isNew = entries.has(serialized);
       const entry = cache.getOrCreateEntry(port, params);
       const useStructuralSharing = options?.structuralSharing ?? true;
killedBy: QueryCache Subscriptions fires on updated event
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/cache/query-cache.ts:306:66
       const { serialized, cacheKey } = ensureCacheKey(port, params);
       const isNew = !entries.has(serialized);
       const entry = cache.getOrCreateEntry(port, params);
-      const useStructuralSharing = options?.structuralSharing ?? true;
+      const useStructuralSharing = options?.structuralSharing ?? false;
 
       let finalData = data;
killedBy: QueryCache Structural Sharing Toggle default (structuralSharing: true) preserves reference for equal data
statusReason: expected { users: [ 'Alice', 'Bob' ] } to be { users: [ 'Alice', 'Bob' ] } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { users: [ 'Alice', 'Bob' ] }
Received: serializes to the same string

[Killed] LogicalOperator
src/cache/query-cache.ts:306:36
       const { serialized, cacheKey } = ensureCacheKey(port, params);
       const isNew = !entries.has(serialized);
       const entry = cache.getOrCreateEntry(port, params);
-      const useStructuralSharing = options?.structuralSharing ?? true;
+      const useStructuralSharing = options?.structuralSharing && true;
 
       let finalData = data;
killedBy: QueryCache Structural Sharing Toggle default (structuralSharing: true) preserves reference for equal data
statusReason: expected { users: [ 'Alice', 'Bob' ] } to be { users: [ 'Alice', 'Bob' ] } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { users: [ 'Alice', 'Bob' ] }
Received: serializes to the same string

[Killed] ConditionalExpression
src/cache/query-cache.ts:309:11
       const useStructuralSharing = options?.structuralSharing ?? true;
 
       let finalData = data;
-      if (useStructuralSharing) {
+      if (true) {
         const prevData = entry.data.peek();
         if (prevData !== undefined) {
killedBy: QueryCache Structural Sharing Toggle structuralSharing: false returns new reference even for equal data
statusReason: expected [ 'Alice', 'Bob' ] not to be [ 'Alice', 'Bob' ] // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:309:11
       const useStructuralSharing = options?.structuralSharing ?? true;
 
       let finalData = data;
-      if (useStructuralSharing) {
+      if (false) {
         const prevData = entry.data.peek();
         if (prevData !== undefined) {
killedBy: QueryCache Structural Sharing Toggle default (structuralSharing: true) preserves reference for equal data
statusReason: expected { users: [ 'Alice', 'Bob' ] } to be { users: [ 'Alice', 'Bob' ] } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { users: [ 'Alice', 'Bob' ] }
Received: serializes to the same string

[Killed] BlockStatement
src/cache/query-cache.ts:311:37
       let finalData = data;
       if (useStructuralSharing) {
         const prevData = entry.data.peek();
-        if (prevData !== undefined) {
-          finalData = replaceEqualDeep(prevData, data);
-        }
+        if (prevData !== undefined) {}
       }
 
killedBy: QueryCache Structural Sharing Toggle default (structuralSharing: true) preserves reference for equal data
statusReason: expected { users: [ 'Alice', 'Bob' ] } to be { users: [ 'Alice', 'Bob' ] } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { users: [ 'Alice', 'Bob' ] }
Received: serializes to the same string

[Killed] EqualityOperator
src/cache/query-cache.ts:311:13
       let finalData = data;
       if (useStructuralSharing) {
         const prevData = entry.data.peek();
-        if (prevData !== undefined) {
+        if (prevData === undefined) {
           finalData = replaceEqualDeep(prevData, data);
         }
killedBy: QueryCache Structural Sharing Toggle default (structuralSharing: true) preserves reference for equal data
statusReason: expected { users: [ 'Alice', 'Bob' ] } to be { users: [ 'Alice', 'Bob' ] } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { users: [ 'Alice', 'Bob' ] }
Received: serializes to the same string

[Killed] ArithmeticOperator
src/cache/query-cache.ts:319:29
       // Write to source signals
       entry.result$.set(ok(finalData));
       entry.dataUpdatedAt$.set(clock.now());
-      entry.fetchCount$.set(entry.fetchCount$.peek() + 1);
+      entry.fetchCount$.set(entry.fetchCount$.peek() - 1);
       entry.isInvalidated$.set(false);
 
killedBy: CacheEntry fetchCount increments on each fetch
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/cache/query-cache.ts:320:32
       entry.result$.set(ok(finalData));
       entry.dataUpdatedAt$.set(clock.now());
       entry.fetchCount$.set(entry.fetchCount$.peek() + 1);
-      entry.isInvalidated$.set(false);
+      entry.isInvalidated$.set(true);
 
       const snapshot = getSnapshot(entry);
killedBy: QueryCache Invalidate/Remove Non-Existent invalidate(port) without params skips non-matching ports
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:323:11
       entry.isInvalidated$.set(false);
 
       const snapshot = getSnapshot(entry);
-      if (isNew) {
+      if (false) {
         emit({ type: "added", key: cacheKey, entry: snapshot });
       } else {
killedBy: QueryCache set event emission exact (targeted) first set emits added events with entry
statusReason: expected undefined to deeply equal [ 'data' ]

[Killed] BlockStatement
src/cache/query-cache.ts:323:18
       entry.isInvalidated$.set(false);
 
       const snapshot = getSnapshot(entry);
-      if (isNew) {
-        emit({ type: "added", key: cacheKey, entry: snapshot });
-      } else {
+      if (isNew) {} else {
         emit({ type: "updated", key: cacheKey, entry: snapshot });
       }
killedBy: QueryCache set event emission exact (targeted) first set emits added events with entry
statusReason: expected undefined to deeply equal [ 'data' ]

[Killed] ObjectLiteral
src/cache/query-cache.ts:324:14
 
       const snapshot = getSnapshot(entry);
       if (isNew) {
-        emit({ type: "added", key: cacheKey, entry: snapshot });
+        emit({});
       } else {
         emit({ type: "updated", key: cacheKey, entry: snapshot });
killedBy: QueryCache set event emission exact (targeted) first set emits added events with entry
statusReason: expected undefined to deeply equal [ 'data' ]

[Killed] BlockStatement
src/cache/query-cache.ts:325:14
       const snapshot = getSnapshot(entry);
       if (isNew) {
         emit({ type: "added", key: cacheKey, entry: snapshot });
-      } else {
-        emit({ type: "updated", key: cacheKey, entry: snapshot });
-      }
+      } else {}
     },
 
killedBy: QueryCache Subscriptions fires on updated event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:330:69
       }
     },
 
-    setError(port: PortLike, params: unknown, error: unknown): void {
-      const { serialized, cacheKey } = ensureCacheKey(port, params);
-      const isNew = !entries.has(serialized);
-      const entry = cache.getOrCreateEntry(port, params);
-
-      // Write to source signals
-      entry.result$.set(err(error));
-      entry.errorUpdatedAt$.set(clock.now());
-      entry.fetchCount$.set(entry.fetchCount$.peek() + 1);
-      entry.isInvalidated$.set(false);
-
-      const snapshot = getSnapshot(entry);
-      if (isNew) {
-        emit({ type: "added", key: cacheKey, entry: snapshot });
-      } else {
-        emit({ type: "updated", key: cacheKey, entry: snapshot });
-      }
-    },
+    setError(port: PortLike, params: unknown, error: unknown): void {},
 
     invalidate(port: PortLike, params?: unknown): void {
killedBy: QueryCache find(predicate) returns matching entries
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/cache/query-cache.ts:338:29
       // Write to source signals
       entry.result$.set(err(error));
       entry.errorUpdatedAt$.set(clock.now());
-      entry.fetchCount$.set(entry.fetchCount$.peek() + 1);
+      entry.fetchCount$.set(entry.fetchCount$.peek() - 1);
       entry.isInvalidated$.set(false);
 

[Killed] ConditionalExpression
src/cache/query-cache.ts:342:11
       entry.isInvalidated$.set(false);
 
       const snapshot = getSnapshot(entry);
-      if (isNew) {
+      if (true) {
         emit({ type: "added", key: cacheKey, entry: snapshot });
       } else {
killedBy: QueryCache setError with Previous Entry emits 'updated' event when setting error on existing key
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:349:56
       }
     },
 
-    invalidate(port: PortLike, params?: unknown): void {
-      if (params !== undefined) {
-        const { serialized, cacheKey } = ensureCacheKey(port, params);
-        const entry = entries.get(serialized);
-        if (entry) {
-          entry.isInvalidated$.set(true);
-          emit({ type: "invalidated", key: cacheKey });
-        }
-      } else {
-        for (const [serialized, entry] of entries) {
-          const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            entry.isInvalidated$.set(true);
-            emit({ type: "invalidated", key });
-          }
-        }
-      }
-    },
+    invalidate(port: PortLike, params?: unknown): void {},
 
     remove(port: PortLike, params?: unknown): void {
killedBy: QueryCache invalidate(port, params) marks specific entry as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/cache/query-cache.ts:350:11
     },
 
     invalidate(port: PortLike, params?: unknown): void {
-      if (params !== undefined) {
+      if (params === undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
         const entry = entries.get(serialized);
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:350:33
     },
 
     invalidate(port: PortLike, params?: unknown): void {
-      if (params !== undefined) {
-        const { serialized, cacheKey } = ensureCacheKey(port, params);
-        const entry = entries.get(serialized);
-        if (entry) {
-          entry.isInvalidated$.set(true);
-          emit({ type: "invalidated", key: cacheKey });
-        }
-      } else {
+      if (params !== undefined) {} else {
         for (const [serialized, entry] of entries) {
           const key = keyMap.get(serialized);
killedBy: QueryCache invalidate(port, params) marks specific entry as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:353:13
       if (params !== undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
         const entry = entries.get(serialized);
-        if (entry) {
+        if (false) {
           entry.isInvalidated$.set(true);
           emit({ type: "invalidated", key: cacheKey });
killedBy: QueryCache invalidate(port, params) marks specific entry as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:353:13
       if (params !== undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
         const entry = entries.get(serialized);
-        if (entry) {
+        if (true) {
           entry.isInvalidated$.set(true);
           emit({ type: "invalidated", key: cacheKey });
killedBy: QueryCache Invalidate/Remove Non-Existent invalidate(port, params) is a no-op when entry does not exist
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/cache/query-cache.ts:354:36
         const { serialized, cacheKey } = ensureCacheKey(port, params);
         const entry = entries.get(serialized);
         if (entry) {
-          entry.isInvalidated$.set(true);
+          entry.isInvalidated$.set(false);
           emit({ type: "invalidated", key: cacheKey });
         }
killedBy: QueryCache invalidate(port, params) marks specific entry as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/cache/query-cache.ts:355:16
         const entry = entries.get(serialized);
         if (entry) {
           entry.isInvalidated$.set(true);
-          emit({ type: "invalidated", key: cacheKey });
+          emit({});
         }
       } else {
killedBy: QueryCache Subscriptions fires on invalidated event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:357:14
           entry.isInvalidated$.set(true);
           emit({ type: "invalidated", key: cacheKey });
         }
-      } else {
-        for (const [serialized, entry] of entries) {
-          const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            entry.isInvalidated$.set(true);
-            emit({ type: "invalidated", key });
-          }
-        }
-      }
+      } else {}
     },
 
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:358:52
           emit({ type: "invalidated", key: cacheKey });
         }
       } else {
-        for (const [serialized, entry] of entries) {
-          const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            entry.isInvalidated$.set(true);
-            emit({ type: "invalidated", key });
-          }
-        }
+        for (const [serialized, entry] of entries) {}
       }
     },
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:360:65
       } else {
         for (const [serialized, entry] of entries) {
           const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            entry.isInvalidated$.set(true);
-            emit({ type: "invalidated", key });
-          }
+          if (key && cacheKeyMatchesPort(key, port.__portName)) {}
         }
       }
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:360:15
       } else {
         for (const [serialized, entry] of entries) {
           const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
+          if (false) {
             entry.isInvalidated$.set(true);
             emit({ type: "invalidated", key });
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/cache/query-cache.ts:361:38
         for (const [serialized, entry] of entries) {
           const key = keyMap.get(serialized);
           if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            entry.isInvalidated$.set(true);
+            entry.isInvalidated$.set(false);
             emit({ type: "invalidated", key });
           }
killedBy: QueryCache invalidate(port) without params marks all entries for port as invalidated
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/cache/query-cache.ts:362:26
           const key = keyMap.get(serialized);
           if (key && cacheKeyMatchesPort(key, port.__portName)) {
             entry.isInvalidated$.set(true);
-            emit({ type: "invalidated", key });
+            emit({ type: "", key });
           }
         }
killedBy: QueryCache invalidate(port, undefined) else branch invalidate(port, undefined) iterates all entries for the port
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:369:33
     },
 
     remove(port: PortLike, params?: unknown): void {
-      if (params !== undefined) {
-        const { serialized, cacheKey } = ensureCacheKey(port, params);
-        if (entries.has(serialized)) {
-          entries.delete(serialized);
-          keyMap.delete(serialized);
-          emit({ type: "removed", key: cacheKey });
-        }
-      } else {
+      if (params !== undefined) {} else {
         const keysToRemove: string[] = [];
         for (const [serialized] of entries) {
killedBy: QueryCache remove(port, params) removes specific entry
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/cache/query-cache.ts:369:11
     },
 
     remove(port: PortLike, params?: unknown): void {
-      if (params !== undefined) {
+      if (params === undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
         if (entries.has(serialized)) {
killedBy: QueryCache remove(port, params) removes specific entry
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache/query-cache.ts:371:13
     remove(port: PortLike, params?: unknown): void {
       if (params !== undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
-        if (entries.has(serialized)) {
+        if (false) {
           entries.delete(serialized);
           keyMap.delete(serialized);
killedBy: QueryCache remove(port, params) removes specific entry
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:371:38
     remove(port: PortLike, params?: unknown): void {
       if (params !== undefined) {
         const { serialized, cacheKey } = ensureCacheKey(port, params);
-        if (entries.has(serialized)) {
-          entries.delete(serialized);
-          keyMap.delete(serialized);
-          emit({ type: "removed", key: cacheKey });
-        }
+        if (entries.has(serialized)) {}
       } else {
         const keysToRemove: string[] = [];
killedBy: QueryCache remove(port, params) removes specific entry
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/cache/query-cache.ts:374:16
         if (entries.has(serialized)) {
           entries.delete(serialized);
           keyMap.delete(serialized);
-          emit({ type: "removed", key: cacheKey });
+          emit({});
         }
       } else {
killedBy: QueryCache Subscriptions fires on removed event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:376:14
           keyMap.delete(serialized);
           emit({ type: "removed", key: cacheKey });
         }
-      } else {
-        const keysToRemove: string[] = [];
-        for (const [serialized] of entries) {
-          const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            keysToRemove.push(serialized);
-          }
-        }
-        for (const serialized of keysToRemove) {
-          const key = keyMap.get(serialized);
-          entries.delete(serialized);
-          keyMap.delete(serialized);
-          if (key) {
-            emit({ type: "removed", key });
-          }
-        }
-      }
+      } else {}
     },
 
killedBy: QueryCache remove(port) without params removes all entries for that port
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:378:45
         }
       } else {
         const keysToRemove: string[] = [];
-        for (const [serialized] of entries) {
-          const key = keyMap.get(serialized);
-          if (key && cacheKeyMatchesPort(key, port.__portName)) {
-            keysToRemove.push(serialized);
-          }
-        }
+        for (const [serialized] of entries) {}
         for (const serialized of keysToRemove) {
           const key = keyMap.get(serialized);
killedBy: QueryCache remove(port) without params removes all entries for that port
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:384:48
             keysToRemove.push(serialized);
           }
         }
-        for (const serialized of keysToRemove) {
-          const key = keyMap.get(serialized);
-          entries.delete(serialized);
-          keyMap.delete(serialized);
-          if (key) {
-            emit({ type: "removed", key });
-          }
-        }
+        for (const serialized of keysToRemove) {}
       }
     },
killedBy: QueryCache remove(port) without params removes all entries for that port
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/cache/query-cache.ts:389:18
           entries.delete(serialized);
           keyMap.delete(serialized);
           if (key) {
-            emit({ type: "removed", key });
+            emit({});
           }
         }
killedBy: QueryCache remove(port) emits removed events for each entry each removed entry gets a 'removed' event with a key
statusReason: expected +0 to be 3 // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:395:19
       }
     },
 
-    clear(): void {
-      entries.clear();
-      keyMap.clear();
-      emit({ type: "cleared" });
-    },
+    clear(): void {},
 
     getOrCreate(port: PortLike, params: unknown): CacheEntrySnapshot {
killedBy: QueryCache clear removes all entries
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/cache/query-cache.ts:398:12
     clear(): void {
       entries.clear();
       keyMap.clear();
-      emit({ type: "cleared" });
+      emit({});
     },
 
killedBy: QueryCache Subscriptions fires on cleared event
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache/query-cache.ts:401:70
       emit({ type: "cleared" });
     },
 
-    getOrCreate(port: PortLike, params: unknown): CacheEntrySnapshot {
-      const entry = cache.getOrCreateEntry(port, params);
-      return getSnapshot(entry);
-    },
+    getOrCreate(port: PortLike, params: unknown): CacheEntrySnapshot {},
 
     incrementObservers(port: PortLike, params: unknown): void {
killedBy: CacheEntry status is 'pending' when result is undefined
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/cache/query-cache.ts:406:63
       return getSnapshot(entry);
     },
 
-    incrementObservers(port: PortLike, params: unknown): void {
-      const entry = entries.get(getSerializedKey(port, params));
-      if (entry) {
-        incrementSubscribers(entry);
-      }
-    },
+    incrementObservers(port: PortLike, params: unknown): void {},
 
     decrementObservers(port: PortLike, params: unknown): void {
killedBy: QueryCache GC Sweep does not remove entries with active observers even when expired
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/cache/query-cache.ts:408:18
 
     incrementObservers(port: PortLike, params: unknown): void {
       const entry = entries.get(getSerializedKey(port, params));
-      if (entry) {
-        incrementSubscribers(entry);
-      }
+      if (entry) {}
     },
 
killedBy: QueryInspector getSnapshot entry hasSubscribers reflects subscriber presence
statusReason: expected false to be true // Object.is equality
