[Killed] BlockStatement
src/ports/query-port.ts:107:48
     };
   },
 ): QueryPort<TName, TData, TParams, TError, TDependsOn>;
-function brandAsQueryPort(obj: object): object {
-  return obj;
-}
+function brandAsQueryPort(obj: object): object {}
 
 /**
killedBy: QueryClient cancelQueries doesn't cancel other ports (abort-aware, verifies isolation)
statusReason: Cannot read properties of undefined (reading '__portName')

[Killed] BlockStatement
src/ports/query-port.ts:122:59
   const TDependsOn extends ReadonlyArray<AnyQueryPort> = [],
 >(
   config: QueryPortConfig<TData, TParams, TError, TName, TDependsOn>
-) => QueryPort<TName, TData, TParams, TError, TDependsOn> {
-  return <
-    const TName extends string,
-    const TDependsOn extends ReadonlyArray<AnyQueryPort> = [],
-  >(
-    config: QueryPortConfig<TData, TParams, TError, TName, TDependsOn>
-  ): QueryPort<TName, TData, TParams, TError, TDependsOn> => {
-    // BRAND_CAST: Branded type boundary -- frozen object structurally matches
-    // QueryPort but needs phantom type branding (error type, port symbol).
-    return brandAsQueryPort<TName, TData, TParams, TError, TDependsOn>(
-      Object.freeze({
-        __portName: config.name,
-        [QUERY_PORT_SYMBOL]: true,
-        config: Object.freeze({
-          ...config,
-          dependsOn: config.dependsOn ?? [],
-        }),
-      })
-    );
-  };
-}
+) => QueryPort<TName, TData, TParams, TError, TDependsOn> {}
 
 // =============================================================================
killedBy: QueryClient cancelQueries doesn't cancel other ports (abort-aware, verifies isolation)
statusReason: (0 , __vite_ssr_import_2__.createQueryPort)(...) is not a function

[Killed] BlockStatement
src/ports/query-port.ts:128:62
     const TDependsOn extends ReadonlyArray<AnyQueryPort> = [],
   >(
     config: QueryPortConfig<TData, TParams, TError, TName, TDependsOn>
-  ): QueryPort<TName, TData, TParams, TError, TDependsOn> => {
-    // BRAND_CAST: Branded type boundary -- frozen object structurally matches
-    // QueryPort but needs phantom type branding (error type, port symbol).
-    return brandAsQueryPort<TName, TData, TParams, TError, TDependsOn>(
-      Object.freeze({
-        __portName: config.name,
-        [QUERY_PORT_SYMBOL]: true,
-        config: Object.freeze({
-          ...config,
-          dependsOn: config.dependsOn ?? [],
-        }),
-      })
-    );
-  };
+  ): QueryPort<TName, TData, TParams, TError, TDependsOn> => {};
 }
 
killedBy: createQueryAdapter (inline creation -- mutation testing) adapter provides.__portName matches the port name
statusReason: Cannot read properties of undefined (reading '__portName')

[Killed] BooleanLiteral
src/ports/query-port.ts:134:30
     return brandAsQueryPort<TName, TData, TParams, TError, TDependsOn>(
       Object.freeze({
         __portName: config.name,
-        [QUERY_PORT_SYMBOL]: true,
+        [QUERY_PORT_SYMBOL]: false,
         config: Object.freeze({
           ...config,
killedBy: createQueryPort (inline creation — mutation testing) symbol is true and passes isQueryPort guard
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/ports/query-port.ts:137:22
         [QUERY_PORT_SYMBOL]: true,
         config: Object.freeze({
           ...config,
-          dependsOn: config.dependsOn ?? [],
+          dependsOn: config.dependsOn && [],
         }),
       })
killedBy: createQueryPort (inline creation — mutation testing) config.dependsOn defaults to empty array when omitted
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/ports/query-port.ts:148:65
 // Type Guard
 // =============================================================================
 
-export function isQueryPort(value: unknown): value is QueryPort {
-  return (
-    typeof value === "object" &&
-    value !== null &&
-    QUERY_PORT_SYMBOL in value &&
-    value[QUERY_PORT_SYMBOL] === true
-  );
-}
+export function isQueryPort(value: unknown): value is QueryPort {}
 
killedBy: isMutationPort returns false for a query port
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/ports/query-port.ts:150:5
 
 export function isQueryPort(value: unknown): value is QueryPort {
   return (
-    typeof value === "object" &&
-    value !== null &&
-    QUERY_PORT_SYMBOL in value &&
-    value[QUERY_PORT_SYMBOL] === true
+    typeof value === "object" && value !== null && QUERY_PORT_SYMBOL in value || value[QUERY_PORT_SYMBOL] === true
   );
 }
killedBy: isQueryPort returns false for null
statusReason: Cannot read properties of null (reading 'Symbol(@hex-di/query/QueryPort)')

[Killed] ConditionalExpression
src/ports/query-port.ts:153:5
     typeof value === "object" &&
     value !== null &&
     QUERY_PORT_SYMBOL in value &&
-    value[QUERY_PORT_SYMBOL] === true
+    true
   );
 }
killedBy: isQueryPort returns false for object with [QUERY_PORT_SYMBOL]: false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/ports/query-port.ts:153:34
     typeof value === "object" &&
     value !== null &&
     QUERY_PORT_SYMBOL in value &&
-    value[QUERY_PORT_SYMBOL] === true
+    value[QUERY_PORT_SYMBOL] === false
   );
 }
killedBy: isQueryPort returns true for a query port
statusReason: expected false to be true // Object.is equality
