[Killed] BlockStatement
src/tracing/tracing-bridge.ts:81:101
  * });
  * ```
  */
-export function createQueryTracingBridge(config: QueryTracingBridgeConfig): QueryTracingHookOptions {
-  return {
-    tracer: config.tracer,
-    filter: config.filter,
-    traceMutations: config.traceMutations,
-    scopeId: config.scopeId,
-    traceContext: config.traceContext,
-  };
-}
+export function createQueryTracingBridge(config: QueryTracingBridgeConfig): QueryTracingHookOptions {}
 
killedBy: createQueryTracingBridge forwards all config properties to hook options
statusReason: Cannot read properties of undefined (reading 'tracer')
