[Killed] BooleanLiteral
src/hooks/use-infinite-query.ts:182:25
           setState({
             status: "error",
             error,
-            isFetching: false,
+            isFetching: true,
             isFetchingNextPage: false,
             isFetchingPreviousPage: false,
killedBy: useInfiniteQuery error state (mutation killers) isFetching/isFetchingNextPage/isFetchingPreviousPage reset on error
statusReason: Unable to find an element with the text: /F:false/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      F:
      true

[Killed] BooleanLiteral
src/hooks/use-infinite-query.ts:193:36
   );
 
   // Initial fetch
-  const initialFetchedRef = useRef(false);
+  const initialFetchedRef = useRef(true);
   useEffect(() => {
     const enabled = options.enabled ?? true;
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] BlockStatement
src/hooks/use-infinite-query.ts:194:19
 
   // Initial fetch
   const initialFetchedRef = useRef(false);
-  useEffect(() => {
-    const enabled = options.enabled ?? true;
-    if (!enabled || initialFetchedRef.current) return;
-    initialFetchedRef.current = true;
-
-    setState((prev) => ({ ...prev, isFetching: true }));
-    void fetchPage(options.initialPageParam, "next");
-  }, [options.enabled, options.initialPageParam, fetchPage]);
+  useEffect(() => {}, [options.enabled, options.initialPageParam, fetchPage]);
 
   const infiniteData = infiniteDataRef.current;
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] LogicalOperator
src/hooks/use-infinite-query.ts:195:21
   // Initial fetch
   const initialFetchedRef = useRef(false);
   useEffect(() => {
-    const enabled = options.enabled ?? true;
+    const enabled = options.enabled && true;
     if (!enabled || initialFetchedRef.current) return;
     initialFetchedRef.current = true;
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] BooleanLiteral
src/hooks/use-infinite-query.ts:195:40
   // Initial fetch
   const initialFetchedRef = useRef(false);
   useEffect(() => {
-    const enabled = options.enabled ?? true;
+    const enabled = options.enabled ?? false;
     if (!enabled || initialFetchedRef.current) return;
     initialFetchedRef.current = true;
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] BooleanLiteral
src/hooks/use-infinite-query.ts:196:9
   const initialFetchedRef = useRef(false);
   useEffect(() => {
     const enabled = options.enabled ?? true;
-    if (!enabled || initialFetchedRef.current) return;
+    if (enabled || initialFetchedRef.current) return;
     initialFetchedRef.current = true;
 
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:196:9
   const initialFetchedRef = useRef(false);
   useEffect(() => {
     const enabled = options.enabled ?? true;
-    if (!enabled || initialFetchedRef.current) return;
+    if (true) return;
     initialFetchedRef.current = true;
 
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Timeout] BooleanLiteral
src/hooks/use-infinite-query.ts:197:33
   useEffect(() => {
     const enabled = options.enabled ?? true;
     if (!enabled || initialFetchedRef.current) return;
-    initialFetchedRef.current = true;
+    initialFetchedRef.current = false;
 
     setState((prev) => ({ ...prev, isFetching: true }));

[Killed] ArrowFunction
src/hooks/use-infinite-query.ts:199:14
     if (!enabled || initialFetchedRef.current) return;
     initialFetchedRef.current = true;
 
-    setState((prev) => ({ ...prev, isFetching: true }));
+    setState(() => undefined);
     void fetchPage(options.initialPageParam, "next");
   }, [options.enabled, options.initialPageParam, fetchPage]);
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Cannot read properties of undefined (reading 'isFetchingPreviousPage')

[Survived] BooleanLiteral
src/hooks/use-infinite-query.ts:199:48
     if (!enabled || initialFetchedRef.current) return;
     initialFetchedRef.current = true;
 
-    setState((prev) => ({ ...prev, isFetching: true }));
+    setState((prev) => ({ ...prev, isFetching: false }));
     void fetchPage(options.initialPageParam, "next");
   }, [options.enabled, options.initialPageParam, fetchPage]);

[Survived] StringLiteral
src/hooks/use-infinite-query.ts:200:46
     initialFetchedRef.current = true;
 
     setState((prev) => ({ ...prev, isFetching: true }));
-    void fetchPage(options.initialPageParam, "next");
+    void fetchPage(options.initialPageParam, "");
   }, [options.enabled, options.initialPageParam, fetchPage]);
 

[Survived] ArrayDeclaration
src/hooks/use-infinite-query.ts:201:6
 
     setState((prev) => ({ ...prev, isFetching: true }));
     void fetchPage(options.initialPageParam, "next");
-  }, [options.enabled, options.initialPageParam, fetchPage]);
+  }, []);
 
   const infiniteData = infiniteDataRef.current;

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:205:23
 
   const infiniteData = infiniteDataRef.current;
 
-  const hasNextPage = infiniteData.pages.length > 0
+  const hasNextPage = true
     ? options.getNextPageParam(
         infiniteData.pages[infiniteData.pages.length - 1],
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Cannot read properties of undefined (reading 'nextCursor')

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:205:23
 
   const infiniteData = infiniteDataRef.current;
 
-  const hasNextPage = infiniteData.pages.length > 0
+  const hasNextPage = infiniteData.pages.length >= 0
     ? options.getNextPageParam(
         infiniteData.pages[infiniteData.pages.length - 1],
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Cannot read properties of undefined (reading 'nextCursor')

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:206:7
   const infiniteData = infiniteDataRef.current;
 
   const hasNextPage = infiniteData.pages.length > 0
-    ? options.getNextPageParam(
-        infiniteData.pages[infiniteData.pages.length - 1],
-        infiniteData.pages,
-      ) !== undefined
+    ? false
     : false;
 
killedBy: useInfiniteQuery hasNextPage/hasPreviousPage (mutation killers) hasNextPage is true when getNextPageParam returns a value
statusReason: Unable to find an element with the text: HasNext: true. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      HasNext: 
      false

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:206:7
   const infiniteData = infiniteDataRef.current;
 
   const hasNextPage = infiniteData.pages.length > 0
-    ? options.getNextPageParam(
-        infiniteData.pages[infiniteData.pages.length - 1],
-        infiniteData.pages,
-      ) !== undefined
+    ? true
     : false;
 
killedBy: useInfiniteQuery hasNextPage/hasPreviousPage (mutation killers) hasNextPage is false when getNextPageParam returns undefined
statusReason: Unable to find an element with the text: HasNext: false. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      HasNext: 
      true

[Killed] ArithmeticOperator
src/hooks/use-infinite-query.ts:207:28
 
   const hasNextPage = infiniteData.pages.length > 0
     ? options.getNextPageParam(
-        infiniteData.pages[infiniteData.pages.length - 1],
+        infiniteData.pages[infiniteData.pages.length + 1],
         infiniteData.pages,
       ) !== undefined
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/hooks/use-infinite-query.ts:210:7
         infiniteData.pages[infiniteData.pages.length - 1],
         infiniteData.pages,
       ) !== undefined
-    : false;
+    : true;
 
   const hasPreviousPage = infiniteData.pages.length > 0 && options.getPreviousPageParam !== undefined
killedBy: useInfiniteQuery initial state fields (mutation killers) initial state has all fields correctly set
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:212:27
       ) !== undefined
     : false;
 
-  const hasPreviousPage = infiniteData.pages.length > 0 && options.getPreviousPageParam !== undefined
+  const hasPreviousPage = false
     ? options.getPreviousPageParam(
         infiniteData.pages[0],
killedBy: useInfiniteQuery hasNextPage/hasPreviousPage (mutation killers) hasPreviousPage is true when getPreviousPageParam returns a value
statusReason: Unable to find an element with the text: HasPrev: true. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      HasPrev: 
      false

[Killed] LogicalOperator
src/hooks/use-infinite-query.ts:212:27
       ) !== undefined
     : false;
 
-  const hasPreviousPage = infiniteData.pages.length > 0 && options.getPreviousPageParam !== undefined
+  const hasPreviousPage = infiniteData.pages.length > 0 || options.getPreviousPageParam !== undefined
     ? options.getPreviousPageParam(
         infiniteData.pages[0],
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:213:7
     : false;
 
   const hasPreviousPage = infiniteData.pages.length > 0 && options.getPreviousPageParam !== undefined
-    ? options.getPreviousPageParam(
-        infiniteData.pages[0],
-        infiniteData.pages,
-      ) !== undefined
+    ? options.getPreviousPageParam(infiniteData.pages[0], infiniteData.pages) === undefined
     : false;
 
killedBy: useInfiniteQuery hasNextPage/hasPreviousPage (mutation killers) hasPreviousPage is true when getPreviousPageParam returns a value
statusReason: Unable to find an element with the text: HasPrev: true. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      HasPrev: 
      false

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:213:7
     : false;
 
   const hasPreviousPage = infiniteData.pages.length > 0 && options.getPreviousPageParam !== undefined
-    ? options.getPreviousPageParam(
-        infiniteData.pages[0],
-        infiniteData.pages,
-      ) !== undefined
+    ? false
     : false;
 
killedBy: useInfiniteQuery hasNextPage/hasPreviousPage (mutation killers) hasPreviousPage is true when getPreviousPageParam returns a value
statusReason: Unable to find an element with the text: HasPrev: true. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      HasPrev: 
      false

[Killed] BlockStatement
src/hooks/use-infinite-query.ts:219:93
       ) !== undefined
     : false;
 
-  const fetchNextPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0) return ResultAsync.ok(undefined);
-    const current = infiniteDataRef.current;
-    const nextPageParam = options.getNextPageParam(
-      current.pages[current.pages.length - 1],
-      current.pages,
-    );
-    if (nextPageParam === undefined) return ResultAsync.ok(undefined);
-    return fetchPage(nextPageParam, "next");
-  }, [fetchPage, options]);
+  const fetchNextPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {}, [fetchPage, options]);
 
   const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:220:9
     : false;
 
   const fetchNextPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0) return ResultAsync.ok(undefined);
+    if (infiniteDataRef.current.pages.length !== 0) return ResultAsync.ok(undefined);
     const current = infiniteDataRef.current;
     const nextPageParam = options.getNextPageParam(
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:220:9
     : false;
 
   const fetchNextPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0) return ResultAsync.ok(undefined);
+    if (true) return ResultAsync.ok(undefined);
     const current = infiniteDataRef.current;
     const nextPageParam = options.getNextPageParam(
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ArithmeticOperator
src/hooks/use-infinite-query.ts:223:21
     if (infiniteDataRef.current.pages.length === 0) return ResultAsync.ok(undefined);
     const current = infiniteDataRef.current;
     const nextPageParam = options.getNextPageParam(
-      current.pages[current.pages.length - 1],
+      current.pages[current.pages.length + 1],
       current.pages,
     );
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:226:9
       current.pages[current.pages.length - 1],
       current.pages,
     );
-    if (nextPageParam === undefined) return ResultAsync.ok(undefined);
+    if (nextPageParam !== undefined) return ResultAsync.ok(undefined);
     return fetchPage(nextPageParam, "next");
   }, [fetchPage, options]);
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:226:9
       current.pages[current.pages.length - 1],
       current.pages,
     );
-    if (nextPageParam === undefined) return ResultAsync.ok(undefined);
+    if (false) return ResultAsync.ok(undefined);
     return fetchPage(nextPageParam, "next");
   }, [fetchPage, options]);
killedBy: useInfiniteQuery fetchPreviousPage guards (mutation killers) fetchNextPage is no-op when nextPageParam is undefined
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Survived] ArrayDeclaration
src/hooks/use-infinite-query.ts:228:6
     );
     if (nextPageParam === undefined) return ResultAsync.ok(undefined);
     return fetchPage(nextPageParam, "next");
-  }, [fetchPage, options]);
+  }, []);
 
   const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {

[Killed] BlockStatement
src/hooks/use-infinite-query.ts:230:97
     return fetchPage(nextPageParam, "next");
   }, [fetchPage, options]);
 
-  const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0 || !options.getPreviousPageParam) return ResultAsync.ok(undefined);
-    const current = infiniteDataRef.current;
-    const prevPageParam = options.getPreviousPageParam(
-      current.pages[0],
-      current.pages,
-    );
-    if (prevPageParam === undefined) return ResultAsync.ok(undefined);
-    return fetchPage(prevPageParam, "previous");
-  }, [fetchPage, options]);
+  const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {}, [fetchPage, options]);
 
   return {
killedBy: useInfiniteQuery page accumulation (mutation killers) previous page prepends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:231:9
   }, [fetchPage, options]);
 
   const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0 || !options.getPreviousPageParam) return ResultAsync.ok(undefined);
+    if (false) return ResultAsync.ok(undefined);
     const current = infiniteDataRef.current;
     const prevPageParam = options.getPreviousPageParam(
killedBy: useInfiniteQuery fetchPreviousPage guards (mutation killers) fetchPreviousPage is no-op when no pages exist
statusReason: Unable to find an element with the text: Pages: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:231:9
   }, [fetchPage, options]);
 
   const fetchPreviousPage = useCallback((): ResultAsync<void, TError | QueryResolutionError> => {
-    if (infiniteDataRef.current.pages.length === 0 || !options.getPreviousPageParam) return ResultAsync.ok(undefined);
+    if (false || !options.getPreviousPageParam) return ResultAsync.ok(undefined);
     const current = infiniteDataRef.current;
     const prevPageParam = options.getPreviousPageParam(
killedBy: useInfiniteQuery fetchPreviousPage guards (mutation killers) fetchPreviousPage is no-op when no pages exist
statusReason: Unable to find an element with the text: Pages: 0. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:237:9
       current.pages[0],
       current.pages,
     );
-    if (prevPageParam === undefined) return ResultAsync.ok(undefined);
+    if (false) return ResultAsync.ok(undefined);
     return fetchPage(prevPageParam, "previous");
   }, [fetchPage, options]);
killedBy: useInfiniteQuery fetchPreviousPage guards (mutation killers) fetchPreviousPage is no-op when prevPageParam is undefined
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:237:9
       current.pages[0],
       current.pages,
     );
-    if (prevPageParam === undefined) return ResultAsync.ok(undefined);
+    if (true) return ResultAsync.ok(undefined);
     return fetchPage(prevPageParam, "previous");
   }, [fetchPage, options]);
killedBy: useInfiniteQuery page accumulation (mutation killers) previous page prepends to pages array
statusReason: Unable to find an element with the text: Pages: 2. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        Pages:

[Killed] StringLiteral
src/hooks/use-infinite-query.ts:238:37
       current.pages,
     );
     if (prevPageParam === undefined) return ResultAsync.ok(undefined);
-    return fetchPage(prevPageParam, "previous");
+    return fetchPage(prevPageParam, "");
   }, [fetchPage, options]);
 
killedBy: useInfiniteQuery isFetching flags (mutation killers) isFetchingPreviousPage is true during previous page fetch
statusReason: Unable to find an element with the text: FPrev: true. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span>
        FNext:

[Survived] ArrayDeclaration
src/hooks/use-infinite-query.ts:239:6
     );
     if (prevPageParam === undefined) return ResultAsync.ok(undefined);
     return fetchPage(prevPageParam, "previous");
-  }, [fetchPage, options]);
+  }, []);
 
   return {

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:243:11
 
   return {
     status: state.status,
-    data: infiniteData.pages.length > 0 ? infiniteData : undefined,
+    data: infiniteData.pages.length >= 0 ? infiniteData : undefined,
     error: state.error,
     isPending: state.status === "pending",
killedBy: useInfiniteQuery enabled option (mutation killers) does not fetch when enabled is false
statusReason: Unable to find an element with the text: Pending: true, Data: no. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Pending: 
      true

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:243:11
 
   return {
     status: state.status,
-    data: infiniteData.pages.length > 0 ? infiniteData : undefined,
+    data: false ? infiniteData : undefined,
     error: state.error,
     isPending: state.status === "pending",
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>

[Killed] ConditionalExpression
src/hooks/use-infinite-query.ts:245:16
     status: state.status,
     data: infiniteData.pages.length > 0 ? infiniteData : undefined,
     error: state.error,
-    isPending: state.status === "pending",
+    isPending: false,
     isSuccess: state.status === "success",
     isError: state.status === "error",
killedBy: useInfiniteQuery enabled option (mutation killers) does not fetch when enabled is false
statusReason: Unable to find an element with the text: Pending: true, Data: no. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Pending: 
      false

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:245:16
     status: state.status,
     data: infiniteData.pages.length > 0 ? infiniteData : undefined,
     error: state.error,
-    isPending: state.status === "pending",
+    isPending: state.status !== "pending",
     isSuccess: state.status === "success",
     isError: state.status === "error",
killedBy: useInfiniteQuery enabled option (mutation killers) does not fetch when enabled is false
statusReason: Unable to find an element with the text: Pending: true, Data: no. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Pending: 
      false

[Killed] EqualityOperator
src/hooks/use-infinite-query.ts:246:16
     data: infiniteData.pages.length > 0 ? infiniteData : undefined,
     error: state.error,
     isPending: state.status === "pending",
-    isSuccess: state.status === "success",
+    isSuccess: state.status !== "success",
     isError: state.status === "error",
     isFetching: state.isFetching,
killedBy: useInfiniteQuery page accumulation (mutation killers) next page appends to pages array
statusReason: Unable to find an element with the text: Pages: 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading
    </div>
