[Killed] BlockStatement
src/hooks/use-query-inspector.ts:41:50
   const cachedRef = useRef<{ version: number; value: T } | undefined>(undefined);
 
   const subscribe = useCallback(
-    (onStoreChange: () => void): (() => void) => {
-      return inspector.subscribe(() => {
-        versionRef.current++;
-        onStoreChange();
-      });
-    },
+    (onStoreChange: () => void): (() => void) => {},
     [inspector],
   );
killedBy: useQuerySnapshot updates when cache changes
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:42:40
 
   const subscribe = useCallback(
     (onStoreChange: () => void): (() => void) => {
-      return inspector.subscribe(() => {
-        versionRef.current++;
-        onStoreChange();
-      });
+      return inspector.subscribe(() => {});
     },
     [inspector],
killedBy: useQuerySnapshot updates when cache changes
statusReason: expected 0 to be greater than 0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div>

[Survived] UpdateOperator
src/hooks/use-query-inspector.ts:43:9
   const subscribe = useCallback(
     (onStoreChange: () => void): (() => void) => {
       return inspector.subscribe(() => {
-        versionRef.current++;
+        versionRef.current--;
         onStoreChange();
       });

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:50:44
     [inspector],
   );
 
-  const getSnapshot = useCallback((): T => {
-    const version = versionRef.current;
-    const cached = cachedRef.current;
-    if (cached !== undefined && cached.version === version) {
-      return cached.value;
-    }
-    const value = compute(inspector);
-    cachedRef.current = { version, value };
-    return value;
-  }, [inspector, compute]);
+  const getSnapshot = useCallback((): T => {}, [inspector, compute]);
 
   return useSyncExternalStore(subscribe, getSnapshot, getSnapshot);
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:53:61
   const getSnapshot = useCallback((): T => {
     const version = versionRef.current;
     const cached = cachedRef.current;
-    if (cached !== undefined && cached.version === version) {
-      return cached.value;
-    }
+    if (cached !== undefined && cached.version === version) {}
     const value = compute(inspector);
     cachedRef.current = { version, value };
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] EqualityOperator
src/hooks/use-query-inspector.ts:53:9
   const getSnapshot = useCallback((): T => {
     const version = versionRef.current;
     const cached = cachedRef.current;
-    if (cached !== undefined && cached.version === version) {
+    if (cached === undefined && cached.version === version) {
       return cached.value;
     }
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Cannot read properties of undefined (reading 'version')

[Killed] ObjectLiteral
src/hooks/use-query-inspector.ts:57:25
       return cached.value;
     }
     const value = compute(inspector);
-    cachedRef.current = { version, value };
+    cachedRef.current = {};
     return value;
   }, [inspector, compute]);
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Maximum update depth exceeded. This can happen when a component repeatedly calls setState inside componentWillUpdate or componentDidUpdate. React limits the number of nested updates to prevent infinite loops.

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:68:25
 // useQuerySnapshot
 // =============================================================================
 
-const computeSnapshot = (api: QueryInspectorAPI): QuerySnapshot => api.getSnapshot();
+const computeSnapshot = () => undefined;
 
 /**
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:76:51
  * For fine-grained subscriptions, prefer the more specific hooks
  * (useQueryCacheStats, useQueryDiagnostics, etc.).
  */
-export function useQuerySnapshot(): QuerySnapshot {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeSnapshot);
-}
+export function useQuerySnapshot(): QuerySnapshot {}
 
 // =============================================================================
killedBy: useQuerySnapshot returns initial snapshot with empty entries
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:85:28
 // useQueryDiagnostics
 // =============================================================================
 
-const computeDiagnostics = (api: QueryInspectorAPI): QueryDiagnosticSummary => api.getDiagnosticSummary();
+const computeDiagnostics = () => undefined;
 
 /**
killedBy: useQueryDiagnostics returns diagnostic summary
statusReason: Cannot read properties of undefined (reading 'totalQueries')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:90:63
 /**
  * Returns the diagnostic summary (active queries, error rate, dedup savings, etc.).
  */
-export function useQueryDiagnostics(): QueryDiagnosticSummary {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeDiagnostics);
-}
+export function useQueryDiagnostics(): QueryDiagnosticSummary {}
 
 // =============================================================================
killedBy: useQueryInspector hooks (mutation killers) useQueryDiagnostics returns diagnostic summary
statusReason: Cannot read properties of undefined (reading 'errorRate')

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:99:27
 // useQueryCacheStats
 // =============================================================================
 
-const computeCacheStats = (api: QueryInspectorAPI): CacheStats => api.getCacheStats();
+const computeCacheStats = () => undefined;
 
 /**
killedBy: useQueryCacheStats returns cache stats with zero entries initially
statusReason: Cannot read properties of undefined (reading 'totalEntries')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:104:50
 /**
  * Returns cache statistics (total entries, hit rate, GC eligible, etc.).
  */
-export function useQueryCacheStats(): CacheStats {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeCacheStats);
-}
+export function useQueryCacheStats(): CacheStats {}
 
 // =============================================================================
killedBy: useQueryCacheStats returns cache stats with zero entries initially
statusReason: Cannot read properties of undefined (reading 'totalEntries')

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:113:28
 // useQuerySuggestions
 // =============================================================================
 
-const computeSuggestions = (api: QueryInspectorAPI): ReadonlyArray<QuerySuggestion> => api.getQuerySuggestions();
+const computeSuggestions = () => undefined;
 
 /**
killedBy: useQuerySuggestions returns empty suggestions initially
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:118:71
 /**
  * Returns performance suggestions (stale queries, invalidation storms, etc.).
  */
-export function useQuerySuggestions(): ReadonlyArray<QuerySuggestion> {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeSuggestions);
-}
+export function useQuerySuggestions(): ReadonlyArray<QuerySuggestion> {}
 
 // =============================================================================
killedBy: useQuerySuggestions returns empty suggestions initially
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:132:101
  *
  * @param filter - Optional filter for port name, result type, duration, etc.
  */
-export function useQueryFetchHistory(filter?: FetchHistoryFilter): ReadonlyArray<FetchHistoryEntry> {
-  const inspector = useQueryInspector();
-
-  // Stabilize the filter reference to avoid unnecessary re-computations
-  const filterRef = useRef(filter);
-  filterRef.current = filter;
-
-  const compute = useCallback(
-    (api: QueryInspectorAPI): ReadonlyArray<FetchHistoryEntry> => api.getFetchHistory(filterRef.current),
-    [],
-  );
-
-  return useVersionedSnapshot(inspector, compute);
-}
+export function useQueryFetchHistory(filter?: FetchHistoryFilter): ReadonlyArray<FetchHistoryEntry> {}
 
 // =============================================================================
killedBy: useQueryFetchHistory returns empty history initially
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:140:5
   filterRef.current = filter;
 
   const compute = useCallback(
-    (api: QueryInspectorAPI): ReadonlyArray<FetchHistoryEntry> => api.getFetchHistory(filterRef.current),
+    () => undefined,
     [],
   );
killedBy: useQueryFetchHistory returns empty history initially
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] ArrayDeclaration
src/hooks/use-query-inspector.ts:141:5
 
   const compute = useCallback(
     (api: QueryInspectorAPI): ReadonlyArray<FetchHistoryEntry> => api.getFetchHistory(filterRef.current),
-    [],
+    ["Stryker was here"],
   );
 

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:151:34
 // useQueryInvalidationGraph
 // =============================================================================
 
-const computeInvalidationGraph = (api: QueryInspectorAPI): InvalidationGraph => api.getInvalidationGraph();
+const computeInvalidationGraph = () => undefined;
 
 /**
killedBy: useQueryInvalidationGraph returns the invalidation graph
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:157:64
  * Returns the invalidation graph showing mutation-to-query relationships,
  * runtime edges, cycles, and cascade depth.
  */
-export function useQueryInvalidationGraph(): InvalidationGraph {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeInvalidationGraph);
-}
+export function useQueryInvalidationGraph(): InvalidationGraph {}
 
 // =============================================================================
killedBy: useQueryInvalidationGraph returns the invalidation graph
statusReason: Cannot read properties of undefined (reading 'nodes')

[Killed] ArrowFunction
src/hooks/use-query-inspector.ts:166:27
 // useQueryPorts
 // =============================================================================
 
-const computeQueryPorts = (api: QueryInspectorAPI): ReadonlyArray<{ name: string; entryCount: number; subscriberCount: number }> =>
-  api.listQueryPorts();
+const computeQueryPorts = () => undefined;
 
 /**
killedBy: useQueryPorts returns empty list when no queries are cached
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/hooks/use-query-inspector.ts:172:111
 /**
  * Returns the list of known query ports with entry counts and subscriber counts.
  */
-export function useQueryPorts(): ReadonlyArray<{ name: string; entryCount: number; subscriberCount: number }> {
-  const inspector = useQueryInspector();
-  return useVersionedSnapshot(inspector, computeQueryPorts);
-}
+export function useQueryPorts(): ReadonlyArray<{ name: string; entryCount: number; subscriberCount: number }> {}
 
killedBy: useQueryPorts returns empty list when no queries are cached
statusReason: Cannot read properties of undefined (reading 'length')
