[Killed] BlockStatement
src/compensation/engine.ts:35:48
 function buildCompensationParams(
   step: CompensationPlanStep,
   ctx: EngineCompensationContext,
-): ReturnType<typeof tryCatch<unknown, Error>> {
-  return tryCatch(
-    () => step.compensateFn(ctx),
-    (error: unknown) => error instanceof Error ? error : new Error(String(error)),
-  );
-}
+): ReturnType<typeof tryCatch<unknown, Error>> {}
 
 function buildCompensationContext(
killedBy: SagaRunner (DOD 6) step failure and compensation failed execution triggers compensation before returning error
statusReason: Cannot read properties of undefined (reading 'isErr')

[Killed] ArrowFunction
src/compensation/engine.ts:37:5
   ctx: EngineCompensationContext,
 ): ReturnType<typeof tryCatch<unknown, Error>> {
   return tryCatch(
-    () => step.compensateFn(ctx),
+    () => undefined,
     (error: unknown) => error instanceof Error ? error : new Error(String(error)),
   );
killedBy: SagaRunner (DOD 6) CompensationFailed returned when compensation partially fails returns CompensationFailed with details
statusReason: expected 'StepFailed' to be 'CompensationFailed' // Object.is equality

[Killed] ArrowFunction
src/compensation/engine.ts:38:5
 ): ReturnType<typeof tryCatch<unknown, Error>> {
   return tryCatch(
     () => step.compensateFn(ctx),
-    (error: unknown) => error instanceof Error ? error : new Error(String(error)),
+    () => undefined,
   );
 }
killedBy: compensation-handler: deep mutants createCompensationFailedError: errors.length > 0 vs >= 0 compensation failed error has compensationCause from first error
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/compensation/engine.ts:50:30
   failedStepIndex: number,
   failedStepName: string,
   executionId: string,
-): EngineCompensationContext {
-  return {
-    input: sagaInput,
-    results: accumulatedResults,
-    stepResult: step.result,
-    error: originalError,
-    failedStepIndex,
-    failedStepName,
-    stepIndex: step.stepIndex,
-    executionId,
-  };
-}
+): EngineCompensationContext {}
 
 // =============================================================================
killedBy: SagaRunner (DOD 6) step failure and compensation failed execution triggers compensation before returning error
statusReason: expected 'CompensationFailed' to be 'StepFailed' // Object.is equality

[Killed] BlockStatement
src/compensation/engine.ts:85:9
   success: boolean,
   error: unknown,
   durationMs: number,
-): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:step",
-      executionId,
-      sagaName,
-      stepName: step.stepName,
-      stepIndex: step.stepIndex,
-      success,
-      error,
-      durationMs,
-      timestamp: Date.now(),
-    });
-  }
-}
+): void {}
 
 function emitCompensationCompleted(
killedBy: SagaRunner (DOD 6) event emission content verification compensation:step emitted per compensation step with success field
statusReason: expected 0 to be greater than or equal to 2

[Killed] ConditionalExpression
src/compensation/engine.ts:86:7
   error: unknown,
   durationMs: number,
 ): void {
-  if (emitEvent) {
+  if (false) {
     emitEvent({
       type: "compensation:step",
killedBy: SagaRunner (DOD 6) event emission content verification compensation:step emitted per compensation step with success field
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/compensation/engine.ts:86:18
   error: unknown,
   durationMs: number,
 ): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:step",
-      executionId,
-      sagaName,
-      stepName: step.stepName,
-      stepIndex: step.stepIndex,
-      success,
-      error,
-      durationMs,
-      timestamp: Date.now(),
-    });
-  }
+  if (emitEvent) {}
 }
 
killedBy: SagaRunner (DOD 6) event emission content verification compensation:step emitted per compensation step with success field
statusReason: expected 0 to be greater than or equal to 2

[Killed] BlockStatement
src/compensation/engine.ts:107:9
   sagaName: string,
   compensatedSteps: readonly string[],
   startTime: number,
-): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:completed",
-      executionId,
-      sagaName,
-      compensatedSteps,
-      totalDurationMs: Date.now() - startTime,
-      timestamp: Date.now(),
-    });
-  }
-}
+): void {}
 
 function emitCompensationFailed(
killedBy: SagaRunner (DOD 6) event emission content verification compensation:completed when all finish has compensatedSteps and totalDurationMs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/compensation/engine.ts:108:18
   compensatedSteps: readonly string[],
   startTime: number,
 ): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:completed",
-      executionId,
-      sagaName,
-      compensatedSteps,
-      totalDurationMs: Date.now() - startTime,
-      timestamp: Date.now(),
-    });
-  }
+  if (emitEvent) {}
 }
 
killedBy: SagaRunner (DOD 6) event emission content verification compensation:completed when all finish has compensatedSteps and totalDurationMs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/compensation/engine.ts:110:13
 ): void {
   if (emitEvent) {
     emitEvent({
-      type: "compensation:completed",
+      type: "",
       executionId,
       sagaName,
killedBy: SagaRunner (DOD 6) event emission content verification compensation:completed when all finish has compensatedSteps and totalDurationMs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/compensation/engine.ts:114:24
       executionId,
       sagaName,
       compensatedSteps,
-      totalDurationMs: Date.now() - startTime,
+      totalDurationMs: Date.now() + startTime,
       timestamp: Date.now(),
     });
killedBy: emitCompensationCompleted mutations totalDurationMs is a non-negative number (not Date.now() + startTime)
statusReason: expected 3541190820330 to be less than 5000

[Killed] BlockStatement
src/compensation/engine.ts:128:9
   error: unknown,
   compensatedSteps: readonly string[],
   remainingSteps: readonly string[],
-): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:failed",
-      executionId,
-      sagaName,
-      failedCompensationStep,
-      error,
-      compensatedSteps,
-      remainingSteps,
-      timestamp: Date.now(),
-    });
-  }
-}
+): void {}
 
 // =============================================================================
killedBy: SagaRunner (DOD 6) event emission content verification compensation:failed when handler fails has failedCompensationStep and error
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/compensation/engine.ts:129:7
   compensatedSteps: readonly string[],
   remainingSteps: readonly string[],
 ): void {
-  if (emitEvent) {
+  if (true) {
     emitEvent({
       type: "compensation:failed",
killedBy: Compensation Engine — Property-Based allSucceeded is true iff failedSteps is empty
statusReason: Property failed after 2 tests
{ seed: -1652775363, path: "1:0:0:0", endOnFailure: true }
Counterexample: [[{"stepName":"AGStep","stepIndex":0,"result":"result-AGStep","compensateFn":() => `compensate-${name}`}],"best-effort"]
Shrunk 3 time(s)

Encountered failures were:
- [[{"stepName":"G9KgU2LHGStep","stepIndex":0,"result":"result-G9KgU2LHGStep","compensateFn":() => `compensate-${name}`}],"best-e

[Killed] BlockStatement
src/compensation/engine.ts:129:18
   compensatedSteps: readonly string[],
   remainingSteps: readonly string[],
 ): void {
-  if (emitEvent) {
-    emitEvent({
-      type: "compensation:failed",
-      executionId,
-      sagaName,
-      failedCompensationStep,
-      error,
-      compensatedSteps,
-      remainingSteps,
-      timestamp: Date.now(),
-    });
-  }
+  if (emitEvent) {}
 }
 
killedBy: compensation engine buildCompensationParams failure path sequential: compensateFn throws -> stops after first failure with failedSteps and events
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/compensation/engine.ts:151:79
   | { readonly step: CompensationPlanStep; readonly ok: true }
   | { readonly step: CompensationPlanStep; readonly ok: false; readonly cause: unknown };
 
-function stepCompensated(step: CompensationPlanStep): CompensationStepOutcome {
-  return { step, ok: true };
-}
+function stepCompensated(step: CompensationPlanStep): CompensationStepOutcome {}
 
 function stepCompensationFailed(step: CompensationPlanStep, cause: unknown): CompensationStepOutcome {
killedBy: Compensation Engine — Property-Based allSucceeded is true iff failedSteps is empty
statusReason: Property failed after 3 tests
{ seed: -48396139, path: "2:1:0:1:1:0:0:0:0:1:0:1:0:0:0", endOnFailure: true }
Counterexample: [[{"stepName":"AaStep","stepIndex":0,"result":"result-AaStep","compensateFn":() => `compensate-${name}`}],"parallel"]
Shrunk 14 time(s)

Encountered failures were:

[Killed] BooleanLiteral
src/compensation/engine.ts:152:22
   | { readonly step: CompensationPlanStep; readonly ok: false; readonly cause: unknown };
 
 function stepCompensated(step: CompensationPlanStep): CompensationStepOutcome {
-  return { step, ok: true };
+  return { step, ok: false };
 }
 
killedBy: Compensation Engine — Property-Based parallel strategy: failure count matches number of failing invokers
statusReason: Property failed after 1 tests
{ seed: -1138889132, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"stepName":"AAStep","stepIndex":0,"result":"result-AAStep","compensateFn":() => `compensate-${name}`}]]
Shrunk 4 time(s)

Encountered failures were:
- [[{"stepName":"ERWh0kCgVStep","stepIndex":0,"result":"result-ERWh0kCgVStep","compensateFn":() => `compensate-${name}`}]]

[Killed] BlockStatement
src/compensation/engine.ts:155:102
   return { step, ok: true };
 }
 
-function stepCompensationFailed(step: CompensationPlanStep, cause: unknown): CompensationStepOutcome {
-  return { step, ok: false, cause };
-}
+function stepCompensationFailed(step: CompensationPlanStep, cause: unknown): CompensationStepOutcome {}
 
 // =============================================================================
killedBy: Compensation Engine — Property-Based allSucceeded is true iff failedSteps is empty
statusReason: Property failed after 5 tests
{ seed: -1105647114, path: "4:1:0:0:0:2:1:2:3:1:0:3:1:1", endOnFailure: true }
Counterexample: [[{"stepName":"UaStep","stepIndex":0,"result":"result-UaStep","compensateFn":() => `compensate-${name}`}],"parallel"]
Shrunk 13 time(s)

Encountered failures were:

[Killed] BooleanLiteral
src/compensation/engine.ts:156:22
 }
 
 function stepCompensationFailed(step: CompensationPlanStep, cause: unknown): CompensationStepOutcome {
-  return { step, ok: false, cause };
+  return { step, ok: true, cause };
 }
 
killedBy: Compensation Engine — Property-Based parallel strategy: failure count matches number of failing invokers
statusReason: Property failed after 1 tests
{ seed: 1527624104, path: "0:1:1:1:1:2:1:1:0:1:0:0:1:0:9:0:4:0", endOnFailure: true }
Counterexample: [[{"stepName":"A0Step","stepIndex":0,"result":"result-A0Step","compensateFn":() => `compensate-${name}`}]]
Shrunk 17 time(s)

Encountered failures were:
- [[{"stepName":"DeAIVCN43J4Step","stepIndex":0,"result":"result-DeAIVCN43J4Step","compensateFn":() => `compensate-

[Killed] ObjectLiteral
src/compensation/engine.ts:156:10
 }
 
 function stepCompensationFailed(step: CompensationPlanStep, cause: unknown): CompensationStepOutcome {
-  return { step, ok: false, cause };
+  return {};
 }
 
killedBy: Compensation Engine — Property-Based allSucceeded is true iff failedSteps is empty
statusReason: Property failed after 4 tests
{ seed: -667067412, path: "3:0:1:4:2:3:15:3:1", endOnFailure: true }
Counterexample: [[{"stepName":"D3Step","stepIndex":0,"result":"result-D3Step","compensateFn":() => `compensate-${name}`}],"parallel"]
Shrunk 8 time(s)

Encountered failures were:
- [[{"stepName":"Gi59N5Step","stepIndex":0,"result":"result-Gi59N5Step","compensateFn":() => `compensate-${name}`}],"paral

[Killed] ArrayDeclaration
src/compensation/engine.ts:176:33
   emitEvent: ((event: SagaEvent) => void) | undefined,
 ): Promise<CompensationResult> {
   const compensatedSteps: string[] = [];
-  const failedSteps: string[] = [];
+  const failedSteps: string[] = ["Stryker was here"];
   const errors: CompensationStepError[] = [];
   const strategyStart = Date.now();
killedBy: Compensation Engine — Property-Based errors.length matches failedSteps.length
statusReason: Property failed after 3 tests
{ seed: -1087398755, path: "2:0:0:0:0", endOnFailure: true }
Counterexample: [[{"stepName":"A0Step","stepIndex":0,"result":"result-A0Step","compensateFn":() => `compensate-${name}`}],"sequential"]
Shrunk 4 time(s)

Encountered failures were:
- [[{"stepName":"TOm4Step","stepIndex":0,"result":"result-TOm4Step","compensateFn":() => `compensate-${name}`}],"sequential"]

[Killed] MethodExpression
src/compensation/engine.ts:181:20
   const strategyStart = Date.now();
 
   // Execute in reverse order
-  const reversed = [...steps].reverse();
+  const reversed = [...steps];
 
   for (let i = 0; i < reversed.length; i++) {
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected [ 'A', 'B' ] to deeply equal [ 'B', 'A' ]

[Killed] EqualityOperator
src/compensation/engine.ts:183:19
   // Execute in reverse order
   const reversed = [...steps].reverse();
 
-  for (let i = 0; i < reversed.length; i++) {
+  for (let i = 0; i <= reversed.length; i++) {
     const step = reversed[i];
     const stepStart = Date.now();
killedBy: Compensation Engine — Property-Based allSucceeded is true iff failedSteps is empty
statusReason: Property failed after 2 tests
{ seed: 1449079683, path: "1:20:0:0:1:0:1:6:0:0:0:0", endOnFailure: true }
Counterexample: [[{"stepName":"AaStep","stepIndex":0,"result":"result-AaStep","compensateFn":() => `compensate-${name}`}],"sequential"]
Shrunk 11 time(s)

Encountered failures were:

[Killed] EqualityOperator
src/compensation/engine.ts:183:19
   // Execute in reverse order
   const reversed = [...steps].reverse();
 
-  for (let i = 0; i < reversed.length; i++) {
+  for (let i = 0; i >= reversed.length; i++) {
     const step = reversed[i];
     const stepStart = Date.now();
killedBy: buildCompensationParams mutations wraps non-Error thrown values from compensateFn into Error via String()
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/compensation/engine.ts:199:9
 
     const paramsResult = buildCompensationParams(step, ctx);
 
-    if (paramsResult.isErr()) {
+    if (false) {
       failedSteps.push(step.stepName);
       errors.push({
killedBy: compensation-handler: compensation events have correct fields saga:failed event has compensated=false when compensation fails
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/compensation/engine.ts:199:9
 
     const paramsResult = buildCompensationParams(step, ctx);
 
-    if (paramsResult.isErr()) {
+    if (true) {
       failedSteps.push(step.stepName);
       errors.push({
killedBy: emitCompensationStepEvent mutations does not crash when emitEvent is undefined
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/compensation/engine.ts:206:73
         stepIndex: step.stepIndex,
         cause: paramsResult.error,
       });
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, paramsResult.error, Date.now() - stepStart);
       const remaining = reversed.slice(i + 1).map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, paramsResult.error, compensatedSteps, remaining);
killedBy: sequential compensateFn throw error reporting emits compensation:step with success=false and then compensation:failed
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/compensation/engine.ts:206:100
         stepIndex: step.stepIndex,
         cause: paramsResult.error,
       });
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() + stepStart);
       const remaining = reversed.slice(i + 1).map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, paramsResult.error, compensatedSteps, remaining);

[Killed] ArrowFunction
src/compensation/engine.ts:207:51
         cause: paramsResult.error,
       });
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
-      const remaining = reversed.slice(i + 1).map(s => s.stepName);
+      const remaining = reversed.slice(i + 1).map(() => undefined);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, paramsResult.error, compensatedSteps, remaining);
       // Sequential strategy stops on first failure
killedBy: compensation engine buildCompensationParams failure path sequential: compensateFn throws -> stops after first failure with failedSteps and events
statusReason: expected [ undefined ] to deeply equal [ 'First' ]

[Killed] ArithmeticOperator
src/compensation/engine.ts:207:40
         cause: paramsResult.error,
       });
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
-      const remaining = reversed.slice(i + 1).map(s => s.stepName);
+      const remaining = reversed.slice(i - 1).map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, paramsResult.error, compensatedSteps, remaining);
       // Sequential strategy stops on first failure
killedBy: compensation engine buildCompensationParams failure path sequential: compensateFn throws -> stops after first failure with failedSteps and events
statusReason: expected [ 'Third', 'Thrower', 'First' ] to deeply equal [ 'First' ]

[Killed] ConditionalExpression
src/compensation/engine.ts:214:9
     }
 
     const result = await invoker(step, paramsResult.value);
-    if (result.isOk()) {
+    if (true) {
       compensatedSteps.push(step.stepName);
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
killedBy: compensation engine strategy switching sequential stops at first invoker failure
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/compensation/engine.ts:214:9
     }
 
     const result = await invoker(step, paramsResult.value);
-    if (result.isOk()) {
+    if (false) {
       compensatedSteps.push(step.stepName);
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/compensation/engine.ts:216:73
     const result = await invoker(step, paramsResult.value);
     if (result.isOk()) {
       compensatedSteps.push(step.stepName);
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, undefined, Date.now() - stepStart);
     } else {
       failedSteps.push(step.stepName);
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/compensation/engine.ts:216:90
     const result = await invoker(step, paramsResult.value);
     if (result.isOk()) {
       compensatedSteps.push(step.stepName);
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() + stepStart);
     } else {
       failedSteps.push(step.stepName);

[Killed] BlockStatement
src/compensation/engine.ts:217:12
     if (result.isOk()) {
       compensatedSteps.push(step.stepName);
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
-    } else {
-      failedSteps.push(step.stepName);
-      errors.push({
-        stepName: step.stepName,
-        stepIndex: step.stepIndex,
-        cause: result.error,
-      });
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() - stepStart);
-      const remaining = reversed.slice(i + 1).map(s => s.stepName);
-      emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, result.error, compensatedSteps, remaining);
-      // Sequential strategy stops on first failure
-      break;
-    }
+    } else {}
   }
 
killedBy: compensation engine strategy switching sequential stops at first invoker failure
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/compensation/engine.ts:224:73
         stepIndex: step.stepIndex,
         cause: result.error,
       });
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, result.error, Date.now() - stepStart);
       const remaining = reversed.slice(i + 1).map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, result.error, compensatedSteps, remaining);
killedBy: compensation engine context building compensation:step event for failure has error field set
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/compensation/engine.ts:224:94
         stepIndex: step.stepIndex,
         cause: result.error,
       });
-      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() - stepStart);
+      emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() + stepStart);
       const remaining = reversed.slice(i + 1).map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, result.error, compensatedSteps, remaining);

[Killed] MethodExpression
src/compensation/engine.ts:225:25
         cause: result.error,
       });
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() - stepStart);
-      const remaining = reversed.slice(i + 1).map(s => s.stepName);
+      const remaining = reversed.map(s => s.stepName);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, result.error, compensatedSteps, remaining);
       // Sequential strategy stops on first failure
killedBy: compensation engine — mutation killers sequential compensation emits compensation:failed event with remainingSteps
statusReason: expected [ 'C', 'B', 'A' ] to deeply equal [ 'A' ]

[Killed] ArrowFunction
src/compensation/engine.ts:225:51
         cause: result.error,
       });
       emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, result.error, Date.now() - stepStart);
-      const remaining = reversed.slice(i + 1).map(s => s.stepName);
+      const remaining = reversed.slice(i + 1).map(() => undefined);
       emitCompensationFailed(emitEvent, executionId, sagaName, step.stepName, result.error, compensatedSteps, remaining);
       // Sequential strategy stops on first failure
killedBy: compensation engine strategy switching sequential stops at first invoker failure
statusReason: expected [ undefined ] to deeply equal [ 'OK1' ]

[Killed] ConditionalExpression
src/compensation/engine.ts:232:7
     }
   }
 
-  if (failedSteps.length === 0) {
+  if (false) {
     emitCompensationCompleted(emitEvent, executionId, sagaName, compensatedSteps, strategyStart);
   }
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/compensation/engine.ts:232:7
     }
   }
 
-  if (failedSteps.length === 0) {
+  if (failedSteps.length !== 0) {
     emitCompensationCompleted(emitEvent, executionId, sagaName, compensatedSteps, strategyStart);
   }
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ObjectLiteral
src/compensation/engine.ts:236:10
     emitCompensationCompleted(emitEvent, executionId, sagaName, compensatedSteps, strategyStart);
   }
 
-  return {
-    compensatedSteps,
-    failedSteps,
-    errors,
-    allSucceeded: failedSteps.length === 0,
-  };
+  return {};
 }
 
killedBy: compensation engine event emission sequential strategy emits compensation:step for each step then compensation:completed
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/compensation/engine.ts:240:19
     compensatedSteps,
     failedSteps,
     errors,
-    allSucceeded: failedSteps.length === 0,
+    allSucceeded: failedSteps.length !== 0,
   };
 }
killedBy: buildCompensationParams mutations wraps non-Error thrown values from compensateFn into Error via String()
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/compensation/engine.ts:240:19
     compensatedSteps,
     failedSteps,
     errors,
-    allSucceeded: failedSteps.length === 0,
+    allSucceeded: true,
   };
 }
killedBy: compensation engine buildCompensationParams failure path sequential: compensateFn throws -> stops after first failure with failedSteps and events
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/compensation/engine.ts:256:38
   sagaName: string,
   emitEvent: ((event: SagaEvent) => void) | undefined,
 ): Promise<CompensationResult> {
-  const compensatedSteps: string[] = [];
+  const compensatedSteps: string[] = ["Stryker was here"];
   const failedSteps: string[] = [];
   const errors: CompensationStepError[] = [];
killedBy: compensation engine event emission parallel strategy emits compensation:step for all and compensation:completed
statusReason: expected [ 'Stryker was here', 'X', 'Y', 'Z' ] to deeply equal [ 'X', 'Y', 'Z' ]

[Killed] ArrayDeclaration
src/compensation/engine.ts:258:43
 ): Promise<CompensationResult> {
   const compensatedSteps: string[] = [];
   const failedSteps: string[] = [];
-  const errors: CompensationStepError[] = [];
+  const errors: CompensationStepError[] = ["Stryker was here"];
   const strategyStart = Date.now();
 
killedBy: compensation engine buildCompensationParams failure path parallel: compensateFn throws -> collects alongside successes
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/compensation/engine.ts:277:33
 
       const paramsResult = buildCompensationParams(step, ctx);
 
-      if (paramsResult.isErr()) {
-        emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
-        return stepCompensationFailed(step, paramsResult.error);
-      }
+      if (paramsResult.isErr()) {}
 
       return (await invoker(step, paramsResult.value)).match(
killedBy: executeParallel mutations parallel handles compensateFn that throws
statusReason: expected true to be false // Object.is equality

[Survived] BooleanLiteral
src/compensation/engine.ts:278:75
       const paramsResult = buildCompensationParams(step, ctx);
 
       if (paramsResult.isErr()) {
-        emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
+        emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, paramsResult.error, Date.now() - stepStart);
         return stepCompensationFailed(step, paramsResult.error);
       }

[Survived] ArithmeticOperator
src/compensation/engine.ts:278:102
       const paramsResult = buildCompensationParams(step, ctx);
 
       if (paramsResult.isErr()) {
-        emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() - stepStart);
+        emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, paramsResult.error, Date.now() + stepStart);
         return stepCompensationFailed(step, paramsResult.error);
       }

[Killed] BlockStatement
src/compensation/engine.ts:283:40
       }
 
       return (await invoker(step, paramsResult.value)).match(
-        (): CompensationStepOutcome => {
-          emitCompensationStepEvent(emitEvent, executionId, sagaName, step, true, undefined, Date.now() - stepStart);
-          return stepCompensated(step);
-        },
+        (): CompensationStepOutcome => {},
         (error): CompensationStepOutcome => {
           emitCompensationStepEvent(emitEvent, executionId, sagaName, step, false, error, Date.now() - stepStart);
killedBy: executeParallel mutations runs all compensations (not in reverse order)
statusReason: Cannot read properties of undefined (reading 'ok')
