[Survived] MethodExpression
src/introspection/saga-inspector.ts:180:22
       const successful = sagaExecutions.filter(
         (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
       );
-      const failed = sagaExecutions.filter(
-        (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
-      );
+      const failed = sagaExecutions;
 
       const errorTagDist: Record<string, number> = {};

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:181:42
         (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
       );
       const failed = sagaExecutions.filter(
-        (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
+        (e) => !e.compensation.active && e.compensation.failedSteps.length <= 0,
       );
 
killedBy: computeCompensationStats — mostFailedStep tie-breaking two steps with equal fail counts — first encountered wins (strict >)
statusReason: expected null to be 'CompA' // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:181:16
         (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
       );
       const failed = sagaExecutions.filter(
-        (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
+        (e) => false,
       );
 
killedBy: SagaInspector getCompensationStats computes successRate
statusReason: expected null to be 'Payment' // Object.is equality

[Killed] BlockStatement
src/introspection/saga-inspector.ts:185:42
       );
 
       const errorTagDist: Record<string, number> = {};
-      for (const exec of sagaExecutions) {
-        if (exec.error) {
-          const tag = exec.error._tag;
-          errorTagDist[tag] = (errorTagDist[tag] ?? 0) + 1;
-        }
-      }
+      for (const exec of sagaExecutions) {}
 
       // Find most failed step
killedBy: saga-inspector.ts — traceToExecutionState details error in traceToExecutionState extracts stepName and stepIndex from failed step
statusReason: expected {} to deeply equal { StepFailed: 1 }

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:186:13
 
       const errorTagDist: Record<string, number> = {};
       for (const exec of sagaExecutions) {
-        if (exec.error) {
+        if (false) {
           const tag = exec.error._tag;
           errorTagDist[tag] = (errorTagDist[tag] ?? 0) + 1;
killedBy: computeCompensationStats errorTagDistribution counts error tags across compensations
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/introspection/saga-inspector.ts:186:25
 
       const errorTagDist: Record<string, number> = {};
       for (const exec of sagaExecutions) {
-        if (exec.error) {
-          const tag = exec.error._tag;
-          errorTagDist[tag] = (errorTagDist[tag] ?? 0) + 1;
-        }
+        if (exec.error) {}
       }
 
killedBy: saga-inspector.ts — traceToExecutionState details error in traceToExecutionState extracts stepName and stepIndex from failed step
statusReason: expected {} to deeply equal { StepFailed: 1 }

[Killed] LogicalOperator
src/introspection/saga-inspector.ts:188:32
       for (const exec of sagaExecutions) {
         if (exec.error) {
           const tag = exec.error._tag;
-          errorTagDist[tag] = (errorTagDist[tag] ?? 0) + 1;
+          errorTagDist[tag] = (errorTagDist[tag] && 0) + 1;
         }
       }
killedBy: saga-inspector.ts — traceToExecutionState details error in traceToExecutionState extracts stepName and stepIndex from failed step
statusReason: expected { StepFailed: NaN } to deeply equal { StepFailed: 1 }

[Killed] ArithmeticOperator
src/introspection/saga-inspector.ts:188:31
       for (const exec of sagaExecutions) {
         if (exec.error) {
           const tag = exec.error._tag;
-          errorTagDist[tag] = (errorTagDist[tag] ?? 0) + 1;
+          errorTagDist[tag] = (errorTagDist[tag] ?? 0) - 1;
         }
       }
killedBy: saga-inspector.ts — traceToExecutionState details error in traceToExecutionState extracts stepName and stepIndex from failed step
statusReason: expected { StepFailed: -1 } to deeply equal { StepFailed: 1 }

[Killed] BlockStatement
src/introspection/saga-inspector.ts:194:34
 
       // Find most failed step
       const stepFailCounts = new Map<string, number>();
-      for (const exec of failed) {
-        for (const step of exec.compensation.failedSteps) {
-          const count = stepFailCounts.get(step) ?? 0;
-          stepFailCounts.set(step, count + 1);
-        }
-      }
+      for (const exec of failed) {}
 
       let mostFailedStep: string | null = null;
killedBy: saga-inspector.ts — computeCompensationStats edge cases tie-breaking for mostFailedStep uses strict > (not >=)
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] BlockStatement
src/introspection/saga-inspector.ts:195:59
       // Find most failed step
       const stepFailCounts = new Map<string, number>();
       for (const exec of failed) {
-        for (const step of exec.compensation.failedSteps) {
-          const count = stepFailCounts.get(step) ?? 0;
-          stepFailCounts.set(step, count + 1);
-        }
+        for (const step of exec.compensation.failedSteps) {}
       }
 
killedBy: saga-inspector.ts — computeCompensationStats edge cases tie-breaking for mostFailedStep uses strict > (not >=)
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] LogicalOperator
src/introspection/saga-inspector.ts:196:25
       const stepFailCounts = new Map<string, number>();
       for (const exec of failed) {
         for (const step of exec.compensation.failedSteps) {
-          const count = stepFailCounts.get(step) ?? 0;
+          const count = stepFailCounts.get(step) && 0;
           stepFailCounts.set(step, count + 1);
         }
killedBy: computeCompensationStats bySaga breakdown includes successRate and mostFailedStep
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] ArithmeticOperator
src/introspection/saga-inspector.ts:197:36
       for (const exec of failed) {
         for (const step of exec.compensation.failedSteps) {
           const count = stepFailCounts.get(step) ?? 0;
-          stepFailCounts.set(step, count + 1);
+          stepFailCounts.set(step, count - 1);
         }
       }
killedBy: saga-inspector.ts — computeCompensationStats edge cases tie-breaking for mostFailedStep uses strict > (not >=)
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] BlockStatement
src/introspection/saga-inspector.ts:203:51
 
       let mostFailedStep: string | null = null;
       let maxFails = 0;
-      for (const [step, count] of stepFailCounts) {
-        if (count > maxFails) {
-          maxFails = count;
-          mostFailedStep = step;
-        }
-      }
+      for (const [step, count] of stepFailCounts) {}
 
       const executionsWithDuration = sagaExecutions.filter(
killedBy: saga-inspector.ts — computeCompensationStats edge cases tie-breaking for mostFailedStep uses strict > (not >=)
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:204:13
       let mostFailedStep: string | null = null;
       let maxFails = 0;
       for (const [step, count] of stepFailCounts) {
-        if (count > maxFails) {
+        if (false) {
           maxFails = count;
           mostFailedStep = step;
killedBy: computeCompensationStats bySaga breakdown includes successRate and mostFailedStep
statusReason: expected null to be 'StepA' // Object.is equality

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:204:13
       let mostFailedStep: string | null = null;
       let maxFails = 0;
       for (const [step, count] of stepFailCounts) {
-        if (count > maxFails) {
+        if (count >= maxFails) {
           maxFails = count;
           mostFailedStep = step;
killedBy: saga-inspector.ts — computeCompensationStats edge cases tie-breaking for mostFailedStep uses strict > (not >=)
statusReason: expected 'StepB' to be 'StepA' // Object.is equality

[Survived] MethodExpression
src/introspection/saga-inspector.ts:210:38
         }
       }
 
-      const executionsWithDuration = sagaExecutions.filter(
-        (e) => e.compensation.durationMs !== undefined,
-      );
+      const executionsWithDuration = sagaExecutions;
       const avgCompTime = executionsWithDuration.length > 0
         ? executionsWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length

[Survived] ArrowFunction
src/introspection/saga-inspector.ts:211:9
       }
 
       const executionsWithDuration = sagaExecutions.filter(
-        (e) => e.compensation.durationMs !== undefined,
+        () => undefined,
       );
       const avgCompTime = executionsWithDuration.length > 0

[Survived] ConditionalExpression
src/introspection/saga-inspector.ts:211:16
       }
 
       const executionsWithDuration = sagaExecutions.filter(
-        (e) => e.compensation.durationMs !== undefined,
+        (e) => true,
       );
       const avgCompTime = executionsWithDuration.length > 0

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:213:27
       const executionsWithDuration = sagaExecutions.filter(
         (e) => e.compensation.durationMs !== undefined,
       );
-      const avgCompTime = executionsWithDuration.length > 0
+      const avgCompTime = true
         ? executionsWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length
         : 0;
killedBy: saga-inspector.ts — computeCompensationStats edge cases avgCompTime is 0 when all compensation durationMs are undefined
statusReason: expected NaN to be +0 // Object.is equality

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:213:27
       const executionsWithDuration = sagaExecutions.filter(
         (e) => e.compensation.durationMs !== undefined,
       );
-      const avgCompTime = executionsWithDuration.length > 0
+      const avgCompTime = executionsWithDuration.length <= 0
         ? executionsWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length
         : 0;
killedBy: saga-inspector.ts — computeCompensationStats edge cases avgCompTime is 0 when all compensation durationMs are undefined
statusReason: expected NaN to be +0 // Object.is equality

[NoCoverage] ArrowFunction
src/introspection/saga-inspector.ts:214:41
         (e) => e.compensation.durationMs !== undefined,
       );
       const avgCompTime = executionsWithDuration.length > 0
-        ? executionsWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length
+        ? executionsWithDuration.reduce(() => undefined, 0) / executionsWithDuration.length
         : 0;
 

[NoCoverage] ArithmeticOperator
src/introspection/saga-inspector.ts:214:53
         (e) => e.compensation.durationMs !== undefined,
       );
       const avgCompTime = executionsWithDuration.length > 0
-        ? executionsWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length
+        ? executionsWithDuration.reduce((sum, e) => sum - (e.compensation.durationMs ?? 0), 0) / executionsWithDuration.length
         : 0;
 

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:220:22
       bySaga.push({
         sagaName,
         totalCompensations: sagaExecutions.length,
-        successRate: sagaExecutions.length > 0 ? successful.length / sagaExecutions.length : 0,
+        successRate: false ? successful.length / sagaExecutions.length : 0,
         averageCompensationTime: avgCompTime,
         mostFailedStep,
killedBy: saga-inspector.ts — computeCompensationStats edge cases successRate fraction is correctly computed (1/3)
statusReason: expected +0 to be close to 0.3333333333333333, received difference is 0.3333333333333333, but expected 0.000005

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:220:22
       bySaga.push({
         sagaName,
         totalCompensations: sagaExecutions.length,
-        successRate: sagaExecutions.length > 0 ? successful.length / sagaExecutions.length : 0,
+        successRate: sagaExecutions.length <= 0 ? successful.length / sagaExecutions.length : 0,
         averageCompensationTime: avgCompTime,
         mostFailedStep,
killedBy: saga-inspector.ts — computeCompensationStats edge cases successRate fraction is correctly computed (1/3)
statusReason: expected +0 to be close to 0.3333333333333333, received difference is 0.3333333333333333, but expected 0.000005

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:226:11
         errorTagDistribution: errorTagDist,
       });
 
-      if (sagaExecutions.length > mostCompensatedCount) {
+      if (false) {
         mostCompensatedCount = sagaExecutions.length;
         mostCompensatedSaga = sagaName;
killedBy: saga-inspector.ts — computeCompensationStats edge cases mostCompensatedSaga with equal counts keeps the first encountered
statusReason: expected null not to be null

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:226:11
         errorTagDistribution: errorTagDist,
       });
 
-      if (sagaExecutions.length > mostCompensatedCount) {
+      if (sagaExecutions.length <= mostCompensatedCount) {
         mostCompensatedCount = sagaExecutions.length;
         mostCompensatedSaga = sagaName;
killedBy: saga-inspector.ts — computeCompensationStats edge cases mostCompensatedSaga with equal counts keeps the first encountered
statusReason: expected null not to be null

[Killed] MethodExpression
src/introspection/saga-inspector.ts:232:29
       }
     }
 
-    const successfulTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
-    ).length;
+    const successfulTotal = compensated.length;
     const failedTotal = compensated.filter(
       (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats compensation field mapping compensation.active is true when status is not 'completed' and not 'failed'
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:233:14
     }
 
     const successfulTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
+      (e) => true,
     ).length;
     const failedTotal = compensated.filter(
killedBy: saga-inspector.ts — computeCompensationStats edge cases successRate fraction is correctly computed (1/3)
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/introspection/saga-inspector.ts:233:14
     }
 
     const successfulTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
+      (e) => e.compensation.active && e.compensation.failedSteps.length === 0,
     ).length;
     const failedTotal = compensated.filter(
killedBy: computeCompensationStats — multi-saga computes correct stats across 2 sagas with mixed results
statusReason: expected +0 to be 3 // Object.is equality

[Killed] MethodExpression
src/introspection/saga-inspector.ts:235:25
     const successfulTotal = compensated.filter(
       (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
     ).length;
-    const failedTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
-    ).length;
+    const failedTotal = compensated.length;
 
     const allWithDuration = compensated.filter(
killedBy: saga-inspector.ts — computeCompensationStats edge cases successRate fraction is correctly computed (1/3)
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:236:40
       (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
     ).length;
     const failedTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
+      (e) => !e.compensation.active && true,
     ).length;
 
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats compensation field mapping compensation.active is true when status is not 'completed' and not 'failed'
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:236:14
       (e) => !e.compensation.active && e.compensation.failedSteps.length === 0,
     ).length;
     const failedTotal = compensated.filter(
-      (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
+      (e) => true,
     ).length;
 
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats compensation field mapping compensation.active is true when status is not 'completed' and not 'failed'
statusReason: expected 1 to be +0 // Object.is equality

[Survived] MethodExpression
src/introspection/saga-inspector.ts:239:29
       (e) => !e.compensation.active && e.compensation.failedSteps.length > 0,
     ).length;
 
-    const allWithDuration = compensated.filter(
-      (e) => e.compensation.durationMs !== undefined,
-    );
+    const allWithDuration = compensated;
     const globalAvgCompTime = allWithDuration.length > 0
       ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length

[Survived] ConditionalExpression
src/introspection/saga-inspector.ts:240:14
     ).length;
 
     const allWithDuration = compensated.filter(
-      (e) => e.compensation.durationMs !== undefined,
+      (e) => false,
     );
     const globalAvgCompTime = allWithDuration.length > 0

[Survived] ConditionalExpression
src/introspection/saga-inspector.ts:240:14
     ).length;
 
     const allWithDuration = compensated.filter(
-      (e) => e.compensation.durationMs !== undefined,
+      (e) => true,
     );
     const globalAvgCompTime = allWithDuration.length > 0

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:242:31
     const allWithDuration = compensated.filter(
       (e) => e.compensation.durationMs !== undefined,
     );
-    const globalAvgCompTime = allWithDuration.length > 0
+    const globalAvgCompTime = allWithDuration.length >= 0
       ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length
       : 0;
killedBy: computeCompensationStats — avgCompTime all executions with durationMs undefined returns avgCompTime 0
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:242:31
     const allWithDuration = compensated.filter(
       (e) => e.compensation.durationMs !== undefined,
     );
-    const globalAvgCompTime = allWithDuration.length > 0
+    const globalAvgCompTime = true
       ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length
       : 0;
killedBy: computeCompensationStats — avgCompTime all executions with durationMs undefined returns avgCompTime 0
statusReason: expected NaN to be +0 // Object.is equality

[NoCoverage] ArithmeticOperator
src/introspection/saga-inspector.ts:243:9
       (e) => e.compensation.durationMs !== undefined,
     );
     const globalAvgCompTime = allWithDuration.length > 0
-      ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length
+      ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) * allWithDuration.length
       : 0;
 

[NoCoverage] ArrowFunction
src/introspection/saga-inspector.ts:243:32
       (e) => e.compensation.durationMs !== undefined,
     );
     const globalAvgCompTime = allWithDuration.length > 0
-      ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length
+      ? allWithDuration.reduce(() => undefined, 0) / allWithDuration.length
       : 0;
 

[Killed] ObjectLiteral
src/introspection/saga-inspector.ts:246:26
       ? allWithDuration.reduce((sum, e) => sum + (e.compensation.durationMs ?? 0), 0) / allWithDuration.length
       : 0;
 
-    return Object.freeze({
-      totalCompensations: compensated.length,
-      successfulCompensations: successfulTotal,
-      failedCompensations: failedTotal,
-      averageCompensationTime: globalAvgCompTime,
-      mostCompensatedSaga,
-      bySaga,
-    });
+    return Object.freeze({});
   }
 
killedBy: computeCompensationStats — filter logic branches execution with active:true only is counted as compensated
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/introspection/saga-inspector.ts:257:53
   }
 
   const inspector: SagaInspector = {
-    getDefinitions(): readonly SagaDefinitionInfo[] {
-      return definitions.map(extractDefinitionInfo);
-    },
+    getDefinitions(): readonly SagaDefinitionInfo[] {},
 
     getActiveExecutions(): readonly InspectorSagaExecutionSummary[] {
killedBy: integration/inspector-adapter.ts — createSagaInspectorAdapter factory returns a working SagaInspector
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:262:11
     },
 
     getActiveExecutions(): readonly InspectorSagaExecutionSummary[] {
-      if (!activeTraces) return [];
+      if (false) return [];
 
       const activeStatuses = new Set(["pending", "running", "compensating"]);
killedBy: getActiveExecutions returns empty when no activeTraces provided
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:262:11
     },
 
     getActiveExecutions(): readonly InspectorSagaExecutionSummary[] {
-      if (!activeTraces) return [];
+      if (true) return [];
 
       const activeStatuses = new Set(["pending", "running", "compensating"]);
killedBy: getActiveExecutions — compensation filter/map chains running trace with no compensation has empty compensationState arrays
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/introspection/saga-inspector.ts:264:50
     getActiveExecutions(): readonly InspectorSagaExecutionSummary[] {
       if (!activeTraces) return [];
 
-      const activeStatuses = new Set(["pending", "running", "compensating"]);
+      const activeStatuses = new Set(["pending", "", "compensating"]);
       const result: InspectorSagaExecutionSummary[] = [];
 
killedBy: getActiveExecutions running trace maps to correct summary fields
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/introspection/saga-inspector.ts:264:39
     getActiveExecutions(): readonly InspectorSagaExecutionSummary[] {
       if (!activeTraces) return [];
 
-      const activeStatuses = new Set(["pending", "running", "compensating"]);
+      const activeStatuses = new Set(["", "running", "compensating"]);
       const result: InspectorSagaExecutionSummary[] = [];
 
killedBy: saga-inspector.ts — getActiveExecutions compensationState active is false when trace.status === 'pending'
statusReason: Cannot read properties of undefined (reading 'compensationState')

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:268:13
       const result: InspectorSagaExecutionSummary[] = [];
 
       for (const trace of Object.values(activeTraces)) {
-        if (activeStatuses.has(trace.status)) {
+        if (false) {
           const def = findDefinitionForSaga(trace.sagaName);
           const totalSteps = def?.steps.length ?? 0;
killedBy: integration/inspector-adapter.ts — createSagaInspectorAdapter factory passes activeTraces config to inspector
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:268:13
       const result: InspectorSagaExecutionSummary[] = [];
 
       for (const trace of Object.values(activeTraces)) {
-        if (activeStatuses.has(trace.status)) {
+        if (true) {
           const def = findDefinitionForSaga(trace.sagaName);
           const totalSteps = def?.steps.length ?? 0;
killedBy: getActiveExecutions completed trace is NOT included in active executions
statusReason: expected [ { executionId: 'done-1', …(13) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
src/introspection/saga-inspector.ts:270:30
       for (const trace of Object.values(activeTraces)) {
         if (activeStatuses.has(trace.status)) {
           const def = findDefinitionForSaga(trace.sagaName);
-          const totalSteps = def?.steps.length ?? 0;
+          const totalSteps = def?.steps.length && 0;
 
           result.push(Object.freeze({
killedBy: getActiveExecutions running trace maps to correct summary fields
statusReason: expected +0 to be 3 // Object.is equality

[Killed] OptionalChaining
src/introspection/saga-inspector.ts:270:30
       for (const trace of Object.values(activeTraces)) {
         if (activeStatuses.has(trace.status)) {
           const def = findDefinitionForSaga(trace.sagaName);
-          const totalSteps = def?.steps.length ?? 0;
+          const totalSteps = def.steps.length ?? 0;
 
           result.push(Object.freeze({
killedBy: getActiveExecutions totalSteps is 0 when saga definition is not found
statusReason: Cannot read properties of undefined (reading 'steps')

[Killed] MethodExpression
src/introspection/saga-inspector.ts:277:31
             sagaName: trace.sagaName,
             status: trace.status,
             currentStepName: getCurrentStepName(trace),
-            currentStepIndex: trace.steps.filter(
-              (s) => s.status === "completed",
-            ).length,
+            currentStepIndex: trace.steps.length,
             totalSteps,
             completedStepCount: trace.steps.filter(
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats currentStep counts only completed steps currentStep = number of completed steps from trace
statusReason: expected 3 to be 2 // Object.is equality

[Killed] EqualityOperator
src/introspection/saga-inspector.ts:278:22
             status: trace.status,
             currentStepName: getCurrentStepName(trace),
             currentStepIndex: trace.steps.filter(
-              (s) => s.status === "completed",
+              (s) => s.status !== "completed",
             ).length,
             totalSteps,
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats currentStep counts only completed steps currentStep = number of completed steps from trace
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:278:22
             status: trace.status,
             currentStepName: getCurrentStepName(trace),
             currentStepIndex: trace.steps.filter(
-              (s) => s.status === "completed",
+              (s) => false,
             ).length,
             totalSteps,
killedBy: saga-inspector.ts — traceToExecutionState details completedSteps maps step name and index from completed trace steps
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
src/introspection/saga-inspector.ts:281:33
               (s) => s.status === "completed",
             ).length,
             totalSteps,
-            completedStepCount: trace.steps.filter(
-              (s) => s.status === "completed",
-            ).length,
+            completedStepCount: trace.steps.length,
             startedAt: new Date(trace.startedAt).toISOString(),
             updatedAt: new Date(Date.now()).toISOString(),
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats currentStep counts only completed steps currentStep = number of completed steps from trace
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArrowFunction
src/introspection/saga-inspector.ts:282:15
             ).length,
             totalSteps,
             completedStepCount: trace.steps.filter(
-              (s) => s.status === "completed",
+              () => undefined,
             ).length,
             startedAt: new Date(trace.startedAt).toISOString(),
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats currentStep counts only completed steps currentStep = number of completed steps from trace
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/introspection/saga-inspector.ts:282:22
             ).length,
             totalSteps,
             completedStepCount: trace.steps.filter(
-              (s) => s.status === "completed",
+              (s) => false,
             ).length,
             startedAt: new Date(trace.startedAt).toISOString(),
killedBy: saga-inspector.ts — traceToExecutionState via getCompensationStats currentStep counts only completed steps currentStep = number of completed steps from trace
statusReason: expected +0 to be 2 // Object.is equality
