[Killed] ConditionalExpression
src/runtime/status-builder.ts:26:5
   now: number,
 ): SagaStatus {
   switch (internalStatus) {
-    case "running":
-      return {
-        state: "running",
-        executionId,
-        sagaName,
-        currentStepIndex: completedSteps.length,
-        currentStepName: "",
-        completedSteps,
-        startedAt: now,
-      };
+    case "running":
     case "completed":
       return {
killedBy: SagaRunner (DOD 6) getStatus during running execution returns running status with correct fields mid-execution
statusReason: expected 'completed' to be 'running' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:28:16
   switch (internalStatus) {
     case "running":
       return {
-        state: "running",
+        state: "",
         executionId,
         sagaName,
killedBy: SagaRunner (DOD 6) getStatus during running execution returns running status with correct fields mid-execution
statusReason: expected '' to be 'running' // Object.is equality

[Killed] ConditionalExpression
src/runtime/status-builder.ts:36:5
         completedSteps,
         startedAt: now,
       };
-    case "completed":
-      return {
-        state: "completed",
-        executionId,
-        sagaName,
-        completedSteps,
-        startedAt: now,
-        completedAt: now,
-        durationMs: 0,
-      };
+    case "completed":
     case "compensating":
       return {
killedBy: buildSagaStatus — exact field assertions completed status has all correct fields
statusReason: expected 'compensating' to be 'completed' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:36:10
         completedSteps,
         startedAt: now,
       };
-    case "completed":
+    case "":
       return {
         state: "completed",
killedBy: buildSagaStatus — exact field assertions completed status has all correct fields
statusReason: Unexpected value: "completed"

[Killed] ConditionalExpression
src/runtime/status-builder.ts:46:5
         completedAt: now,
         durationMs: 0,
       };
-    case "compensating":
-      return {
-        state: "compensating",
-        executionId,
-        sagaName,
-        failedStepName: "",
-        failedStepIndex: completedSteps.length,
-        compensatingStepIndex: 0,
-        compensatingStepName: "",
-        compensatedSteps: [],
-        startedAt: now,
-        error: {
-          _tag: "StepFailed",
-          executionId,
-          sagaName,
-          stepName: "",
-          stepIndex: -1,
-          message: "Compensation in progress",
-          completedSteps,
-          compensatedSteps: [],
-          cause: undefined,
-        } satisfies SagaError<unknown>,
-      };
+    case "compensating":
     case "failed":
       return {
killedBy: buildSagaStatus compensating/cancelled fields (L733-735, L780-781) getStatus during compensating has exact fields
statusReason: expected 'failed' to be 'compensating' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:48:16
       };
     case "compensating":
       return {
-        state: "compensating",
+        state: "",
         executionId,
         sagaName,
killedBy: buildSagaStatus compensating/cancelled fields (L733-735, L780-781) getStatus during compensating has exact fields
statusReason: expected '' to be 'compensating' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:63:20
           sagaName,
           stepName: "",
           stepIndex: -1,
-          message: "Compensation in progress",
+          message: "",
           completedSteps,
           compensatedSteps: [],
killedBy: buildSagaStatus — exact field assertions compensating status has all correct fields
statusReason: expected '' to be 'Compensation in progress' // Object.is equality

[Killed] ConditionalExpression
src/runtime/status-builder.ts:69:5
           cause: undefined,
         } satisfies SagaError<unknown>,
       };
-    case "failed":
-      return {
-        state: "failed",
-        executionId,
-        sagaName,
-        failedStepName: "",
-        compensated: false,
-        compensatedSteps: [],
-        startedAt: now,
-        failedAt: now,
-        durationMs: 0,
-        error: {
-          _tag: "StepFailed",
-          executionId,
-          sagaName,
-          stepName: "",
-          stepIndex: -1,
-          message: "Saga failed",
-          completedSteps,
-          compensatedSteps: [],
-          cause: undefined,
-        } satisfies SagaError<unknown>,
-      };
+    case "failed":
     case "cancelled":
       return {
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: expected 'cancelled' to be 'failed' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:69:10
           cause: undefined,
         } satisfies SagaError<unknown>,
       };
-    case "failed":
+    case "":
       return {
         state: "failed",
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: Unexpected value: "failed"

[Killed] BooleanLiteral
src/runtime/status-builder.ts:75:22
         executionId,
         sagaName,
         failedStepName: "",
-        compensated: false,
+        compensated: true,
         compensatedSteps: [],
         startedAt: now,
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/runtime/status-builder.ts:80:16
         startedAt: now,
         failedAt: now,
         durationMs: 0,
-        error: {
-          _tag: "StepFailed",
-          executionId,
-          sagaName,
-          stepName: "",
-          stepIndex: -1,
-          message: "Saga failed",
-          completedSteps,
-          compensatedSteps: [],
-          cause: undefined,
-        } satisfies SagaError<unknown>,
+        error: {} satisfies SagaError<unknown>,
       };
     case "cancelled":
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: expected undefined to be 'StepFailed' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:81:17
         failedAt: now,
         durationMs: 0,
         error: {
-          _tag: "StepFailed",
+          _tag: "",
           executionId,
           sagaName,
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: expected '' to be 'StepFailed' // Object.is equality

[Killed] StringLiteral
src/runtime/status-builder.ts:86:20
           sagaName,
           stepName: "",
           stepIndex: -1,
-          message: "Saga failed",
+          message: "",
           completedSteps,
           compensatedSteps: [],
killedBy: buildSagaStatus — exact field assertions failed status has all correct fields
statusReason: expected '' to be 'Saga failed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/status-builder.ts:92:5
           cause: undefined,
         } satisfies SagaError<unknown>,
       };
-    case "cancelled":
-      return {
-        state: "cancelled",
-        executionId,
-        sagaName,
-        stepName: "",
-        compensated: false,
-        compensatedSteps: [],
-        cancelledAt: now,
-        startedAt: now,
-      };
+    case "cancelled":
     default:
       return assertNever(internalStatus);
killedBy: buildSagaStatus — exact field assertions cancelled status has all correct fields
statusReason: Unexpected value: "cancelled"

[Killed] ArrayDeclaration
src/runtime/status-builder.ts:99:27
         sagaName,
         stepName: "",
         compensated: false,
-        compensatedSteps: [],
+        compensatedSteps: ["Stryker was here"],
         cancelledAt: now,
         startedAt: now,
killedBy: buildSagaStatus — exact field assertions cancelled status has all correct fields
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[NoCoverage] ConditionalExpression
src/runtime/status-builder.ts:103:5
         cancelledAt: now,
         startedAt: now,
       };
-    default:
-      return assertNever(internalStatus);
+    default:
   }
 }
