[Killed] BlockStatement
src/adapters/factory.ts:34:23
 >(
   port: TPort,
   config: SagaAdapterConfig<TRequires>,
-): SagaAdapter<TPort> {
-  return Object.freeze({
-    port,
-    saga: config.saga,
-    requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "scoped",
-  });
-}
+): SagaAdapter<TPort> {}
 
killedBy: DI Integration createSagaAdapter registers step port dependencies automatically via requires
statusReason: Cannot read properties of undefined (reading 'requires')

[Killed] ObjectLiteral
src/adapters/factory.ts:35:24
   port: TPort,
   config: SagaAdapterConfig<TRequires>,
 ): SagaAdapter<TPort> {
-  return Object.freeze({
-    port,
-    saga: config.saga,
-    requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "scoped",
-  });
+  return Object.freeze({});
 }
 
killedBy: DI Integration createSagaAdapter registers step port dependencies automatically via requires
statusReason: Target cannot be null or undefined.

[Killed] LogicalOperator
src/adapters/factory.ts:38:15
   return Object.freeze({
     port,
     saga: config.saga,
-    requires: config.requires ?? [],
+    requires: config.requires && [],
     lifetime: config.lifetime ?? "scoped",
   });
killedBy: DI Integration createSagaAdapter registers step port dependencies automatically via requires
statusReason: expected [] to have a length of 3 but got +0

[Killed] ArrayDeclaration
src/adapters/factory.ts:38:34
   return Object.freeze({
     port,
     saga: config.saga,
-    requires: config.requires ?? [],
+    requires: config.requires ?? ["Stryker was here"],
     lifetime: config.lifetime ?? "scoped",
   });
killedBy: createSagaAdapter (DOD 4) adapter with empty requires has empty array
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] LogicalOperator
src/adapters/factory.ts:39:15
     port,
     saga: config.saga,
     requires: config.requires ?? [],
-    lifetime: config.lifetime ?? "scoped",
+    lifetime: config.lifetime && "scoped",
   });
 }
killedBy: createSagaAdapter (DOD 4) adapter lifetime defaults to "scoped"
statusReason: expected undefined to be 'scoped' // Object.is equality
