[Killed] StringLiteral
src/integration/library-inspector.ts:40:11
   inspector: SagaInspector,
 ): LibraryInspector {
   return {
-    name: "saga",
+    name: "",
 
     getSnapshot(): Readonly<Record<string, unknown>> {
killedBy: createSagaLibraryInspector returns object with name 'saga'
statusReason: expected '' to be 'saga' // Object.is equality

[Killed] BlockStatement
src/integration/library-inspector.ts:42:54
   return {
     name: "saga",
 
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      return Object.freeze({
-        definitions: Object.freeze(inspector.getDefinitions()),
-        activeExecutions: Object.freeze(inspector.getActiveExecutions()),
-        compensationStats: Object.freeze(inspector.getCompensationStats()),
-        suggestions: Object.freeze(inspector.getSuggestions()),
-      });
-    },
+    getSnapshot(): Readonly<Record<string, unknown>> {},
 
     subscribe(listener: LibraryEventListener): () => void {
killedBy: createSagaLibraryInspector getSnapshot returns definitions from SagaInspector
statusReason: Cannot read properties of undefined (reading 'definitions')

[Killed] BlockStatement
src/integration/library-inspector.ts:51:59
       });
     },
 
-    subscribe(listener: LibraryEventListener): () => void {
-      return inspector.subscribe((event: SagaEvent) => {
-        listener({
-          source: "saga",
-          type: event.type,
-          payload: Object.freeze({ ...event }),
-          timestamp: event.timestamp,
-        });
-      });
-    },
+    subscribe(listener: LibraryEventListener): () => void {},
 
     dispose(): void {
killedBy: createSagaLibraryInspector subscribe forwards SagaEvents as LibraryEvents with correct source/type/payload
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/integration/library-inspector.ts:52:56
     },
 
     subscribe(listener: LibraryEventListener): () => void {
-      return inspector.subscribe((event: SagaEvent) => {
-        listener({
-          source: "saga",
-          type: event.type,
-          payload: Object.freeze({ ...event }),
-          timestamp: event.timestamp,
-        });
-      });
+      return inspector.subscribe((event: SagaEvent) => {});
     },
 
killedBy: createSagaLibraryInspector subscribe forwards SagaEvents as LibraryEvents with correct source/type/payload
statusReason: expected "vi.fn()" to be called once, but got 0 times
