[Killed] LogicalOperator
src/introspection/saga-tracing-hook.ts:25:29
  */
 export function createSagaTracingHook(options: SagaTracingHookOptions): SagaTracingHook {
   const { tracer, filter, scopeId, traceContext } = options;
-  const traceCompensation = options.traceCompensation ?? true;
+  const traceCompensation = options.traceCompensation && true;
 
   /**
killedBy: DI Integration tracing hook tracing hook produces spans
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] BooleanLiteral
src/introspection/saga-tracing-hook.ts:25:58
  */
 export function createSagaTracingHook(options: SagaTracingHookOptions): SagaTracingHook {
   const { tracer, filter, scopeId, traceContext } = options;
-  const traceCompensation = options.traceCompensation ?? true;
+  const traceCompensation = options.traceCompensation ?? false;
 
   /**
killedBy: SagaTracingHook creates span for compensation
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:compensation:Payment', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:30:81
   /**
    * Builds span attributes with optional scopeId and traceContext entries.
    */
-  function withScopeAttrs(base: Record<string, string>): Record<string, string> {
-    const attrs: Record<string, string> = { ...base };
-    if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
-    if (traceContext !== undefined) {
-      for (const [key, value] of Object.entries(traceContext)) {
-        attrs[key] = value;
-      }
-    }
-    return attrs;
-  }
+  function withScopeAttrs(base: Record<string, string>): Record<string, string> {}
 
   const hook: SagaTracingHook = {
killedBy: DI Integration tracing hook tracing hook produces spans
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Validate', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Validate",

[Killed] ObjectLiteral
src/introspection/saga-tracing-hook.ts:31:43
    * Builds span attributes with optional scopeId and traceContext entries.
    */
   function withScopeAttrs(base: Record<string, string>): Record<string, string> {
-    const attrs: Record<string, string> = { ...base };
+    const attrs: Record<string, string> = {};
     if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
     if (traceContext !== undefined) {
killedBy: E2E DI Integration tracing integration: spans are produced for saga and step lifecycle
statusReason: expected undefined to be 'OrderSaga' // Object.is equality

[Killed] EqualityOperator
src/introspection/saga-tracing-hook.ts:32:9
    */
   function withScopeAttrs(base: Record<string, string>): Record<string, string> {
     const attrs: Record<string, string> = { ...base };
-    if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
+    if (scopeId === undefined) attrs["hex-di.saga.scope.id"] = scopeId;
     if (traceContext !== undefined) {
       for (const [key, value] of Object.entries(traceContext)) {
killedBy: SagaTracingHook includes scopeId in attributes
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Payment",

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:32:9
    */
   function withScopeAttrs(base: Record<string, string>): Record<string, string> {
     const attrs: Record<string, string> = { ...base };
-    if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
+    if (false) attrs["hex-di.saga.scope.id"] = scopeId;
     if (traceContext !== undefined) {
       for (const [key, value] of Object.entries(traceContext)) {
killedBy: SagaTracingHook includes scopeId in attributes
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Payment",

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:33:9
   function withScopeAttrs(base: Record<string, string>): Record<string, string> {
     const attrs: Record<string, string> = { ...base };
     if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
-    if (traceContext !== undefined) {
+    if (false) {
       for (const [key, value] of Object.entries(traceContext)) {
         attrs[key] = value;
killedBy: SagaTracingHook includes traceContext entries in attributes
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Payment",

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:33:9
   function withScopeAttrs(base: Record<string, string>): Record<string, string> {
     const attrs: Record<string, string> = { ...base };
     if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
-    if (traceContext !== undefined) {
+    if (true) {
       for (const [key, value] of Object.entries(traceContext)) {
         attrs[key] = value;
killedBy: SagaTracingHook creates span for step execution
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:34:64
     const attrs: Record<string, string> = { ...base };
     if (scopeId !== undefined) attrs["hex-di.saga.scope.id"] = scopeId;
     if (traceContext !== undefined) {
-      for (const [key, value] of Object.entries(traceContext)) {
-        attrs[key] = value;
-      }
+      for (const [key, value] of Object.entries(traceContext)) {}
     }
     return attrs;
killedBy: SagaTracingHook includes traceContext entries in attributes
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Payment",

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:42:78
   }
 
   const hook: SagaTracingHook = {
-    onStepStart(sagaName: string, stepName: string, stepIndex: number): void {
-      if (filter !== undefined && !filter(sagaName)) return;
-      tracer.pushSpan(`saga:${sagaName}/${stepName}`, withScopeAttrs({
-        "hex-di.saga.name": sagaName,
-        "hex-di.saga.step.name": stepName,
-        "hex-di.saga.step.index": String(stepIndex),
-      }));
-    },
+    onStepStart(sagaName: string, stepName: string, stepIndex: number): void {},
 
     onStepEnd(sagaName: string, ok: boolean): void {
killedBy: SagaTracingHook creates span for step execution
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/introspection/saga-tracing-hook.ts:43:11
 
   const hook: SagaTracingHook = {
     onStepStart(sagaName: string, stepName: string, stepIndex: number): void {
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (filter === undefined && !filter(sagaName)) return;
       tracer.pushSpan(`saga:${sagaName}/${stepName}`, withScopeAttrs({
         "hex-di.saga.name": sagaName,
killedBy: SagaTracingHook creates span for step execution
statusReason: filter is not a function

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:43:11
 
   const hook: SagaTracingHook = {
     onStepStart(sagaName: string, stepName: string, stepIndex: number): void {
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (true) return;
       tracer.pushSpan(`saga:${sagaName}/${stepName}`, withScopeAttrs({
         "hex-di.saga.name": sagaName,
killedBy: SagaTracingHook creates span for step execution
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/introspection/saga-tracing-hook.ts:44:70
   const hook: SagaTracingHook = {
     onStepStart(sagaName: string, stepName: string, stepIndex: number): void {
       if (filter !== undefined && !filter(sagaName)) return;
-      tracer.pushSpan(`saga:${sagaName}/${stepName}`, withScopeAttrs({
-        "hex-di.saga.name": sagaName,
-        "hex-di.saga.step.name": stepName,
-        "hex-di.saga.step.index": String(stepIndex),
-      }));
+      tracer.pushSpan(`saga:${sagaName}/${stepName}`, withScopeAttrs({}));
     },
 
killedBy: SagaTracingHook creates span for step execution
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:OrderSaga/Payment', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "saga:OrderSaga/Payment",

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:51:52
       }));
     },
 
-    onStepEnd(sagaName: string, ok: boolean): void {
-      if (filter !== undefined && !filter(sagaName)) return;
-      tracer.popSpan(ok ? "ok" : "error");
-    },
+    onStepEnd(sagaName: string, ok: boolean): void {},
 
     onCompensationStart(sagaName: string, failedStepName: string): void {
killedBy: SagaTracingHook creates span for step execution
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Number of calls: 0

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:52:11
     },
 
     onStepEnd(sagaName: string, ok: boolean): void {
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (false) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: SagaTracingHook filter excludes non-matching saga names for steps
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "ok",

[Killed] EqualityOperator
src/introspection/saga-tracing-hook.ts:52:11
     },
 
     onStepEnd(sagaName: string, ok: boolean): void {
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (filter === undefined && !filter(sagaName)) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: SagaTracingHook creates span for step execution
statusReason: filter is not a function

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:56:73
       tracer.popSpan(ok ? "ok" : "error");
     },
 
-    onCompensationStart(sagaName: string, failedStepName: string): void {
-      if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
-      tracer.pushSpan(`saga:compensation:${failedStepName}`, withScopeAttrs({
-        "hex-di.saga.name": sagaName,
-        "hex-di.saga.failed.step": failedStepName,
-      }));
-    },
+    onCompensationStart(sagaName: string, failedStepName: string): void {},
 
     onCompensationEnd(sagaName: string, ok: boolean): void {
killedBy: DI Integration tracing hook tracing hook produces spans
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:57:11
     },
 
     onCompensationStart(sagaName: string, failedStepName: string): void {
-      if (!traceCompensation) return;
+      if (true) return;
       if (filter !== undefined && !filter(sagaName)) return;
       tracer.pushSpan(`saga:compensation:${failedStepName}`, withScopeAttrs({
killedBy: SagaTracingHook creates span for compensation
statusReason: expected "vi.fn()" to be called with arguments: [ 'saga:compensation:Payment', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:57:11
     },
 
     onCompensationStart(sagaName: string, failedStepName: string): void {
-      if (!traceCompensation) return;
+      if (false) return;
       if (filter !== undefined && !filter(sagaName)) return;
       tracer.pushSpan(`saga:compensation:${failedStepName}`, withScopeAttrs({
killedBy: SagaTracingHook traceCompensation=false skips compensation spans
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "saga:compensation:Payment",

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:58:11
 
     onCompensationStart(sagaName: string, failedStepName: string): void {
       if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (true) return;
       tracer.pushSpan(`saga:compensation:${failedStepName}`, withScopeAttrs({
         "hex-di.saga.name": sagaName,
killedBy: DI Integration tracing hook tracing hook produces spans
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:58:11
 
     onCompensationStart(sagaName: string, failedStepName: string): void {
       if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (true && !filter(sagaName)) return;
       tracer.pushSpan(`saga:compensation:${failedStepName}`, withScopeAttrs({
         "hex-di.saga.name": sagaName,
killedBy: SagaTracingHook creates span for compensation
statusReason: filter is not a function

[Killed] BlockStatement
src/introspection/saga-tracing-hook.ts:65:60
       }));
     },
 
-    onCompensationEnd(sagaName: string, ok: boolean): void {
-      if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
-      tracer.popSpan(ok ? "ok" : "error");
-    },
+    onCompensationEnd(sagaName: string, ok: boolean): void {},
   };
 
killedBy: SagaTracingHook creates span for compensation
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Number of calls: 0

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:66:11
     },
 
     onCompensationEnd(sagaName: string, ok: boolean): void {
-      if (!traceCompensation) return;
+      if (false) return;
       if (filter !== undefined && !filter(sagaName)) return;
       tracer.popSpan(ok ? "ok" : "error");
killedBy: SagaTracingHook traceCompensation=false skips compensation spans
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "ok",

[Killed] BooleanLiteral
src/introspection/saga-tracing-hook.ts:66:11
     },
 
     onCompensationEnd(sagaName: string, ok: boolean): void {
-      if (!traceCompensation) return;
+      if (traceCompensation) return;
       if (filter !== undefined && !filter(sagaName)) return;
       tracer.popSpan(ok ? "ok" : "error");
killedBy: SagaTracingHook creates span for compensation
statusReason: expected "vi.fn()" to be called with arguments: [ 'ok' ]

Number of calls: 0

[Killed] LogicalOperator
src/introspection/saga-tracing-hook.ts:67:11
 
     onCompensationEnd(sagaName: string, ok: boolean): void {
       if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (filter !== undefined || !filter(sagaName)) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: SagaTracingHook creates span for compensation
statusReason: filter is not a function

[Killed] ConditionalExpression
src/introspection/saga-tracing-hook.ts:67:11
 
     onCompensationEnd(sagaName: string, ok: boolean): void {
       if (!traceCompensation) return;
-      if (filter !== undefined && !filter(sagaName)) return;
+      if (false) return;
       tracer.popSpan(ok ? "ok" : "error");
     },
killedBy: SagaTracingHook filter excludes non-matching saga names for compensation
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "ok",

[Killed] StringLiteral
src/introspection/saga-tracing-hook.ts:68:34
     onCompensationEnd(sagaName: string, ok: boolean): void {
       if (!traceCompensation) return;
       if (filter !== undefined && !filter(sagaName)) return;
-      tracer.popSpan(ok ? "ok" : "error");
+      tracer.popSpan(ok ? "ok" : "");
     },
   };
killedBy: SagaTracingHook creates span for failed compensation
statusReason: expected "vi.fn()" to be called with arguments: [ 'error' ]

Received: 

  1st vi.fn() call:

  [
-   "error",
