[Killed] BlockStatement
src/ports/factory.ts:39:48
 function brandAsSagaPort<TName extends string, TInput, TOutput, TError>(
   port: Port<{ execute: (input: TInput) => unknown }, TName>,
 ): SagaPort<TName, TInput, TOutput, TError>;
-function brandAsSagaPort(port: object): object {
-  return Object.freeze({ ...port, [SAGA_PORT_KIND]: "execution" });
-}
+function brandAsSagaPort(port: object): object {}
 
 /**
killedBy: ports/factory.ts isSagaPort returns true for saga port
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:52:58
 function brandAsSagaManagementPort<TName extends string, TOutput, TError>(
   port: Port<{ resume: (id: string) => unknown }, TName>,
 ): SagaManagementPort<TName, TOutput, TError>;
-function brandAsSagaManagementPort(port: object): object {
-  return Object.freeze({ ...port, [SAGA_PORT_KIND]: "management" });
-}
+function brandAsSagaManagementPort(port: object): object {}
 
 // =============================================================================
killedBy: ports/factory.ts isSagaManagementPort returns true for management port
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:76:47
  */
 export function sagaPort<TInput, TOutput, TError = never>(): <const TName extends string>(
   config: SagaPortConfig<TName>,
-) => SagaPort<TName, TInput, TOutput, TError> {
-  return <const TName extends string>(config: SagaPortConfig<TName>) => {
-    return brandAsSagaPort<TName, TInput, TOutput, TError>(
-      createPort<TName, { execute: (input: TInput) => unknown }>({
-        name: config.name,
-        description: config.description,
-        category: "saga",
-      }),
-    );
-  };
-}
+) => SagaPort<TName, TInput, TOutput, TError> {}
 
 // =============================================================================
killedBy: ports/factory.ts isSagaPort returns true for saga port
statusReason: (0 , __vite_ssr_import_7__.sagaPort)(...) is not a function

[Killed] BlockStatement
src/ports/factory.ts:77:73
 export function sagaPort<TInput, TOutput, TError = never>(): <const TName extends string>(
   config: SagaPortConfig<TName>,
 ) => SagaPort<TName, TInput, TOutput, TError> {
-  return <const TName extends string>(config: SagaPortConfig<TName>) => {
-    return brandAsSagaPort<TName, TInput, TOutput, TError>(
-      createPort<TName, { execute: (input: TInput) => unknown }>({
-        name: config.name,
-        description: config.description,
-        category: "saga",
-      }),
-    );
-  };
+  return <const TName extends string>(config: SagaPortConfig<TName>) => {};
 }
 
killedBy: ports/factory.ts isSagaPort returns true for saga port
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:104:49
  */
 export function sagaManagementPort<TOutput, TError = never>(): <const TName extends string>(
   config: SagaPortConfig<TName>,
-) => SagaManagementPort<TName, TOutput, TError> {
-  return <const TName extends string>(config: SagaPortConfig<TName>) => {
-    return brandAsSagaManagementPort<TName, TOutput, TError>(
-      createPort<TName, { resume: (id: string) => unknown }>({
-        name: config.name,
-        description: config.description,
-        category: "saga",
-      }),
-    );
-  };
-}
+) => SagaManagementPort<TName, TOutput, TError> {}
 
 // =============================================================================
killedBy: ports/factory.ts isSagaPort returns false for management port
statusReason: (0 , __vite_ssr_import_7__.sagaManagementPort)(...) is not a function

[Killed] BlockStatement
src/ports/factory.ts:105:73
 export function sagaManagementPort<TOutput, TError = never>(): <const TName extends string>(
   config: SagaPortConfig<TName>,
 ) => SagaManagementPort<TName, TOutput, TError> {
-  return <const TName extends string>(config: SagaPortConfig<TName>) => {
-    return brandAsSagaManagementPort<TName, TOutput, TError>(
-      createPort<TName, { resume: (id: string) => unknown }>({
-        name: config.name,
-        description: config.description,
-        category: "saga",
-      }),
-    );
-  };
+  return <const TName extends string>(config: SagaPortConfig<TName>) => {};
 }
 
killedBy: ports/factory.ts isSagaManagementPort returns true for management port
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/ports/factory.ts:110:19
       createPort<TName, { resume: (id: string) => unknown }>({
         name: config.name,
         description: config.description,
-        category: "saga",
+        category: "",
       }),
     );
killedBy: ports/factory.ts — port names and categories sagaManagementPort factory creates a port with correct name and category
statusReason: expected '' to be 'saga' // Object.is equality

[Killed] StringLiteral
src/ports/factory.ts:124:9
  * Pre-defined port for the saga persistence adapter.
  */
 export const SagaPersisterPort = createPort<"SagaPersister", SagaPersister>({
-  name: "SagaPersister",
+  name: "",
   description: "Persistence layer for saga execution state",
   category: "saga",
killedBy: ports/factory.ts pre-defined port names SagaPersisterPort name is SagaPersister
statusReason: expected '' to be 'SagaPersister' // Object.is equality

[Killed] StringLiteral
src/ports/factory.ts:138:16
  */
 export const SagaRegistryPort = createPort<"SagaRegistry", SagaRegistry>({
   name: "SagaRegistry",
-  description: "Registry for tracking live saga executions",
+  description: "",
   category: "saga",
 });
killedBy: ports/factory.ts — port names and categories SagaRegistryPort has description set as non-empty string
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/ports/factory.ts:139:13
 export const SagaRegistryPort = createPort<"SagaRegistry", SagaRegistry>({
   name: "SagaRegistry",
   description: "Registry for tracking live saga executions",
-  category: "saga",
+  category: "",
 });
 
killedBy: ports/factory.ts — port names and categories SagaRegistryPort has category 'saga' in metadata
statusReason: expected '' to be 'saga' // Object.is equality

[Killed] StringLiteral
src/ports/factory.ts:150:9
  * Pre-defined port for the saga inspector (introspection API).
  */
 export const SagaInspectorPort = createPort<"SagaInspector", SagaInspector>({
-  name: "SagaInspector",
+  name: "",
   description: "Read-only introspection API for saga state and history",
   category: "saga",
killedBy: ports/factory.ts — port names and categories SagaInspectorPort has __portName 'SagaInspector' (non-empty string)
statusReason: expected '' to be 'SagaInspector' // Object.is equality

[Killed] StringLiteral
src/ports/factory.ts:152:13
 export const SagaInspectorPort = createPort<"SagaInspector", SagaInspector>({
   name: "SagaInspector",
   description: "Read-only introspection API for saga state and history",
-  category: "saga",
+  category: "",
 });
 
killedBy: ports/factory.ts — port names and categories SagaInspectorPort has category 'saga' in metadata
statusReason: expected '' to be 'saga' // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:159:85
 // Type Guards
 // =============================================================================
 
-function isNonNullObject(value: unknown): value is Record<string | symbol, unknown> {
-  return typeof value === "object" && value !== null;
-}
+function isNonNullObject(value: unknown): value is Record<string | symbol, unknown> {}
 
 function hasPortName(value: unknown): value is { __portName: string } {
killedBy: ports/factory isSagaPort returns true for actual saga port
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/ports/factory.ts:160:39
 // =============================================================================
 
 function isNonNullObject(value: unknown): value is Record<string | symbol, unknown> {
-  return typeof value === "object" && value !== null;
+  return typeof value === "object" && value === null;
 }
 
killedBy: ports/factory isSagaPort returns true for actual saga port
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ports/factory.ts:160:39
 // =============================================================================
 
 function isNonNullObject(value: unknown): value is Record<string | symbol, unknown> {
-  return typeof value === "object" && value !== null;
+  return typeof value === "object" && true;
 }
 
killedBy: ports/factory.ts — type guards isSagaPort returns false for null
statusReason: Cannot use 'in' operator to search for '__portName' in null

[Killed] BlockStatement
src/ports/factory.ts:163:71
   return typeof value === "object" && value !== null;
 }
 
-function hasPortName(value: unknown): value is { __portName: string } {
-  return isNonNullObject(value) && "__portName" in value && typeof value.__portName === "string";
-}
+function hasPortName(value: unknown): value is { __portName: string } {}
 
 function hasSagaPortKind(value: unknown, kind: string): boolean {
killedBy: ports/factory isSagaPort returns true for actual saga port
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/ports/factory.ts:164:61
 }
 
 function hasPortName(value: unknown): value is { __portName: string } {
-  return isNonNullObject(value) && "__portName" in value && typeof value.__portName === "string";
+  return isNonNullObject(value) && "__portName" in value && typeof value.__portName !== "string";
 }
 
killedBy: ports/factory.ts — type guards isSagaPort returns true for a port created by sagaPort()
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/ports/factory.ts:164:10
 }
 
 function hasPortName(value: unknown): value is { __portName: string } {
-  return isNonNullObject(value) && "__portName" in value && typeof value.__portName === "string";
+  return isNonNullObject(value) && "__portName" in value || typeof value.__portName === "string";
 }
 
killedBy: ports/factory isSagaPort returns false for null
statusReason: Cannot read properties of null (reading '__portName')

[Killed] BlockStatement
src/ports/factory.ts:167:65
   return isNonNullObject(value) && "__portName" in value && typeof value.__portName === "string";
 }
 
-function hasSagaPortKind(value: unknown, kind: string): boolean {
-  return isNonNullObject(value) && SAGA_PORT_KIND in value && value[SAGA_PORT_KIND] === kind;
-}
+function hasSagaPortKind(value: unknown, kind: string): boolean {}
 
 /**
killedBy: ports/factory.ts — type guards isSagaPort returns true for a port created by sagaPort()
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/ports/factory.ts:168:10
 }
 
 function hasSagaPortKind(value: unknown, kind: string): boolean {
-  return isNonNullObject(value) && SAGA_PORT_KIND in value && value[SAGA_PORT_KIND] === kind;
+  return isNonNullObject(value) && SAGA_PORT_KIND in value || value[SAGA_PORT_KIND] === kind;
 }
 
killedBy: ports/factory isSagaPort returns false for management port
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/ports/factory.ts:168:63
 }
 
 function hasSagaPortKind(value: unknown, kind: string): boolean {
-  return isNonNullObject(value) && SAGA_PORT_KIND in value && value[SAGA_PORT_KIND] === kind;
+  return isNonNullObject(value) && SAGA_PORT_KIND in value && value[SAGA_PORT_KIND] !== kind;
 }
 
killedBy: ports/factory isSagaPort returns true for actual saga port
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:177:98
  * Checks both the `__portName` property (from createPort) and the
  * runtime kind symbol injected by brandAsSagaPort.
  */
-export function isSagaPort(value: unknown): value is SagaPort<string, unknown, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "execution");
-}
+export function isSagaPort(value: unknown): value is SagaPort<string, unknown, unknown, unknown> {}
 
 /**
killedBy: ports/factory.ts — type guards isSagaPort returns true for a port created by sagaPort()
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/ports/factory.ts:178:10
  * runtime kind symbol injected by brandAsSagaPort.
  */
 export function isSagaPort(value: unknown): value is SagaPort<string, unknown, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "execution");
+  return false;
 }
 
killedBy: ports/factory.ts — type guards isSagaPort returns true for a port created by sagaPort()
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/ports/factory.ts:178:10
  * runtime kind symbol injected by brandAsSagaPort.
  */
 export function isSagaPort(value: unknown): value is SagaPort<string, unknown, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "execution");
+  return true;
 }
 
killedBy: ports/factory isSagaPort returns false for regular port
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/ports/factory.ts:187:109
  * Checks both the `__portName` property (from createPort) and the
  * runtime kind symbol injected by brandAsSagaManagementPort.
  */
-export function isSagaManagementPort(value: unknown): value is SagaManagementPort<string, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "management");
-}
+export function isSagaManagementPort(value: unknown): value is SagaManagementPort<string, unknown, unknown> {}
 
killedBy: ports/factory isSagaManagementPort returns true for actual management port
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/ports/factory.ts:188:10
  * runtime kind symbol injected by brandAsSagaManagementPort.
  */
 export function isSagaManagementPort(value: unknown): value is SagaManagementPort<string, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "management");
+  return hasPortName(value) || hasSagaPortKind(value, "management");
 }
 
killedBy: ports/factory.ts — type guards isSagaManagementPort returns false for a saga port
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ports/factory.ts:188:10
  * runtime kind symbol injected by brandAsSagaManagementPort.
  */
 export function isSagaManagementPort(value: unknown): value is SagaManagementPort<string, unknown, unknown> {
-  return hasPortName(value) && hasSagaPortKind(value, "management");
+  return true;
 }
 
killedBy: ports/factory.ts isSagaManagementPort returns false for saga port
statusReason: expected true to be false // Object.is equality
