[Killed] BlockStatement
src/runtime/checkpointing.ts:19:83
 // CompletedStepState Mapper
 // =============================================================================
 
-export function toCompletedStepState(info: CompletedStepInfo): CompletedStepState {
-  return {
-    name: info.stepName,
-    index: info.stepIndex,
-    output: info.result,
-    skipped: false,
-    completedAt: new Date().toISOString(),
-  };
-}
+export function toCompletedStepState(info: CompletedStepInfo): CompletedStepState {}
 
 // =============================================================================
killedBy: DI Integration createSagaManagementExecutor listExecutions returns entries when persister is provided
statusReason: Cannot read properties of undefined (reading 'skipped')

[Killed] ObjectLiteral
src/runtime/checkpointing.ts:20:10
 // =============================================================================
 
 export function toCompletedStepState(info: CompletedStepInfo): CompletedStepState {
-  return {
-    name: info.stepName,
-    index: info.stepIndex,
-    output: info.result,
-    skipped: false,
-    completedAt: new Date().toISOString(),
-  };
+  return {};
 }
 
killedBy: checkpointing: toCompletedStepState maps CompletedStepInfo to CompletedStepState with correct fields
statusReason: expected undefined to be 'CheckpointStep' // Object.is equality

[Killed] BooleanLiteral
src/runtime/checkpointing.ts:24:14
     name: info.stepName,
     index: info.stepIndex,
     output: info.result,
-    skipped: false,
+    skipped: true,
     completedAt: new Date().toISOString(),
   };
killedBy: checkpointing: toCompletedStepState maps CompletedStepInfo to CompletedStepState with correct fields
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/runtime/checkpointing.ts:36:18
 export async function checkpoint(
   state: ExecutionState,
   update: Partial<SagaExecutionState>,
-): Promise<void> {
-  if (!state.persister) return;
-
-  // Swallow persistence errors — emit event but don't abort saga
-  await state.persister.update(state.executionId, {
-    ...update,
-    timestamps: {
-      startedAt: update.timestamps?.startedAt ?? new Date().toISOString(),
-      updatedAt: new Date().toISOString(),
-      completedAt: update.timestamps?.completedAt ?? null,
-    },
-  }).orTee((error) => {
-    emit(state, {
-      type: "step:failed",
-      executionId: state.executionId,
-      sagaName: state.sagaName,
-      stepName: "__checkpoint",
-      stepIndex: -1,
-      error,
-      attemptCount: 1,
-      timestamp: Date.now(),
-      retriesExhausted: true,
-    });
-  });
-}
+): Promise<void> {}
 
killedBy: checkpointing: checkpoint function calls persister.update when persister is configured
statusReason: expected "vi.fn()" to be called with arguments: [ 'test-exec', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/runtime/checkpointing.ts:37:7
   state: ExecutionState,
   update: Partial<SagaExecutionState>,
 ): Promise<void> {
-  if (!state.persister) return;
+  if (false) return;
 
   // Swallow persistence errors — emit event but don't abort saga
killedBy: saga-executor: executeSagaInternal saga:started event emits saga:started with correct sagaName, executionId, input, stepCount
statusReason: Cannot read properties of undefined (reading 'update')

[Killed] BooleanLiteral
src/runtime/checkpointing.ts:37:7
   state: ExecutionState,
   update: Partial<SagaExecutionState>,
 ): Promise<void> {
-  if (!state.persister) return;
+  if (state.persister) return;
 
   // Swallow persistence errors — emit event but don't abort saga
killedBy: DI Integration createSagaExecutor creates a SagaExecutor that wraps SagaRunner with saga definition
statusReason: Cannot read properties of undefined (reading 'update')

[Killed] OptionalChaining
src/runtime/checkpointing.ts:43:18
   await state.persister.update(state.executionId, {
     ...update,
     timestamps: {
-      startedAt: update.timestamps?.startedAt ?? new Date().toISOString(),
+      startedAt: update.timestamps.startedAt ?? new Date().toISOString(),
       updatedAt: new Date().toISOString(),
       completedAt: update.timestamps?.completedAt ?? null,
killedBy: checkpointing: checkpoint function calls persister.update when persister is configured
statusReason: Cannot read properties of undefined (reading 'startedAt')

[Survived] LogicalOperator
src/runtime/checkpointing.ts:43:18
   await state.persister.update(state.executionId, {
     ...update,
     timestamps: {
-      startedAt: update.timestamps?.startedAt ?? new Date().toISOString(),
+      startedAt: update.timestamps?.startedAt && new Date().toISOString(),
       updatedAt: new Date().toISOString(),
       completedAt: update.timestamps?.completedAt ?? null,

[Killed] OptionalChaining
src/runtime/checkpointing.ts:45:20
     timestamps: {
       startedAt: update.timestamps?.startedAt ?? new Date().toISOString(),
       updatedAt: new Date().toISOString(),
-      completedAt: update.timestamps?.completedAt ?? null,
+      completedAt: update.timestamps.completedAt ?? null,
     },
   }).orTee((error) => {
killedBy: checkpointing: checkpoint function calls persister.update when persister is configured
statusReason: Cannot read properties of undefined (reading 'completedAt')

[Survived] LogicalOperator
src/runtime/checkpointing.ts:45:20
     timestamps: {
       startedAt: update.timestamps?.startedAt ?? new Date().toISOString(),
       updatedAt: new Date().toISOString(),
-      completedAt: update.timestamps?.completedAt ?? null,
+      completedAt: update.timestamps?.completedAt && null,
     },
   }).orTee((error) => {

[Killed] BlockStatement
src/runtime/checkpointing.ts:47:23
       updatedAt: new Date().toISOString(),
       completedAt: update.timestamps?.completedAt ?? null,
     },
-  }).orTee((error) => {
-    emit(state, {
-      type: "step:failed",
-      executionId: state.executionId,
-      sagaName: state.sagaName,
-      stepName: "__checkpoint",
-      stepIndex: -1,
-      error,
-      attemptCount: 1,
-      timestamp: Date.now(),
-      retriesExhausted: true,
-    });
-  });
+  }).orTee((error) => {});
 }
 
killedBy: checkpointing: checkpoint function emits step:failed event when persister.update fails
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/runtime/checkpointing.ts:49:13
     },
   }).orTee((error) => {
     emit(state, {
-      type: "step:failed",
+      type: "",
       executionId: state.executionId,
       sagaName: state.sagaName,
killedBy: checkpointing: checkpoint function emits step:failed event when persister.update fails
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/runtime/checkpointing.ts:52:17
       type: "step:failed",
       executionId: state.executionId,
       sagaName: state.sagaName,
-      stepName: "__checkpoint",
+      stepName: "",
       stepIndex: -1,
       error,
killedBy: checkpointing: checkpoint function emits step:failed event when persister.update fails
statusReason: expected undefined to be defined

[Killed] UnaryOperator
src/runtime/checkpointing.ts:53:18
       executionId: state.executionId,
       sagaName: state.sagaName,
       stepName: "__checkpoint",
-      stepIndex: -1,
+      stepIndex: +1,
       error,
       attemptCount: 1,
killedBy: runtime/checkpointing.ts checkpoint error event fields emits step:failed with stepName '__checkpoint' and stepIndex -1 on persister error
statusReason: expected 1 to be -1 // Object.is equality
