[Killed] BlockStatement
src/runtime/events.ts:19:69
 // Event Emission
 // =============================================================================
 
-export function emit(state: ExecutionState, event: SagaEvent): void {
-  recordTrace(state, event);
-  for (const listener of state.listeners) {
-    tryCatch(() => { listener(event); }, () => undefined);
-  }
-}
+export function emit(state: ExecutionState, event: SagaEvent): void {}
 
 // =============================================================================
killedBy: saga-executor: executeSagaInternal saga:started event emits saga:started with correct sagaName, executionId, input, stepCount
statusReason: Expected event of type "saga:started" to be present: expected undefined to be defined

[Killed] BlockStatement
src/runtime/events.ts:21:43
 
 export function emit(state: ExecutionState, event: SagaEvent): void {
   recordTrace(state, event);
-  for (const listener of state.listeners) {
-    tryCatch(() => { listener(event); }, () => undefined);
-  }
+  for (const listener of state.listeners) {}
 }
 
killedBy: event field precision — deferred step captures all events events after first await are captured with exact fields (step:completed, step2 events, saga:completed)
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/runtime/events.ts:22:20
 export function emit(state: ExecutionState, event: SagaEvent): void {
   recordTrace(state, event);
   for (const listener of state.listeners) {
-    tryCatch(() => { listener(event); }, () => undefined);
+    tryCatch(() => {}, () => undefined);
   }
 }
killedBy: event field precision — deferred step captures all events events after first await are captured with exact fields (step:completed, step2 events, saga:completed)
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/runtime/events.ts:32:26
 
 function recordTrace(state: ExecutionState, event: SagaEvent): void {
   switch (event.type) {
-    case "step:started": {
-      state.trace.stepTraces.push({
-        stepName: event.stepName,
-        stepIndex: event.stepIndex,
-        status: "completed", // will be updated on completion/failure
-        startedAt: event.timestamp,
-        completedAt: undefined,
-        durationMs: undefined,
-        attemptCount: 1,
-        error: undefined,
-        skippedReason: undefined,
-      });
-      break;
-    }
+    case "step:started": {}
     case "step:completed": {
       const trace = state.trace.stepTraces.find(
killedBy: events: recordTrace via emit records step:started trace
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:32:5
 
 function recordTrace(state: ExecutionState, event: SagaEvent): void {
   switch (event.type) {
-    case "step:started": {
-      state.trace.stepTraces.push({
-        stepName: event.stepName,
-        stepIndex: event.stepIndex,
-        status: "completed", // will be updated on completion/failure
-        startedAt: event.timestamp,
-        completedAt: undefined,
-        durationMs: undefined,
-        attemptCount: 1,
-        error: undefined,
-        skippedReason: undefined,
-      });
-      break;
-    }
+    case "step:started":
     case "step:completed": {
       const trace = state.trace.stepTraces.find(
killedBy: events: recordTrace via emit records step:started trace
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/runtime/events.ts:36:17
       state.trace.stepTraces.push({
         stepName: event.stepName,
         stepIndex: event.stepIndex,
-        status: "completed", // will be updated on completion/failure
+        status: "", // will be updated on completion/failure
         startedAt: event.timestamp,
         completedAt: undefined,
killedBy: events.ts: recordTrace deep mutants step:started trace fields status is 'completed' (initial placeholder), not empty string
statusReason: expected '' to be 'completed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:46:5
       });
       break;
     }
-    case "step:completed": {
-      const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
-      );
-      if (trace) {
-        trace.status = "completed";
-        trace.completedAt = event.timestamp;
-        trace.durationMs = event.durationMs;
-      }
-      break;
-    }
+    case "step:completed":
     case "step:failed": {
       const trace = state.trace.stepTraces.find(
killedBy: events: recordTrace via emit records step:completed trace
statusReason: expected 'failed' to be 'completed' // Object.is equality

[Killed] BlockStatement
src/runtime/events.ts:46:28
       });
       break;
     }
-    case "step:completed": {
-      const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
-      );
-      if (trace) {
-        trace.status = "completed";
-        trace.completedAt = event.timestamp;
-        trace.durationMs = event.durationMs;
-      }
-      break;
-    }
+    case "step:completed": {}
     case "step:failed": {
       const trace = state.trace.stepTraces.find(
killedBy: events: recordTrace via emit records step:completed trace
statusReason: expected 'failed' to be 'completed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:48:14
     }
     case "step:completed": {
       const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
+        t => false,
       );
       if (trace) {
killedBy: events: recordTrace edge cases step:completed finds correct trace by stepName and completedAt===undefined
statusReason: expected undefined to be 2050 // Object.is equality

[Killed] EqualityOperator
src/runtime/events.ts:48:14
     }
     case "step:completed": {
       const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
+        t => t.stepName !== event.stepName && t.completedAt === undefined,
       );
       if (trace) {
killedBy: SagaRunner (DOD 6) runtime state and trace ExecutionTrace has per-step StepTrace
statusReason: expected 'undefined' to be 'number' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:50:11
       const trace = state.trace.stepTraces.find(
         t => t.stepName === event.stepName && t.completedAt === undefined,
       );
-      if (trace) {
+      if (false) {
         trace.status = "completed";
         trace.completedAt = event.timestamp;
killedBy: events: recordTrace edge cases step:completed finds correct trace by stepName and completedAt===undefined
statusReason: expected undefined to be 2050 // Object.is equality

[Killed] BlockStatement
src/runtime/events.ts:50:18
       const trace = state.trace.stepTraces.find(
         t => t.stepName === event.stepName && t.completedAt === undefined,
       );
-      if (trace) {
-        trace.status = "completed";
-        trace.completedAt = event.timestamp;
-        trace.durationMs = event.durationMs;
-      }
+      if (trace) {}
       break;
     }
killedBy: events: recordTrace edge cases step:completed finds correct trace by stepName and completedAt===undefined
statusReason: expected undefined to be 2050 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:57:5
       }
       break;
     }
-    case "step:failed": {
-      const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
-      );
-      if (trace) {
-        trace.status = "failed";
-        trace.completedAt = event.timestamp;
-        trace.durationMs = trace.startedAt !== undefined ? event.timestamp - trace.startedAt : undefined;
-        trace.attemptCount = event.attemptCount;
-        trace.error = event.error;
-      }
-      break;
-    }
+    case "step:failed":
     case "step:skipped": {
       state.trace.stepTraces.push({
killedBy: SagaRunner getTrace records compensation traces on step failure
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/runtime/events.ts:57:25
       }
       break;
     }
-    case "step:failed": {
-      const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
-      );
-      if (trace) {
-        trace.status = "failed";
-        trace.completedAt = event.timestamp;
-        trace.durationMs = trace.startedAt !== undefined ? event.timestamp - trace.startedAt : undefined;
-        trace.attemptCount = event.attemptCount;
-        trace.error = event.error;
-      }
-      break;
-    }
+    case "step:failed": {}
     case "step:skipped": {
       state.trace.stepTraces.push({
killedBy: SagaRunner getTrace records compensation traces on step failure
statusReason: expected 0 to be greater than or equal to 1

[Killed] ArrowFunction
src/runtime/events.ts:59:9
     }
     case "step:failed": {
       const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
+        () => undefined,
       );
       if (trace) {
killedBy: events.ts: recordTrace deep mutants step:failed trace: durationMs calculation durationMs = timestamp - startedAt when startedAt is defined
statusReason: expected undefined to be 300 // Object.is equality

[Killed] EqualityOperator
src/runtime/events.ts:59:47
     }
     case "step:failed": {
       const trace = state.trace.stepTraces.find(
-        t => t.stepName === event.stepName && t.completedAt === undefined,
+        t => t.stepName === event.stepName && t.completedAt !== undefined,
       );
       if (trace) {
killedBy: events: recordTrace via emit records step:failed trace
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:61:11
       const trace = state.trace.stepTraces.find(
         t => t.stepName === event.stepName && t.completedAt === undefined,
       );
-      if (trace) {
+      if (true) {
         trace.status = "failed";
         trace.completedAt = event.timestamp;
killedBy: checkpointing: checkpoint function emits step:failed event when persister.update fails
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/runtime/events.ts:64:28
       if (trace) {
         trace.status = "failed";
         trace.completedAt = event.timestamp;
-        trace.durationMs = trace.startedAt !== undefined ? event.timestamp - trace.startedAt : undefined;
+        trace.durationMs = false ? event.timestamp - trace.startedAt : undefined;
         trace.attemptCount = event.attemptCount;
         trace.error = event.error;
killedBy: events: recordTrace edge cases step:failed calculates durationMs from startedAt
statusReason: expected undefined to be 150 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:64:28
       if (trace) {
         trace.status = "failed";
         trace.completedAt = event.timestamp;
-        trace.durationMs = trace.startedAt !== undefined ? event.timestamp - trace.startedAt : undefined;
+        trace.durationMs = true ? event.timestamp - trace.startedAt : undefined;
         trace.attemptCount = event.attemptCount;
         trace.error = event.error;
killedBy: events: recordTrace edge cases step:failed with undefined startedAt sets durationMs to undefined
statusReason: expected NaN to be undefined

[Killed] ConditionalExpression
src/runtime/events.ts:70:5
       }
       break;
     }
-    case "step:skipped": {
-      state.trace.stepTraces.push({
-        stepName: event.stepName,
-        stepIndex: event.stepIndex,
-        status: "skipped",
-        startedAt: undefined,
-        completedAt: undefined,
-        durationMs: undefined,
-        attemptCount: 0,
-        error: undefined,
-        skippedReason: event.reason,
-      });
-      break;
-    }
+    case "step:skipped":
     case "compensation:started": {
       state.trace.compensationTrace = {
killedBy: events: recordTrace via emit records step:skipped trace
statusReason: Cannot read properties of undefined (reading 'stepName')

[Killed] BlockStatement
src/runtime/events.ts:70:26
       }
       break;
     }
-    case "step:skipped": {
-      state.trace.stepTraces.push({
-        stepName: event.stepName,
-        stepIndex: event.stepIndex,
-        status: "skipped",
-        startedAt: undefined,
-        completedAt: undefined,
-        durationMs: undefined,
-        attemptCount: 0,
-        error: undefined,
-        skippedReason: event.reason,
-      });
-      break;
-    }
+    case "step:skipped": {}
     case "compensation:started": {
       state.trace.compensationTrace = {
killedBy: events.ts: recordTrace deep mutants step:skipped trace fields status is 'skipped', not empty string
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/runtime/events.ts:74:17
       state.trace.stepTraces.push({
         stepName: event.stepName,
         stepIndex: event.stepIndex,
-        status: "skipped",
+        status: "",
         startedAt: undefined,
         completedAt: undefined,
killedBy: events: recordTrace via emit records step:skipped trace
statusReason: expected '' to be 'skipped' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:84:5
       });
       break;
     }
-    case "compensation:started": {
-      state.trace.compensationTrace = {
-        triggeredBy: event.failedStepName,
-        triggeredByIndex: event.failedStepIndex,
-        steps: [],
-        status: "completed",
-        startedAt: event.timestamp,
-        completedAt: event.timestamp,
-        totalDurationMs: 0,
-      };
-      break;
-    }
+    case "compensation:started":
     case "compensation:step": {
       if (state.trace.compensationTrace) {
killedBy: events: recordTrace edge cases compensation:started initializes compensationTrace with correct fields
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/runtime/events.ts:84:34
       });
       break;
     }
-    case "compensation:started": {
-      state.trace.compensationTrace = {
-        triggeredBy: event.failedStepName,
-        triggeredByIndex: event.failedStepIndex,
-        steps: [],
-        status: "completed",
-        startedAt: event.timestamp,
-        completedAt: event.timestamp,
-        totalDurationMs: 0,
-      };
-      break;
-    }
+    case "compensation:started": {}
     case "compensation:step": {
       if (state.trace.compensationTrace) {
killedBy: events: recordTrace via emit records compensation:started trace
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/runtime/events.ts:96:5
       };
       break;
     }
-    case "compensation:step": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.steps.push({
-          stepName: event.stepName,
-          stepIndex: event.stepIndex,
-          status: event.success ? "completed" : "failed",
-          startedAt: event.timestamp - event.durationMs,
-          completedAt: event.timestamp,
-          durationMs: event.durationMs,
-          error: event.error,
-        });
-        if (!event.success) {
-          state.trace.compensationTrace.status = "failed";
-        }
-      }
-      break;
-    }
+    case "compensation:step":
     case "compensation:completed": {
       if (state.trace.compensationTrace) {
killedBy: events: recordTrace via emit records compensation:step trace
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/runtime/events.ts:96:31
       };
       break;
     }
-    case "compensation:step": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.steps.push({
-          stepName: event.stepName,
-          stepIndex: event.stepIndex,
-          status: event.success ? "completed" : "failed",
-          startedAt: event.timestamp - event.durationMs,
-          completedAt: event.timestamp,
-          durationMs: event.durationMs,
-          error: event.error,
-        });
-        if (!event.success) {
-          state.trace.compensationTrace.status = "failed";
-        }
-      }
-      break;
-    }
+    case "compensation:step": {}
     case "compensation:completed": {
       if (state.trace.compensationTrace) {
killedBy: events: recordTrace edge cases compensation:step with success=true sets status to 'completed'
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/runtime/events.ts:97:42
       break;
     }
     case "compensation:step": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.steps.push({
-          stepName: event.stepName,
-          stepIndex: event.stepIndex,
-          status: event.success ? "completed" : "failed",
-          startedAt: event.timestamp - event.durationMs,
-          completedAt: event.timestamp,
-          durationMs: event.durationMs,
-          error: event.error,
-        });
-        if (!event.success) {
-          state.trace.compensationTrace.status = "failed";
-        }
-      }
+      if (state.trace.compensationTrace) {}
       break;
     }
killedBy: events: recordTrace via emit records compensation:step trace
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:97:11
       break;
     }
     case "compensation:step": {
-      if (state.trace.compensationTrace) {
+      if (false) {
         state.trace.compensationTrace.steps.push({
           stepName: event.stepName,
killedBy: events: recordTrace edge cases compensation:step with success=true sets status to 'completed'
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ArithmeticOperator
src/runtime/events.ts:102:22
           stepName: event.stepName,
           stepIndex: event.stepIndex,
           status: event.success ? "completed" : "failed",
-          startedAt: event.timestamp - event.durationMs,
+          startedAt: event.timestamp + event.durationMs,
           completedAt: event.timestamp,
           durationMs: event.durationMs,
killedBy: events.ts: recordTrace deep mutants compensation:step trace startedAt = timestamp - durationMs, not timestamp + durationMs
statusReason: expected 3100 to be 3000 // Object.is equality

[Killed] BlockStatement
src/runtime/events.ts:107:29
           durationMs: event.durationMs,
           error: event.error,
         });
-        if (!event.success) {
-          state.trace.compensationTrace.status = "failed";
-        }
+        if (!event.success) {}
       }
       break;
killedBy: events: recordTrace via emit sets compensation:step status to failed when success is false
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Killed] BooleanLiteral
src/runtime/events.ts:107:13
           durationMs: event.durationMs,
           error: event.error,
         });
-        if (!event.success) {
+        if (event.success) {
           state.trace.compensationTrace.status = "failed";
         }
killedBy: events: recordTrace edge cases compensation:step with success=false sets status to 'failed' and overall status
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Survived] ConditionalExpression
src/runtime/events.ts:113:5
       }
       break;
     }
-    case "compensation:completed": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.completedAt = event.timestamp;
-        state.trace.compensationTrace.totalDurationMs = event.totalDurationMs;
-      }
-      break;
-    }
+    case "compensation:completed":
     case "compensation:failed": {
       if (state.trace.compensationTrace) {

[Survived] BlockStatement
src/runtime/events.ts:113:36
       }
       break;
     }
-    case "compensation:completed": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.completedAt = event.timestamp;
-        state.trace.compensationTrace.totalDurationMs = event.totalDurationMs;
-      }
-      break;
-    }
+    case "compensation:completed": {}
     case "compensation:failed": {
       if (state.trace.compensationTrace) {

[Killed] ConditionalExpression
src/runtime/events.ts:114:11
       break;
     }
     case "compensation:completed": {
-      if (state.trace.compensationTrace) {
+      if (false) {
         state.trace.compensationTrace.completedAt = event.timestamp;
         state.trace.compensationTrace.totalDurationMs = event.totalDurationMs;
killedBy: events: recordTrace edge cases compensation:completed updates completedAt and totalDurationMs
statusReason: expected 1000 to be 1250 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:114:11
       break;
     }
     case "compensation:completed": {
-      if (state.trace.compensationTrace) {
+      if (true) {
         state.trace.compensationTrace.completedAt = event.timestamp;
         state.trace.compensationTrace.totalDurationMs = event.totalDurationMs;
killedBy: events: recordTrace edge cases compensation:completed without prior compensation:started does not crash
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of u…' was thrown

[Killed] ConditionalExpression
src/runtime/events.ts:120:5
       }
       break;
     }
-    case "compensation:failed": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.status = "failed";
-        state.trace.compensationTrace.completedAt = event.timestamp;
-        state.trace.compensationTrace.totalDurationMs =
-          event.timestamp - state.trace.compensationTrace.startedAt;
-      }
-      break;
-    }
+    case "compensation:failed":
   }
 }
killedBy: events: recordTrace edge cases compensation:failed sets status to 'failed' and calculates totalDurationMs from startedAt
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/runtime/events.ts:120:33
       }
       break;
     }
-    case "compensation:failed": {
-      if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.status = "failed";
-        state.trace.compensationTrace.completedAt = event.timestamp;
-        state.trace.compensationTrace.totalDurationMs =
-          event.timestamp - state.trace.compensationTrace.startedAt;
-      }
-      break;
-    }
+    case "compensation:failed": {}
   }
 }
killedBy: events: recordTrace edge cases compensation:failed sets status to 'failed' and calculates totalDurationMs from startedAt
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:121:11
       break;
     }
     case "compensation:failed": {
-      if (state.trace.compensationTrace) {
+      if (false) {
         state.trace.compensationTrace.status = "failed";
         state.trace.compensationTrace.completedAt = event.timestamp;
killedBy: events: recordTrace edge cases compensation:failed sets status to 'failed' and calculates totalDurationMs from startedAt
statusReason: expected 'completed' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:121:11
       break;
     }
     case "compensation:failed": {
-      if (state.trace.compensationTrace) {
+      if (true) {
         state.trace.compensationTrace.status = "failed";
         state.trace.compensationTrace.completedAt = event.timestamp;
killedBy: events: recordTrace edge cases compensation:failed without prior compensation:started does not crash
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot set properties of u…' was thrown

[Killed] StringLiteral
src/runtime/events.ts:122:48
     }
     case "compensation:failed": {
       if (state.trace.compensationTrace) {
-        state.trace.compensationTrace.status = "failed";
+        state.trace.compensationTrace.status = "";
         state.trace.compensationTrace.completedAt = event.timestamp;
         state.trace.compensationTrace.totalDurationMs =
killedBy: events: recordTrace edge cases compensation:failed sets status to 'failed' and calculates totalDurationMs from startedAt
statusReason: expected '' to be 'failed' // Object.is equality

[Killed] ArithmeticOperator
src/runtime/events.ts:125:11
         state.trace.compensationTrace.status = "failed";
         state.trace.compensationTrace.completedAt = event.timestamp;
         state.trace.compensationTrace.totalDurationMs =
-          event.timestamp - state.trace.compensationTrace.startedAt;
+          event.timestamp + state.trace.compensationTrace.startedAt;
       }
       break;
killedBy: events: recordTrace edge cases compensation:failed sets status to 'failed' and calculates totalDurationMs from startedAt
statusReason: expected 4300 to be 300 // Object.is equality

[Killed] ConditionalExpression
src/runtime/events.ts:137:84
 // =============================================================================
 
 export function buildExecutionTrace(state: ExecutionState): ExecutionTrace {
-  const completedAt = state.status === "completed" || state.status === "failed" || state.status === "cancelled"
+  const completedAt = state.status === "completed" || state.status === "failed" || false
     ? Date.now()
     : undefined;
killedBy: events: buildExecutionTrace comprehensive cancelled status returns numeric completedAt
statusReason: expected undefined to be type of 'number'

[Killed] EqualityOperator
src/runtime/events.ts:137:55
 // =============================================================================
 
 export function buildExecutionTrace(state: ExecutionState): ExecutionTrace {
-  const completedAt = state.status === "completed" || state.status === "failed" || state.status === "cancelled"
+  const completedAt = state.status === "completed" || state.status !== "failed" || state.status === "cancelled"
     ? Date.now()
     : undefined;
killedBy: events: buildExecutionTrace comprehensive compensating status returns status 'compensating'
statusReason: expected 1770595483927 to be undefined

[Killed] ConditionalExpression
src/runtime/events.ts:140:27
   const completedAt = state.status === "completed" || state.status === "failed" || state.status === "cancelled"
     ? Date.now()
     : undefined;
-  const totalDurationMs = completedAt !== undefined
+  const totalDurationMs = true
     ? completedAt - state.sagaStartTime
     : undefined;
killedBy: events: buildExecutionTrace comprehensive compensating status returns status 'compensating'
statusReason: expected NaN to be undefined

[Killed] EqualityOperator
src/runtime/events.ts:140:27
   const completedAt = state.status === "completed" || state.status === "failed" || state.status === "cancelled"
     ? Date.now()
     : undefined;
-  const totalDurationMs = completedAt !== undefined
+  const totalDurationMs = completedAt === undefined
     ? completedAt - state.sagaStartTime
     : undefined;
killedBy: events: buildExecutionTrace comprehensive compensating status returns status 'compensating'
statusReason: expected NaN to be undefined

[Survived] ArithmeticOperator
src/runtime/events.ts:141:7
     ? Date.now()
     : undefined;
   const totalDurationMs = completedAt !== undefined
-    ? completedAt - state.sagaStartTime
+    ? completedAt + state.sagaStartTime
     : undefined;
 

[Killed] ConditionalExpression
src/runtime/events.ts:148:13
     executionId: state.executionId,
     sagaName: state.sagaName,
     input: state.input,
-    status: state.status === "running" ? "running" : state.status,
+    status: true ? "running" : state.status,
     steps: Object.freeze(state.trace.stepTraces.map(s => Object.freeze({ ...s }))),
     compensation: state.trace.compensationTrace
killedBy: events: buildExecutionTrace comprehensive compensating status returns status 'compensating'
statusReason: expected 'running' to be 'compensating' // Object.is equality

[Killed] EqualityOperator
src/runtime/events.ts:148:13
     executionId: state.executionId,
     sagaName: state.sagaName,
     input: state.input,
-    status: state.status === "running" ? "running" : state.status,
+    status: state.status !== "running" ? "running" : state.status,
     steps: Object.freeze(state.trace.stepTraces.map(s => Object.freeze({ ...s }))),
     compensation: state.trace.compensationTrace
killedBy: events: buildExecutionTrace comprehensive compensating status returns status 'compensating'
statusReason: expected 'running' to be 'compensating' // Object.is equality

[Killed] ArrowFunction
src/runtime/events.ts:149:53
     sagaName: state.sagaName,
     input: state.input,
     status: state.status === "running" ? "running" : state.status,
-    steps: Object.freeze(state.trace.stepTraces.map(s => Object.freeze({ ...s }))),
+    steps: Object.freeze(state.trace.stepTraces.map(() => undefined)),
     compensation: state.trace.compensationTrace
       ? Object.freeze({
killedBy: integration: trace via getTrace getTrace returns full trace for completed saga
statusReason: Cannot read properties of undefined (reading 'stepName')

[Killed] ObjectLiteral
src/runtime/events.ts:149:72
     sagaName: state.sagaName,
     input: state.input,
     status: state.status === "running" ? "running" : state.status,
-    steps: Object.freeze(state.trace.stepTraces.map(s => Object.freeze({ ...s }))),
+    steps: Object.freeze(state.trace.stepTraces.map(s => Object.freeze({}))),
     compensation: state.trace.compensationTrace
       ? Object.freeze({
killedBy: SagaRunner getTrace records step traces with timing information
statusReason: expected undefined to be truthy
