[Killed] ArrowFunction
src/runtime/events.ts:154:72
       ? Object.freeze({
           triggeredBy: state.trace.compensationTrace.triggeredBy,
           triggeredByIndex: state.trace.compensationTrace.triggeredByIndex,
-          steps: Object.freeze(state.trace.compensationTrace.steps.map(s => Object.freeze({ ...s }))),
+          steps: Object.freeze(state.trace.compensationTrace.steps.map(() => undefined)),
           status: state.trace.compensationTrace.status,
           startedAt: state.trace.compensationTrace.startedAt,
killedBy: getTrace and getStatus getTrace includes compensation trace when steps are compensated
statusReason: Cannot read properties of undefined (reading 'stepName')

[Killed] ObjectLiteral
src/runtime/events.ts:154:91
       ? Object.freeze({
           triggeredBy: state.trace.compensationTrace.triggeredBy,
           triggeredByIndex: state.trace.compensationTrace.triggeredByIndex,
-          steps: Object.freeze(state.trace.compensationTrace.steps.map(s => Object.freeze({ ...s }))),
+          steps: Object.freeze(state.trace.compensationTrace.steps.map(s => Object.freeze({}))),
           status: state.trace.compensationTrace.status,
           startedAt: state.trace.compensationTrace.startedAt,
killedBy: events: buildExecutionTrace comprehensive trace includes compensation when compensationTrace is present
statusReason: expected undefined to be 'CompS' // Object.is equality
