[Killed] BlockStatement
src/runtime/id.ts:15:47
  * Generate a unique execution ID.
  * Uses a combination of timestamp and counter for uniqueness.
  */
-export function generateExecutionId(): string {
-  counter += 1;
-  return `exec-${Date.now()}-${counter.toString(36)}`;
-}
+export function generateExecutionId(): string {}
 
killedBy: SagaRunner successful execution executes all steps sequentially and returns output
statusReason: expected undefined to be truthy

[Killed] AssignmentOperator
src/runtime/id.ts:16:3
  * Uses a combination of timestamp and counter for uniqueness.
  */
 export function generateExecutionId(): string {
-  counter += 1;
+  counter -= 1;
   return `exec-${Date.now()}-${counter.toString(36)}`;
 }
killedBy: runtime/id.ts mutation killers generates IDs with exec- prefix and timestamp
statusReason: expected 4 to be 3 // Object.is equality
