[Killed] BlockStatement
src/step/builder-bridges.ts:60:9
 export function setInvokeMapper(
   state: BuilderState<string>,
   mapper: (ctx: StepContext<unknown, unknown>) => unknown,
-): void {
-  state.invokeMapper = mapper;
-}
+): void {}
 
 /**
killedBy: retry config with partial properties (optional chaining mutants) retries correctly when retryConfig has maxAttempts but NO retryIf property
statusReason: step.invoke is not a function

[Killed] BlockStatement
src/step/builder-bridges.ts:74:9
 export function setCompensateMapper(
   state: BuilderState<string>,
   mapper: (ctx: CompensationContext<unknown, unknown, unknown, unknown>) => unknown,
-): void {
-  state.compensateMapper = mapper;
-}
+): void {}
 
 /**
killedBy: event field precision — deferred step captures all events saga:failed with compensation success — deferred step for full event capture
statusReason: expected [] to deeply equal [ 'CompEvtS1' ]

[Killed] BlockStatement
src/step/builder-bridges.ts:88:9
 export function setConditionPredicate(
   state: BuilderState<string>,
   predicate: (ctx: StepContext<unknown, unknown>) => boolean,
-): void {
-  state.conditionPredicate = predicate;
-}
+): void {}
 
 // =============================================================================
killedBy: string literal mutations — event type names step:skipped event has non-empty stepName and reason
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/step/builder-bridges.ts:106:48
 ): (attempt: number, error: unknown) => number;
 export function widenDelayFn(
   delay: (attempt: number, error: unknown) => number,
-): (attempt: number, error: unknown) => number {
-  return delay;
-}
+): (attempt: number, error: unknown) => number {}
 
 /**
killedBy: SagaRunner (DOD 6) function-typed delay in retry delay function receives attempt number → retries correctly
statusReason: expected "vi.fn()" to be called with arguments: [ 1, Anything ]

Number of calls: 0

[Killed] BlockStatement
src/step/builder-bridges.ts:118:32
 ): (error: unknown) => boolean;
 export function widenRetryIfFn(
   retryIf: (error: unknown) => boolean,
-): (error: unknown) => boolean {
-  return retryIf;
-}
+): (error: unknown) => boolean {}
 
 // =============================================================================
killedBy: step/builder.ts mutation killers retry with retryIf function preserves it after widening
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/step/builder-bridges.ts:136:33
 ): TPort;
 export function getPort(
   state: BuilderState<string>,
-): Port<unknown, string> | null {
-  return state.port;
-}
+): Port<unknown, string> | null {}
 
 // =============================================================================
killedBy: step/builder-bridges.ts mutation killers getPort returns null when port is not set on state
statusReason: expected undefined to be null

[Killed] BlockStatement
src/step/builder-bridges.ts:159:11
 ): StepDefinition<TName, TInput, unknown, TOutput, TError, TPort>;
 export function buildStepDefinition<TName extends string>(
   state: BuilderState<TName>,
-): object {
-  return Object.freeze({
-    name: state.name,
-    port: state.port,
-    invoke: state.invokeMapper,
-    compensate: state.compensateMapper,
-    condition: state.conditionPredicate,
-    options: Object.freeze({ ...state.optionsBag }),
-  });
-}
+): object {}
 
killedBy: buildSagaStatus — exact field assertions running status has all correct fields
statusReason: Cannot read properties of undefined (reading 'condition')

[Killed] ObjectLiteral
src/step/builder-bridges.ts:166:28
     invoke: state.invokeMapper,
     compensate: state.compensateMapper,
     condition: state.conditionPredicate,
-    options: Object.freeze({ ...state.optionsBag }),
+    options: Object.freeze({}),
   });
 }
killedBy: event field precision — deferred step captures all events step:failed event has attemptCount = maxAttempts+1 for retry steps
statusReason: expected 1 to be 3 // Object.is equality
