[Survived] StringLiteral
src/integration/library-inspector-port.ts:20:9
  * Library Inspector Protocol.
  */
 export const SagaLibraryInspectorPort = createLibraryInspectorPort({
-  name: "SagaLibraryInspector",
+  name: "",
   description: "Library inspector bridge for saga orchestration",
 });

[Survived] StringLiteral
src/integration/library-inspector-port.ts:21:16
  */
 export const SagaLibraryInspectorPort = createLibraryInspectorPort({
   name: "SagaLibraryInspector",
-  description: "Library inspector bridge for saga orchestration",
+  description: "",
 });
 
