[Killed] BlockStatement
src/reactivity/system-factory.ts:96:67
 // Type Guards
 // =============================================================================
 
-function isComputedNode(node: ReactiveNode): node is ComputedNode {
-  return "getter" in node;
-}
+function isComputedNode(node: ReactiveNode): node is ComputedNode {}
 
 function isSignalNode(node: ReactiveNode): node is SignalNode {
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Killed] StringLiteral
src/reactivity/system-factory.ts:97:10
 // =============================================================================
 
 function isComputedNode(node: ReactiveNode): node is ComputedNode {
-  return "getter" in node;
+  return "" in node;
 }
 
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Killed] BlockStatement
src/reactivity/system-factory.ts:100:63
   return "getter" in node;
 }
 
-function isSignalNode(node: ReactiveNode): node is SignalNode {
-  return "currentValue" in node;
-}
+function isSignalNode(node: ReactiveNode): node is SignalNode {}
 
 function isEffectNode(node: ReactiveNode): node is EffectNode {
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/reactivity/system-factory.ts:104:63
   return "currentValue" in node;
 }
 
-function isEffectNode(node: ReactiveNode): node is EffectNode {
-  return "fn" in node;
-}
+function isEffectNode(node: ReactiveNode): node is EffectNode {}
 
 // =============================================================================
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] StringLiteral
src/reactivity/system-factory.ts:105:10
 }
 
 function isEffectNode(node: ReactiveNode): node is EffectNode {
-  return "fn" in node;
+  return "" in node;
 }
 
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/reactivity/system-factory.ts:130:41
 
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
-    update(node: ReactiveNode): boolean {
-      if (isComputedNode(node)) {
-        return updateComputed(node);
-      }
-      if (isSignalNode(node)) {
-        return updateSignal(node);
-      }
-      return false;
-    },
+    update(node: ReactiveNode): boolean {},
     notify(effectNode: ReactiveNode): void {
       if (!isEffectNode(effectNode)) return;
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:131:11
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
     update(node: ReactiveNode): boolean {
-      if (isComputedNode(node)) {
+      if (true) {
         return updateComputed(node);
       }
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/reactivity/system-factory.ts:131:33
   // Create the low-level reactive system from alien-signals/system
   const { link, unlink, propagate, checkDirty, shallowPropagate } = createReactiveSystem({
     update(node: ReactiveNode): boolean {
-      if (isComputedNode(node)) {
-        return updateComputed(node);
-      }
+      if (isComputedNode(node)) {}
       if (isSignalNode(node)) {
         return updateSignal(node);
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Killed] BlockStatement
src/reactivity/system-factory.ts:134:31
       if (isComputedNode(node)) {
         return updateComputed(node);
       }
-      if (isSignalNode(node)) {
-        return updateSignal(node);
-      }
+      if (isSignalNode(node)) {}
       return false;
     },
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:134:11
       if (isComputedNode(node)) {
         return updateComputed(node);
       }
-      if (isSignalNode(node)) {
+      if (false) {
         return updateSignal(node);
       }
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:139:44
       }
       return false;
     },
-    notify(effectNode: ReactiveNode): void {
-      if (!isEffectNode(effectNode)) return;
-      const e = effectNode;
-      let insertIndex = queuedLength;
-      const firstInsertedIndex = insertIndex;
-      let current: EffectNode | undefined = e;
-      for (;;) {
-        queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
-        const nextSub: ReactiveNode | undefined = current.subs?.sub;
-        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
-          break;
-        }
-        current = nextSub;
-      }
-      queuedLength = insertIndex;
-      let lo = firstInsertedIndex;
-      let hi = insertIndex - 1;
-      while (lo < hi) {
-        const left = queued[lo];
-        queued[lo++] = queued[hi];
-        queued[hi--] = left;
-      }
-    },
+    notify(effectNode: ReactiveNode): void {},
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BooleanLiteral
src/reactivity/system-factory.ts:140:11
       return false;
     },
     notify(effectNode: ReactiveNode): void {
-      if (!isEffectNode(effectNode)) return;
+      if (isEffectNode(effectNode)) return;
       const e = effectNode;
       let insertIndex = queuedLength;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:140:11
       return false;
     },
     notify(effectNode: ReactiveNode): void {
-      if (!isEffectNode(effectNode)) return;
+      if (true) return;
       const e = effectNode;
       let insertIndex = queuedLength;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:145:7
       let insertIndex = queuedLength;
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
-      for (;;) {
-        queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
-        const nextSub: ReactiveNode | undefined = current.subs?.sub;
-        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
-          break;
-        }
-        current = nextSub;
-      }
+      for (; false;) {
+  queued[insertIndex++] = current;
+  current.flags &= ~WATCHING;
+  const nextSub: ReactiveNode | undefined = current.subs?.sub;
+  if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
+    break;
+  }
+  current = nextSub;
+}
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Timeout] BlockStatement
src/reactivity/system-factory.ts:145:16
       let insertIndex = queuedLength;
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
-      for (;;) {
-        queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
-        const nextSub: ReactiveNode | undefined = current.subs?.sub;
-        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
-          break;
-        }
-        current = nextSub;
-      }
+      for (;;) {}
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;

[Killed] UpdateOperator
src/reactivity/system-factory.ts:146:16
       const firstInsertedIndex = insertIndex;
       let current: EffectNode | undefined = e;
       for (;;) {
-        queued[insertIndex++] = current;
+        queued[insertIndex--] = current;
         current.flags &= ~WATCHING;
         const nextSub: ReactiveNode | undefined = current.subs?.sub;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] UnaryOperator
src/reactivity/system-factory.ts:147:26
       let current: EffectNode | undefined = e;
       for (;;) {
         queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
+        current.flags &= WATCHING;
         const nextSub: ReactiveNode | undefined = current.subs?.sub;
         if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Survived] AssignmentOperator
src/reactivity/system-factory.ts:147:9
       let current: EffectNode | undefined = e;
       for (;;) {
         queued[insertIndex++] = current;
-        current.flags &= ~WATCHING;
+        current.flags |= ~WATCHING;
         const nextSub: ReactiveNode | undefined = current.subs?.sub;
         if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {

[Killed] OptionalChaining
src/reactivity/system-factory.ts:148:51
       for (;;) {
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
-        const nextSub: ReactiveNode | undefined = current.subs?.sub;
+        const nextSub: ReactiveNode | undefined = current.subs.sub;
         if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
           break;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] BlockStatement
src/reactivity/system-factory.ts:149:93
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
         const nextSub: ReactiveNode | undefined = current.subs?.sub;
-        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
-          break;
-        }
+        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {}
         current = nextSub;
       }
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: Cannot read properties of undefined (reading 'flags')

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:149:13
         queued[insertIndex++] = current;
         current.flags &= ~WATCHING;
         const nextSub: ReactiveNode | undefined = current.subs?.sub;
-        if (nextSub === undefined || !isEffectNode(nextSub) || !(nextSub.flags & WATCHING)) {
+        if (false) {
           break;
         }
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: Cannot read properties of undefined (reading 'flags')

[Killed] ArithmeticOperator
src/reactivity/system-factory.ts:156:16
       }
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;
-      let hi = insertIndex - 1;
+      let hi = insertIndex + 1;
       while (lo < hi) {
         const left = queued[lo];
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Survived] EqualityOperator
src/reactivity/system-factory.ts:157:14
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;
       let hi = insertIndex - 1;
-      while (lo < hi) {
+      while (lo <= hi) {
         const left = queued[lo];
         queued[lo++] = queued[hi];

[Timeout] EqualityOperator
src/reactivity/system-factory.ts:157:14
       queuedLength = insertIndex;
       let lo = firstInsertedIndex;
       let hi = insertIndex - 1;
-      while (lo < hi) {
+      while (lo >= hi) {
         const left = queued[lo];
         queued[lo++] = queued[hi];

[NoCoverage] UpdateOperator
src/reactivity/system-factory.ts:159:16
       let hi = insertIndex - 1;
       while (lo < hi) {
         const left = queued[lo];
-        queued[lo++] = queued[hi];
+        queued[lo--] = queued[hi];
         queued[hi--] = left;
       }

[NoCoverage] UpdateOperator
src/reactivity/system-factory.ts:160:16
       while (lo < hi) {
         const left = queued[lo];
         queued[lo++] = queued[hi];
-        queued[hi--] = left;
+        queued[hi++] = left;
       }
     },

[Survived] BlockStatement
src/reactivity/system-factory.ts:163:41
         queued[hi--] = left;
       }
     },
-    unwatched(node: ReactiveNode): void {
-      if (!(node.flags & MUTABLE)) {
-        effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
-        node.depsTail = undefined;
-        node.flags = MUTABLE | DIRTY;
-        purgeDeps(node);
-      }
-    },
+    unwatched(node: ReactiveNode): void {},
   });
 

[NoCoverage] BlockStatement
src/reactivity/system-factory.ts:164:36
       }
     },
     unwatched(node: ReactiveNode): void {
-      if (!(node.flags & MUTABLE)) {
-        effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
+      if (!(node.flags & MUTABLE)) {} else if (node.depsTail !== undefined) {
         node.depsTail = undefined;
         node.flags = MUTABLE | DIRTY;

[Survived] ConditionalExpression
src/reactivity/system-factory.ts:164:11
       }
     },
     unwatched(node: ReactiveNode): void {
-      if (!(node.flags & MUTABLE)) {
+      if (true) {
         effectScopeOper(node);
       } else if (node.depsTail !== undefined) {

[Survived] ConditionalExpression
src/reactivity/system-factory.ts:166:18
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
         effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
+      } else if (true) {
         node.depsTail = undefined;
         node.flags = MUTABLE | DIRTY;

[Survived] ConditionalExpression
src/reactivity/system-factory.ts:166:18
     unwatched(node: ReactiveNode): void {
       if (!(node.flags & MUTABLE)) {
         effectScopeOper(node);
-      } else if (node.depsTail !== undefined) {
+      } else if (false) {
         node.depsTail = undefined;
         node.flags = MUTABLE | DIRTY;

[Killed] BlockStatement
src/reactivity/system-factory.ts:178:53
   // Internal helpers (ported from alien-signals index.mjs)
   // =========================================================================
 
-  function updateComputed(c: ComputedNode): boolean {
-    ++cycle;
-    c.depsTail = undefined;
-    c.flags = MUTABLE | RECURSED_CHECK;
-    const prevSub = activeSub;
-    activeSub = c;
-    try {
-      const oldValue = c.value;
-      return oldValue !== (c.value = c.getter(oldValue));
-    } finally {
-      activeSub = prevSub;
-      c.flags &= ~RECURSED_CHECK;
-      purgeDeps(c);
-    }
-  }
+  function updateComputed(c: ComputedNode): boolean {}
 
   function updateSignal(s: SignalNode): boolean {
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Survived] UpdateOperator
src/reactivity/system-factory.ts:179:5
   // =========================================================================
 
   function updateComputed(c: ComputedNode): boolean {
-    ++cycle;
+    --cycle;
     c.depsTail = undefined;
     c.flags = MUTABLE | RECURSED_CHECK;

[Killed] BlockStatement
src/reactivity/system-factory.ts:184:9
     c.flags = MUTABLE | RECURSED_CHECK;
     const prevSub = activeSub;
     activeSub = c;
-    try {
-      const oldValue = c.value;
-      return oldValue !== (c.value = c.getter(oldValue));
-    } finally {
+    try {} finally {
       activeSub = prevSub;
       c.flags &= ~RECURSED_CHECK;
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:186:14
     activeSub = c;
     try {
       const oldValue = c.value;
-      return oldValue !== (c.value = c.getter(oldValue));
+      return true;
     } finally {
       activeSub = prevSub;
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:186:14
     activeSub = c;
     try {
       const oldValue = c.value;
-      return oldValue !== (c.value = c.getter(oldValue));
+      return false;
     } finally {
       activeSub = prevSub;
killedBy: DerivedService -- tracing hooks (mutation killers) unsubscribe removes correct effect (subscribe twice, unsub first)
statusReason: expected [] to include 20

[Survived] BlockStatement
src/reactivity/system-factory.ts:187:15
     try {
       const oldValue = c.value;
       return oldValue !== (c.value = c.getter(oldValue));
-    } finally {
-      activeSub = prevSub;
-      c.flags &= ~RECURSED_CHECK;
-      purgeDeps(c);
-    }
+    } finally {}
   }
 

[Killed] AssignmentOperator
src/reactivity/system-factory.ts:189:7
       return oldValue !== (c.value = c.getter(oldValue));
     } finally {
       activeSub = prevSub;
-      c.flags &= ~RECURSED_CHECK;
+      c.flags |= ~RECURSED_CHECK;
       purgeDeps(c);
     }
killedBy: LinkedDerivedService -- unsubscribe (mutation killers) subscribe and unsub first leaves second intact with changes
statusReason: expected [ 10 ] to include 20

[Killed] UnaryOperator
src/reactivity/system-factory.ts:189:18
       return oldValue !== (c.value = c.getter(oldValue));
     } finally {
       activeSub = prevSub;
-      c.flags &= ~RECURSED_CHECK;
+      c.flags &= RECURSED_CHECK;
       purgeDeps(c);
     }
killedBy: LinkedDerivedService -- unsubscribe (mutation killers) subscribe and unsub first leaves second intact with changes
statusReason: expected [ 10 ] to include 20

[Killed] BlockStatement
src/reactivity/system-factory.ts:194:49
     }
   }
 
-  function updateSignal(s: SignalNode): boolean {
-    s.flags = MUTABLE;
-    return s.currentValue !== (s.currentValue = s.pendingValue);
-  }
+  function updateSignal(s: SignalNode): boolean {}
 
   function run(e: EffectNode): void {
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:196:12
 
   function updateSignal(s: SignalNode): boolean {
     s.flags = MUTABLE;
-    return s.currentValue !== (s.currentValue = s.pendingValue);
+    return false;
   }
 
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/reactivity/system-factory.ts:196:12
 
   function updateSignal(s: SignalNode): boolean {
     s.flags = MUTABLE;
-    return s.currentValue !== (s.currentValue = s.pendingValue);
+    return s.currentValue === (s.currentValue = s.pendingValue);
   }
 
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/reactivity/system-factory.ts:199:37
     return s.currentValue !== (s.currentValue = s.pendingValue);
   }
 
-  function run(e: EffectNode): void {
-    const flags = e.flags;
-    if (
-      flags & DIRTY ||
-      (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
-    ) {
-      ++cycle;
-      e.depsTail = undefined;
-      e.flags = WATCHING | RECURSED_CHECK;
-      const prevSub = activeSub;
-      activeSub = e;
-      try {
-        e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-        purgeDeps(e);
-      }
-    } else {
-      e.flags = WATCHING;
-    }
-  }
+  function run(e: EffectNode): void {}
 
   function flush(): void {
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] LogicalOperator
src/reactivity/system-factory.ts:202:7
   function run(e: EffectNode): void {
     const flags = e.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
+      flags & DIRTY && flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e)
     ) {
       ++cycle;
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:202:7
   function run(e: EffectNode): void {
     const flags = e.flags;
     if (
-      flags & DIRTY ||
-      (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
+      false
     ) {
       ++cycle;
killedBy: AsyncDerivedService -- tracing hooks (mutation killers) unsubscribe correctly removes effect -- subscribe twice, unsub first, second still works
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/reactivity/system-factory.ts:203:27
     const flags = e.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
+      (flags & PENDING && e.deps === undefined && checkDirty(e.deps, e))
     ) {
       ++cycle;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:203:8
     const flags = e.flags;
     if (
       flags & DIRTY ||
-      (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
+      (false)
     ) {
       ++cycle;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:204:7
     if (
       flags & DIRTY ||
       (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
-    ) {
-      ++cycle;
-      e.depsTail = undefined;
-      e.flags = WATCHING | RECURSED_CHECK;
-      const prevSub = activeSub;
-      activeSub = e;
-      try {
-        e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-        purgeDeps(e);
-      }
-    } else {
+    ) {} else {
       e.flags = WATCHING;
     }
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Survived] UpdateOperator
src/reactivity/system-factory.ts:205:7
       flags & DIRTY ||
       (flags & PENDING && e.deps !== undefined && checkDirty(e.deps, e))
     ) {
-      ++cycle;
+      --cycle;
       e.depsTail = undefined;
       e.flags = WATCHING | RECURSED_CHECK;

[Killed] BlockStatement
src/reactivity/system-factory.ts:210:11
       e.flags = WATCHING | RECURSED_CHECK;
       const prevSub = activeSub;
       activeSub = e;
-      try {
-        e.fn();
-      } finally {
+      try {} finally {
         activeSub = prevSub;
         e.flags &= ~RECURSED_CHECK;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:212:17
       activeSub = e;
       try {
         e.fn();
-      } finally {
-        activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
-        purgeDeps(e);
-      }
+      } finally {}
     } else {
       e.flags = WATCHING;
killedBy: StateService — targeted mutation killers selector subscribe: hasPathChanged condition governs re-notification
statusReason: expected [] to include 42

[Killed] AssignmentOperator
src/reactivity/system-factory.ts:214:9
         e.fn();
       } finally {
         activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
+        e.flags |= ~RECURSED_CHECK;
         purgeDeps(e);
       }
killedBy: StateService — targeted mutation killers selector subscribe: hasPathChanged condition governs re-notification
statusReason: expected [] to include 42

[Killed] UnaryOperator
src/reactivity/system-factory.ts:214:20
         e.fn();
       } finally {
         activeSub = prevSub;
-        e.flags &= ~RECURSED_CHECK;
+        e.flags &= RECURSED_CHECK;
         purgeDeps(e);
       }
killedBy: StateService — targeted mutation killers selector subscribe: hasPathChanged condition governs re-notification
statusReason: expected [] to include 42

[NoCoverage] BlockStatement
src/reactivity/system-factory.ts:217:12
         e.flags &= ~RECURSED_CHECK;
         purgeDeps(e);
       }
-    } else {
-      e.flags = WATCHING;
-    }
+    } else {}
   }
 

[Killed] BlockStatement
src/reactivity/system-factory.ts:222:26
     }
   }
 
-  function flush(): void {
-    try {
-      while (notifyIndex < queuedLength) {
-        const eff = queued[notifyIndex];
-        queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
-          run(eff);
-        }
-      }
-    } finally {
-      while (notifyIndex < queuedLength) {
-        const eff = queued[notifyIndex];
-        queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
-          eff.flags |= WATCHING | 8; // WATCHING | RECURSED
-        }
-      }
-      notifyIndex = 0;
-      queuedLength = 0;
-    }
-  }
+  function flush(): void {}
 
   function purgeDeps(sub: ReactiveNode): void {
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] BlockStatement
src/reactivity/system-factory.ts:223:9
   }
 
   function flush(): void {
-    try {
-      while (notifyIndex < queuedLength) {
-        const eff = queued[notifyIndex];
-        queued[notifyIndex++] = undefined;
-        if (eff !== undefined) {
-          run(eff);
-        }
-      }
-    } finally {
+    try {} finally {
       while (notifyIndex < queuedLength) {
         const eff = queued[notifyIndex];
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/system-factory.ts:224:14
 
   function flush(): void {
     try {
-      while (notifyIndex < queuedLength) {
+      while (false) {
         const eff = queued[notifyIndex];
         queued[notifyIndex++] = undefined;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] EqualityOperator
src/reactivity/system-factory.ts:224:14
 
   function flush(): void {
     try {
-      while (notifyIndex < queuedLength) {
+      while (notifyIndex >= queuedLength) {
         const eff = queued[notifyIndex];
         queued[notifyIndex++] = undefined;
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Timeout] UpdateOperator
src/reactivity/system-factory.ts:226:16
     try {
       while (notifyIndex < queuedLength) {
         const eff = queued[notifyIndex];
-        queued[notifyIndex++] = undefined;
+        queued[notifyIndex--] = undefined;
         if (eff !== undefined) {
           run(eff);
