[Killed] BlockStatement
src/adapters/hydration-adapter.ts:33:22
 ): StoreAdapterResult<TName>;
 export function createHydrationAdapter(
   config: CreateHydrationAdapterConfig,
-): AdapterConstraint {
-  return createAdapter({
-    provides: config.provides,
-    requires: [],
-    lifetime: "singleton",
-    factory: (): StateHydrator => ({
-      hydrate(portName: string): ResultAsync<unknown, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => config.storage.get(portName)),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-      dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => {
-            config.storage.set(portName, state);
-          }),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-    }),
-  });
-}
+): AdapterConstraint {}
 
killedBy: createHydrationAdapter creates an adapter that resolves to StateHydrator
statusReason: Cannot read properties of undefined (reading 'provides')

[Killed] ObjectLiteral
src/adapters/hydration-adapter.ts:34:24
 export function createHydrationAdapter(
   config: CreateHydrationAdapterConfig,
 ): AdapterConstraint {
-  return createAdapter({
-    provides: config.provides,
-    requires: [],
-    lifetime: "singleton",
-    factory: (): StateHydrator => ({
-      hydrate(portName: string): ResultAsync<unknown, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => config.storage.get(portName)),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-      dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => {
-            config.storage.set(portName, state);
-          }),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-    }),
-  });
+  return createAdapter({});
 }
 
killedBy: createHydrationAdapter creates an adapter that resolves to StateHydrator
statusReason: ERROR[HEX019]: Invalid adapter config: Must provide either 'factory' or 'class'. Provide a factory function that creates the instance, or a class constructor for dependency injection.

[Killed] StringLiteral
src/adapters/hydration-adapter.ts:37:15
   return createAdapter({
     provides: config.provides,
     requires: [],
-    lifetime: "singleton",
+    lifetime: "",
     factory: (): StateHydrator => ({
       hydrate(portName: string): ResultAsync<unknown, HydrationError> {
killedBy: createHydrationAdapter creates an adapter that resolves to StateHydrator
statusReason: ERROR[HEX015]: Invalid adapter config: 'lifetime' must be "singleton", "scoped", "transient", or "request". Got: "".

[Killed] ArrowFunction
src/adapters/hydration-adapter.ts:38:14
     provides: config.provides,
     requires: [],
     lifetime: "singleton",
-    factory: (): StateHydrator => ({
-      hydrate(portName: string): ResultAsync<unknown, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => config.storage.get(portName)),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-      dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => {
-            config.storage.set(portName, state);
-          }),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
-    }),
+    factory: () => undefined,
   });
 }
killedBy: createHydrationAdapter creates an adapter that resolves to StateHydrator
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/adapters/hydration-adapter.ts:39:71
     requires: [],
     lifetime: "singleton",
     factory: (): StateHydrator => ({
-      hydrate(portName: string): ResultAsync<unknown, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => config.storage.get(portName)),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
+      hydrate(portName: string): ResultAsync<unknown, HydrationError> {},
       dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
         return ResultAsync.fromPromise(
killedBy: createHydrationAdapter dehydrate stores state and hydrate retrieves it
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] ArrowFunction
src/adapters/hydration-adapter.ts:41:34
     factory: (): StateHydrator => ({
       hydrate(portName: string): ResultAsync<unknown, HydrationError> {
         return ResultAsync.fromPromise(
-          Promise.resolve().then(() => config.storage.get(portName)),
+          Promise.resolve().then(() => undefined),
           (cause) => HydrationError({ portName, cause }),
         );
killedBy: createHydrationAdapter dehydrate stores state and hydrate retrieves it
statusReason: expected undefined to deeply equal { count: 42 }

[Killed] ArrowFunction
src/adapters/hydration-adapter.ts:42:11
       hydrate(portName: string): ResultAsync<unknown, HydrationError> {
         return ResultAsync.fromPromise(
           Promise.resolve().then(() => config.storage.get(portName)),
-          (cause) => HydrationError({ portName, cause }),
+          () => undefined,
         );
       },
killedBy: createHydrationAdapter returns HydrationError when storage throws on hydrate
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/adapters/hydration-adapter.ts:45:86
           (cause) => HydrationError({ portName, cause }),
         );
       },
-      dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
-        return ResultAsync.fromPromise(
-          Promise.resolve().then(() => {
-            config.storage.set(portName, state);
-          }),
-          (cause) => HydrationError({ portName, cause }),
-        );
-      },
+      dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {},
     }),
   });
killedBy: createHydrationAdapter dehydrate stores state and hydrate retrieves it
statusReason: Cannot read properties of undefined (reading 'isOk')

[Killed] BlockStatement
src/adapters/hydration-adapter.ts:47:40
       },
       dehydrate(portName: string, state: unknown): ResultAsync<void, HydrationError> {
         return ResultAsync.fromPromise(
-          Promise.resolve().then(() => {
-            config.storage.set(portName, state);
-          }),
+          Promise.resolve().then(() => {}),
           (cause) => HydrationError({ portName, cause }),
         );
killedBy: createHydrationAdapter dehydrate stores state and hydrate retrieves it
statusReason: expected undefined to deeply equal { count: 42 }

[Killed] ArrowFunction
src/adapters/hydration-adapter.ts:50:11
           Promise.resolve().then(() => {
             config.storage.set(portName, state);
           }),
-          (cause) => HydrationError({ portName, cause }),
+          () => undefined,
         );
       },
killedBy: createHydrationAdapter returns HydrationError when storage throws on dehydrate
statusReason: Cannot read properties of undefined (reading '_tag')
