[Killed] LogicalOperator
src/adapters/state-adapter.ts:63:9
     : [];
 
   const requires = [
-    ...(config.requires ?? []),
+    ...(config.requires && []),
     ...inspectionPorts,
   ];
killedBy: Container + GraphBuilder integration state + derived adapters: derived tracks state changes
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] StringLiteral
src/adapters/state-adapter.ts:68:39
   ];
 
   const portName = config.provides.__portName;
-  const lifetime = config.lifetime ?? "singleton";
+  const lifetime = config.lifetime ?? "";
 
   const adp = createAdapter({
killedBy: createStateAdapter creates adapter with brand symbol
statusReason: ERROR[HEX015]: Invalid adapter config: 'lifetime' must be "singleton", "scoped", "transient", or "request". Got: "".

[Killed] EqualityOperator
src/adapters/state-adapter.ts:75:31
     requires,
     lifetime,
     factory: (deps: Record<string, unknown>) => {
-      const resolvedEffects = typeof config.effects === "function"
+      const resolvedEffects = typeof config.effects !== "function"
         ? config.effects(deps)
         : config.effects;
killedBy: state-adapter inspection mutants auto-tracing from deps: tracingHook falls back to deps.StoreTracingHook when inspection=true
statusReason: config.effects is not a function

[Killed] ConditionalExpression
src/adapters/state-adapter.ts:75:31
     requires,
     lifetime,
     factory: (deps: Record<string, unknown>) => {
-      const resolvedEffects = typeof config.effects === "function"
+      const resolvedEffects = true
         ? config.effects(deps)
         : config.effects;
killedBy: Effect adapter wiring via createStateAdapter effects function receives resolved deps and fires on dispatch
statusReason: Factory for port 'Test' threw: config.effects is not a function

[Killed] LogicalOperator
src/adapters/state-adapter.ts:83:27
         ? extractStoreInspectorInternal(deps.StoreInspectorInternal)
         : undefined;
 
-      const tracingHook = config.tracingHook
-        ?? (config.inspection ? extractStoreTracingHook(deps.StoreTracingHook) : undefined);
+      const tracingHook = config.tracingHook && (config.inspection ? extractStoreTracingHook(deps.StoreTracingHook) : undefined);
 
       const service = createStateServiceImpl({
killedBy: state-adapter inspection mutants auto-tracing from deps: tracingHook falls back to deps.StoreTracingHook when inspection=true
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/adapters/state-adapter.ts:99:30
       });
 
       // Auto-register with registry
-      if (config.inspection) {
-        const registry = extractStoreRegistry(deps.StoreRegistry);
-        if (registry) {
-          const requireNames = (config.requires ?? []).map((p) => p.__portName);
-          const branded = { [__stateAdapterBrand]: true };
-          registry.register(buildStateRegistryEntry(portName, service, branded, lifetime, requireNames));
-        }
-      }
+      if (config.inspection) {}
 
       return service;
killedBy: state-adapter inspection mutants inspection=true registers with StoreRegistry, entry has brand and correct portName
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/adapters/state-adapter.ts:101:23
       // Auto-register with registry
       if (config.inspection) {
         const registry = extractStoreRegistry(deps.StoreRegistry);
-        if (registry) {
-          const requireNames = (config.requires ?? []).map((p) => p.__portName);
-          const branded = { [__stateAdapterBrand]: true };
-          registry.register(buildStateRegistryEntry(portName, service, branded, lifetime, requireNames));
-        }
+        if (registry) {}
       }
 
killedBy: state-adapter inspection mutants inspection=true registers with StoreRegistry, entry has brand and correct portName
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/adapters/state-adapter.ts:102:33
       if (config.inspection) {
         const registry = extractStoreRegistry(deps.StoreRegistry);
         if (registry) {
-          const requireNames = (config.requires ?? []).map((p) => p.__portName);
+          const requireNames = (config.requires && []).map((p) => p.__portName);
           const branded = { [__stateAdapterBrand]: true };
           registry.register(buildStateRegistryEntry(portName, service, branded, lifetime, requireNames));
killedBy: Auto-Registration state adapter with inspection: true auto-registers with StoreRegistry
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/adapters/state-adapter.ts:102:60
       if (config.inspection) {
         const registry = extractStoreRegistry(deps.StoreRegistry);
         if (registry) {
-          const requireNames = (config.requires ?? []).map((p) => p.__portName);
+          const requireNames = (config.requires ?? []).map(() => undefined);
           const branded = { [__stateAdapterBrand]: true };
           registry.register(buildStateRegistryEntry(portName, service, branded, lifetime, requireNames));
killedBy: state-adapter inspection mutants inspection registration passes correct requireNames from config.requires
statusReason: expected [ undefined ] to include 'MK7Dep'

[Killed] BooleanLiteral
src/adapters/state-adapter.ts:103:52
         const registry = extractStoreRegistry(deps.StoreRegistry);
         if (registry) {
           const requireNames = (config.requires ?? []).map((p) => p.__portName);
-          const branded = { [__stateAdapterBrand]: true };
+          const branded = { [__stateAdapterBrand]: false };
           registry.register(buildStateRegistryEntry(portName, service, branded, lifetime, requireNames));
         }
killedBy: state-adapter inspection mutants inspection=true registers with StoreRegistry, entry has brand and correct portName
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/adapters/state-adapter.ts:112:52
     },
   });
 
-  const branded = { ...adp, [__stateAdapterBrand]: true };
+  const branded = { ...adp, [__stateAdapterBrand]: false };
   return branded;
 }
killedBy: Adapter brands state adapter has brand = true
statusReason: expected false to be true // Object.is equality
