[Killed] ArrowFunction
src/errors/tagged-errors.ts:20:36
  * Thrown when accessing state/value/actions/subscribe on a disposed service.
  */
 const _DisposedStateAccess = createError("DisposedStateAccess");
-export const DisposedStateAccess = (fields: {
-  readonly portName: string;
-  readonly containerName: string;
-  readonly operation: "state" | "value" | "actions" | "subscribe" | "set" | "update" | "refresh";
-}): DisposedStateAccess =>
-  _DisposedStateAccess({
-    ...fields,
-    code: "DISPOSED_STATE_ACCESS" as const,
-    isProgrammingError: true as const,
-    message: `Cannot access '${fields.operation}' on port '${fields.portName}' from disposed container '${fields.containerName}'.`,
-  });
+export const DisposedStateAccess = () => undefined;
 export type DisposedStateAccess = Readonly<{
   _tag: "DisposedStateAccess";
killedBy: DisposedStateAccess has _tag DisposedStateAccess
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ObjectLiteral
src/errors/tagged-errors.ts:25:24
   readonly containerName: string;
   readonly operation: "state" | "value" | "actions" | "subscribe" | "set" | "update" | "refresh";
 }): DisposedStateAccess =>
-  _DisposedStateAccess({
-    ...fields,
-    code: "DISPOSED_STATE_ACCESS" as const,
-    isProgrammingError: true as const,
-    message: `Cannot access '${fields.operation}' on port '${fields.portName}' from disposed container '${fields.containerName}'.`,
-  });
+  _DisposedStateAccess({});
 export type DisposedStateAccess = Readonly<{
   _tag: "DisposedStateAccess";
killedBy: Bound action disposed operation string calling a stored action reference after dispose: operation is 'actions'
statusReason: expected undefined to be 'actions' // Object.is equality

[Killed] StringLiteral
src/errors/tagged-errors.ts:29:14
     ...fields,
     code: "DISPOSED_STATE_ACCESS" as const,
     isProgrammingError: true as const,
-    message: `Cannot access '${fields.operation}' on port '${fields.portName}' from disposed container '${fields.containerName}'.`,
+    message: ``,
   });
 export type DisposedStateAccess = Readonly<{
killedBy: Error message content DisposedStateAccess message contains operation, portName, containerName
statusReason: expected '' to contain 'subscribe'

[Killed] BlockStatement
src/errors/tagged-errors.ts:48:33
 export const DerivedComputationFailed = (fields: {
   readonly portName: string;
   readonly cause: unknown;
-}): DerivedComputationFailed => {
-  const causeMessage = fields.cause instanceof Error ? fields.cause.message : String(fields.cause);
-  return _DerivedComputationFailed({
-    ...fields,
-    code: "DERIVED_COMPUTATION_FAILED" as const,
-    isProgrammingError: false as const,
-    message: `Derived computation for port '${fields.portName}' failed: ${causeMessage}`,
-  });
-};
+}): DerivedComputationFailed => {};
 export type DerivedComputationFailed = Readonly<{
   _tag: "DerivedComputationFailed";
killedBy: DerivedService extended select() error wraps in DerivedComputationError with correct portName
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/errors/tagged-errors.ts:54:14
     ...fields,
     code: "DERIVED_COMPUTATION_FAILED" as const,
     isProgrammingError: false as const,
-    message: `Derived computation for port '${fields.portName}' failed: ${causeMessage}`,
+    message: ``,
   });
 };
killedBy: Error message content DerivedComputationFailed message contains portName and cause message
statusReason: expected '' to contain 'CartTotal'

[Killed] BlockStatement
src/errors/tagged-errors.ts:75:30
   readonly portName: string;
   readonly attempts: number;
   readonly cause: unknown;
-}): AsyncDerivedExhausted => {
-  const causeMessage = fields.cause instanceof Error ? fields.cause.message : String(fields.cause);
-  return _AsyncDerivedExhausted({
-    ...fields,
-    code: "ASYNC_DERIVED_EXHAUSTED" as const,
-    isProgrammingError: true as const,
-    message:
-      `Async derived port '${fields.portName}' select function threw after ${fields.attempts} attempts` +
-      ` (select should return ResultAsync.err(), not throw): ${causeMessage}`,
-  });
-};
+}): AsyncDerivedExhausted => {};
 export type AsyncDerivedExhausted = Readonly<{
   _tag: "AsyncDerivedExhausted";
killedBy: AsyncDerivedService — _selectThrew flag sync select() throw is detected via _selectThrew and throws AsyncDerivedExhausted
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/errors/tagged-errors.ts:77:33
   readonly cause: unknown;
 }): AsyncDerivedExhausted => {
   const causeMessage = fields.cause instanceof Error ? fields.cause.message : String(fields.cause);
-  return _AsyncDerivedExhausted({
-    ...fields,
-    code: "ASYNC_DERIVED_EXHAUSTED" as const,
-    isProgrammingError: true as const,
-    message:
-      `Async derived port '${fields.portName}' select function threw after ${fields.attempts} attempts` +
-      ` (select should return ResultAsync.err(), not throw): ${causeMessage}`,
-  });
+  return _AsyncDerivedExhausted({});
 };
 export type AsyncDerivedExhausted = Readonly<{
killedBy: AsyncDerivedService extended select() that throws synchronously → AsyncDerivedExhaustedError fields are correct
statusReason: expected undefined to be 'Broken' // Object.is equality

[Killed] BlockStatement
src/errors/tagged-errors.ts:102:34
 const _CircularDerivedDependency = createError("CircularDerivedDependency");
 export const CircularDerivedDependency = (fields: {
   readonly dependencyChain: readonly string[];
-}): CircularDerivedDependency => {
-  const formattedChain = fields.dependencyChain.join(" -> ");
-  return _CircularDerivedDependency({
-    dependencyChain: Object.freeze([...fields.dependencyChain]),
-    code: "CIRCULAR_DERIVED_DEPENDENCY" as const,
-    isProgrammingError: true as const,
-    message: `Circular derived dependency detected: ${formattedChain}`,
-  });
-};
+}): CircularDerivedDependency => {};
 export type CircularDerivedDependency = Readonly<{
   _tag: "CircularDerivedDependency";
killedBy: CircularDerivedDependency has _tag CircularDerivedDependency
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ArrayDeclaration
src/errors/tagged-errors.ts:105:36
 }): CircularDerivedDependency => {
   const formattedChain = fields.dependencyChain.join(" -> ");
   return _CircularDerivedDependency({
-    dependencyChain: Object.freeze([...fields.dependencyChain]),
+    dependencyChain: Object.freeze([]),
     code: "CIRCULAR_DERIVED_DEPENDENCY" as const,
     isProgrammingError: true as const,
killedBy: CircularDerivedDependency includes dependencyChain
statusReason: expected [] to deeply equal [ 'A', 'B', 'C', 'A' ]

[Killed] BlockStatement
src/errors/tagged-errors.ts:126:29
 const _BatchExecutionFailed = createError("BatchExecutionFailed");
 export const BatchExecutionFailed = (fields: {
   readonly cause: unknown;
-}): BatchExecutionFailed => {
-  const causeMessage = fields.cause instanceof Error ? fields.cause.message : String(fields.cause);
-  return _BatchExecutionFailed({
-    ...fields,
-    code: "BATCH_EXECUTION_FAILED" as const,
-    isProgrammingError: false as const,
-    message: `Batch execution failed: ${causeMessage}. Deferred notifications flushed.`,
-  });
-};
+}): BatchExecutionFailed => {};
 export type BatchExecutionFailed = Readonly<{
   _tag: "BatchExecutionFailed";
killedBy: BatchExecutionFailed has _tag BatchExecutionFailed
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] StringLiteral
src/errors/tagged-errors.ts:132:14
     ...fields,
     code: "BATCH_EXECUTION_FAILED" as const,
     isProgrammingError: false as const,
-    message: `Batch execution failed: ${causeMessage}. Deferred notifications flushed.`,
+    message: ``,
   });
 };
killedBy: Error message content BatchExecutionFailed message contains cause message
statusReason: expected '' to contain 'boom'

[Killed] ArrowFunction
src/errors/tagged-errors.ts:148:36
  * does not become true within the specified timeout.
  */
 const _WaitForStateTimeout = createError("WaitForStateTimeout");
-export const WaitForStateTimeout = (fields: {
-  readonly portName: string;
-  readonly timeoutMs: number;
-}): WaitForStateTimeout =>
-  _WaitForStateTimeout({
-    ...fields,
-    code: "WAIT_FOR_STATE_TIMEOUT" as const,
-    isProgrammingError: false as const,
-    message:
-      `waitForState for port '${fields.portName}' timed out after ${fields.timeoutMs}ms. ` +
-      `The predicate never returned true.`,
-  });
+export const WaitForStateTimeout = () => undefined;
 export type WaitForStateTimeout = Readonly<{
   _tag: "WaitForStateTimeout";
killedBy: WaitForStateTimeout has _tag WaitForStateTimeout
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] StringLiteral
src/errors/tagged-errors.ts:158:7
     isProgrammingError: false as const,
     message:
       `waitForState for port '${fields.portName}' timed out after ${fields.timeoutMs}ms. ` +
-      `The predicate never returned true.`,
+      ``,
   });
 export type WaitForStateTimeout = Readonly<{
killedBy: Error message content WaitForStateTimeout message contains 'predicate never returned true'
statusReason: expected 'waitForState for port \'Counter\' tim…' to contain 'The predicate never returned true'

[Killed] StringLiteral
src/errors/tagged-errors.ts:172:44
 /**
  * Thrown when a non-function value is passed to `computed()` as the getter.
  */
-const _InvalidComputedGetter = createError("InvalidComputedGetter");
+const _InvalidComputedGetter = createError("");
 export const InvalidComputedGetter = (): InvalidComputedGetter =>
   _InvalidComputedGetter({
killedBy: InvalidComputedGetter runtime returns an object with _tag 'InvalidComputedGetter'
statusReason: expected '' to be 'InvalidComputedGetter' // Object.is equality

[Killed] ArrowFunction
src/errors/tagged-errors.ts:173:38
  * Thrown when a non-function value is passed to `computed()` as the getter.
  */
 const _InvalidComputedGetter = createError("InvalidComputedGetter");
-export const InvalidComputedGetter = (): InvalidComputedGetter =>
-  _InvalidComputedGetter({
-    code: "INVALID_COMPUTED_GETTER" as const,
-    isProgrammingError: true as const,
-    message: "getter must be a function",
-  });
+export const InvalidComputedGetter = () => undefined;
 export type InvalidComputedGetter = Readonly<{
   _tag: "InvalidComputedGetter";
killedBy: InvalidComputedGetter runtime returns an object with _tag 'InvalidComputedGetter'
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] StringLiteral
src/errors/tagged-errors.ts:238:52
  * Produced when an onEffectError handler itself throws.
  * Both the original effect error and the handler error are captured.
  */
-export const EffectErrorHandlerError = createError("EffectErrorHandlerFailed");
+export const EffectErrorHandlerError = createError("");
 export type EffectErrorHandlerError = Readonly<{
   _tag: "EffectErrorHandlerFailed";
killedBy: onEffectError handler errors when onEffectError itself throws: EffectErrorHandlerError routed to onError, no propagation
statusReason: expected '' to be 'EffectErrorHandlerFailed' // Object.is equality
