[Killed] BlockStatement
src/inspection/inspector-adapter.ts:45:32
  */
 export function createStoreInspectorAdapter(
   config?: CreateStoreInspectorAdapterConfig,
-): StoreInspectorAdapterResult {
-  const inspector = createStoreInspectorImpl({
-    historyConfig: config?.historyConfig,
-    registry: config?.registry,
-  });
-
-  return {
-    api: inspector,
-    internal: inspector,
-  };
-}
+): StoreInspectorAdapterResult {}
 
 // =============================================================================
killedBy: createStoreInspectorAdapter returns api and internal interfaces
statusReason: Cannot read properties of undefined (reading 'api')

[Killed] OptionalChaining
src/inspection/inspector-adapter.ts:47:20
   config?: CreateStoreInspectorAdapterConfig,
 ): StoreInspectorAdapterResult {
   const inspector = createStoreInspectorImpl({
-    historyConfig: config?.historyConfig,
+    historyConfig: config.historyConfig,
     registry: config?.registry,
   });
killedBy: createStoreInspectorAdapter returns api and internal interfaces
statusReason: Cannot read properties of undefined (reading 'historyConfig')

[Killed] OptionalChaining
src/inspection/inspector-adapter.ts:48:15
 ): StoreInspectorAdapterResult {
   const inspector = createStoreInspectorImpl({
     historyConfig: config?.historyConfig,
-    registry: config?.registry,
+    registry: config.registry,
   });
 
killedBy: createStoreInspectorAdapter returns api and internal interfaces
statusReason: Cannot read properties of undefined (reading 'registry')

[Killed] ObjectLiteral
src/inspection/inspector-adapter.ts:83:19
   "sync",
   false,
   readonly []
-> = Object.freeze({
-  provides: StoreInspectorPort,
-  requires: [] as const,
-  lifetime: "singleton" as const,
-  factoryKind: "sync" as const,
-  clonable: false as const,
-  factory: (): InferService<typeof StoreInspectorPort> => createStoreInspectorImpl(),
-});
+> = Object.freeze({});
 
 // =============================================================================
killedBy: StoreInspectorAdapter frozen singleton has correct provides (StoreInspectorPort)
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/inspection/inspector-adapter.ts:89:12
   lifetime: "singleton" as const,
   factoryKind: "sync" as const,
   clonable: false as const,
-  factory: (): InferService<typeof StoreInspectorPort> => createStoreInspectorImpl(),
+  factory: () => undefined,
 });
 
killedBy: StoreInspectorAdapter frozen singleton factory returns a working StoreInspectorAPI
statusReason: Cannot read properties of undefined (reading 'getSnapshot')

[Killed] ArrowFunction
src/inspection/inspector-adapter.ts:126:12
   lifetime: "singleton" as const,
   factoryKind: "sync" as const,
   clonable: false as const,
-  factory: (deps: { StoreRegistry: InferService<typeof StoreRegistryPort> }): InferService<typeof StoreInspectorPort> =>
-    createStoreInspectorImpl({ registry: deps.StoreRegistry }),
+  factory: () => undefined,
 });
 
killedBy: StoreInspectorWithRegistryAdapter factory creates inspector that auto-discovers from registry
statusReason: Cannot read properties of undefined (reading 'getSnapshot')

[Killed] ObjectLiteral
src/inspection/inspector-adapter.ts:127:30
   factoryKind: "sync" as const,
   clonable: false as const,
   factory: (deps: { StoreRegistry: InferService<typeof StoreRegistryPort> }): InferService<typeof StoreInspectorPort> =>
-    createStoreInspectorImpl({ registry: deps.StoreRegistry }),
+    createStoreInspectorImpl({}),
 });
 
killedBy: inspector-adapter.ts — frozen singleton adapters StoreInspectorWithRegistryAdapter factory uses registry
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/inspection/inspector-adapter.ts:148:19
   "sync",
   false,
   readonly [typeof StoreRegistryPort]
-> = Object.freeze({
-  provides: StoreInspectorInternalPort,
-  requires: [StoreRegistryPort] as const,
-  lifetime: "singleton" as const,
-  factoryKind: "sync" as const,
-  clonable: false as const,
-  factory: (deps: { StoreRegistry: InferService<typeof StoreRegistryPort> }): InferService<typeof StoreInspectorInternalPort> =>
-    createStoreInspectorImpl({ registry: deps.StoreRegistry }),
-});
+> = Object.freeze({});
 
killedBy: inspector-adapter.ts — frozen singleton adapters StoreInspectorInternalAdapter is frozen and provides StoreInspectorInternalPort
statusReason: expected undefined to be { Object (__portName) } // Object.is equality

[Killed] ArrowFunction
src/inspection/inspector-adapter.ts:154:12
   lifetime: "singleton" as const,
   factoryKind: "sync" as const,
   clonable: false as const,
-  factory: (deps: { StoreRegistry: InferService<typeof StoreRegistryPort> }): InferService<typeof StoreInspectorInternalPort> =>
-    createStoreInspectorImpl({ registry: deps.StoreRegistry }),
+  factory: () => undefined,
 });
 
killedBy: inspector-adapter.ts — frozen singleton adapters StoreInspectorInternalAdapter factory returns internal interface
statusReason: Cannot read properties of undefined (reading 'recordAction')

[Survived] ObjectLiteral
src/inspection/inspector-adapter.ts:155:30
   factoryKind: "sync" as const,
   clonable: false as const,
   factory: (deps: { StoreRegistry: InferService<typeof StoreRegistryPort> }): InferService<typeof StoreInspectorInternalPort> =>
-    createStoreInspectorImpl({ registry: deps.StoreRegistry }),
+    createStoreInspectorImpl({}),
 });
 
