[Killed] BooleanLiteral
src/inspection/store-registry.ts:102:18
   const entries = new Map<string, StoreRegistryEntry>();
   const scopedEntries = new Map<string, Map<string, StoreRegistryEntry>>();
   const listeners = new Set<StoreRegistryListener>();
-  let disposed = false;
+  let disposed = true;
 
   function notifyListeners(event: StoreRegistryEvent): void {
killedBy: StoreRegistryAdapter — mutation killers factory returns a fully-functional StoreRegistry returned registry is operational (register -> getAll)
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/inspection/store-registry.ts:104:61
   const listeners = new Set<StoreRegistryListener>();
   let disposed = false;
 
-  function notifyListeners(event: StoreRegistryEvent): void {
-    const currentListeners = Array.from(listeners);
-    for (const listener of currentListeners) {
-      listener(event);
-    }
-  }
+  function notifyListeners(event: StoreRegistryEvent): void {}
 
   const registry: StoreRegistry = {
killedBy: Auto-Registration inspector auto-discovers registered ports via registry subscription
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/inspection/store-registry.ts:112:47
   }
 
   const registry: StoreRegistry = {
-    register(entry: StoreRegistryEntry): void {
-      if (disposed) return;
-      entries.set(entry.portName, entry);
-      notifyListeners({ type: "port-registered", entry });
-    },
+    register(entry: StoreRegistryEntry): void {},
 
     unregister(portName: string): void {
killedBy: StoreRegistryAdapter — mutation killers factory returns a fully-functional StoreRegistry returned registry is operational (register -> getAll)
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/inspection/store-registry.ts:113:11
 
   const registry: StoreRegistry = {
     register(entry: StoreRegistryEntry): void {
-      if (disposed) return;
+      if (false) return;
       entries.set(entry.portName, entry);
       notifyListeners({ type: "port-registered", entry });
killedBy: createStoreRegistry dispose() clears entries and stops notifications
statusReason: expected [ { portName: 'Theme', …(7) } ] to deeply equal []

[Killed] ConditionalExpression
src/inspection/store-registry.ts:113:11
 
   const registry: StoreRegistry = {
     register(entry: StoreRegistryEntry): void {
-      if (disposed) return;
+      if (true) return;
       entries.set(entry.portName, entry);
       notifyListeners({ type: "port-registered", entry });
killedBy: StoreRegistryAdapter.factory returns a working registry (can register and get)
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/inspection/store-registry.ts:118:40
       notifyListeners({ type: "port-registered", entry });
     },
 
-    unregister(portName: string): void {
-      if (disposed) return;
-      if (entries.delete(portName)) {
-        notifyListeners({ type: "port-unregistered", portName });
-      }
-    },
+    unregister(portName: string): void {},
 
     registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
killedBy: StoreRegistry — mutation killers notifyListeners snapshots listener set before iterating removing a listener inside another listener callback during unregister still notifies previously-snapshot liste
statusReason: expected [] to include 'listener1-port-unregistered'

[Killed] ConditionalExpression
src/inspection/store-registry.ts:119:11
     },
 
     unregister(portName: string): void {
-      if (disposed) return;
+      if (true) return;
       if (entries.delete(portName)) {
         notifyListeners({ type: "port-unregistered", portName });
killedBy: StoreInspectorImpl — registry auto-discovery handles port-unregistered events
statusReason: expected [ { kind: 'state', …(5) } ] to have a length of +0 but got 1

[Survived] ConditionalExpression
src/inspection/store-registry.ts:119:11
     },
 
     unregister(portName: string): void {
-      if (disposed) return;
+      if (false) return;
       if (entries.delete(portName)) {
         notifyListeners({ type: "port-unregistered", portName });

[Killed] ConditionalExpression
src/inspection/store-registry.ts:120:11
 
     unregister(portName: string): void {
       if (disposed) return;
-      if (entries.delete(portName)) {
+      if (true) {
         notifyListeners({ type: "port-unregistered", portName });
       }
killedBy: StoreRegistry — mutation killers unregister only notifies when entry actually existed unregister for non-existent port does not notify
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/inspection/store-registry.ts:120:11
 
     unregister(portName: string): void {
       if (disposed) return;
-      if (entries.delete(portName)) {
+      if (false) {
         notifyListeners({ type: "port-unregistered", portName });
       }
killedBy: StoreInspectorImpl — registry auto-discovery handles port-unregistered events
statusReason: expected [ { kind: 'state', …(5) } ] to have a length of +0 but got 1

[Killed] StringLiteral
src/inspection/store-registry.ts:121:33
     unregister(portName: string): void {
       if (disposed) return;
       if (entries.delete(portName)) {
-        notifyListeners({ type: "port-unregistered", portName });
+        notifyListeners({ type: "", portName });
       }
     },
killedBy: StoreInspectorImpl — registry auto-discovery handles port-unregistered events
statusReason: expected [ { kind: 'state', …(5) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/inspection/store-registry.ts:125:70
       }
     },
 
-    registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
-      if (disposed) return;
-      let scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) {
-        scopeMap = new Map<string, StoreRegistryEntry>();
-        scopedEntries.set(scopeId, scopeMap);
-      }
-      scopeMap.set(entry.portName, entry);
-      notifyListeners({ type: "scoped-port-registered", scopeId, entry });
-    },
+    registerScoped(scopeId: string, entry: StoreRegistryEntry): void {},
 
     unregisterScope(scopeId: string): void {
killedBy: StoreRegistry scoped entries registerScoped() adds entries under a scope ID
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/inspection/store-registry.ts:126:11
     },
 
     registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
-      if (disposed) return;
+      if (false) return;
       let scopeMap = scopedEntries.get(scopeId);
       if (!scopeMap) {
killedBy: store-registry.ts — get, subscribe, unsubscribe edge cases registerScoped on disposed registry does not store or notify
statusReason: expected [ { portName: 'X', …(7) } ] to deeply equal []

[Killed] ConditionalExpression
src/inspection/store-registry.ts:126:11
     },
 
     registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
-      if (disposed) return;
+      if (true) return;
       let scopeMap = scopedEntries.get(scopeId);
       if (!scopeMap) {
killedBy: StoreRegistry — mutation killers unregisterScope only notifies when scope actually existed unregisterScope for existing scope notifies with scope-unregistered
statusReason: expected [] to deeply equal [ 'scope-unregistered' ]

[Killed] BlockStatement
src/inspection/store-registry.ts:128:22
     registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
       if (disposed) return;
       let scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) {
-        scopeMap = new Map<string, StoreRegistryEntry>();
-        scopedEntries.set(scopeId, scopeMap);
-      }
+      if (!scopeMap) {}
       scopeMap.set(entry.portName, entry);
       notifyListeners({ type: "scoped-port-registered", scopeId, entry });
killedBy: StoreRegistry scoped entries registerScoped() adds entries under a scope ID
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/inspection/store-registry.ts:128:11
     registerScoped(scopeId: string, entry: StoreRegistryEntry): void {
       if (disposed) return;
       let scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) {
+      if (false) {
         scopeMap = new Map<string, StoreRegistryEntry>();
         scopedEntries.set(scopeId, scopeMap);
killedBy: StoreRegistry scoped entries registerScoped() adds entries under a scope ID
statusReason: Cannot read properties of undefined (reading 'set')

[Killed] ObjectLiteral
src/inspection/store-registry.ts:133:23
         scopedEntries.set(scopeId, scopeMap);
       }
       scopeMap.set(entry.portName, entry);
-      notifyListeners({ type: "scoped-port-registered", scopeId, entry });
+      notifyListeners({});
     },
 
killedBy: store-inspector-impl.ts — string literal and listener cleanup registry subscription auto-populates scoped ports
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/inspection/store-registry.ts:136:44
       notifyListeners({ type: "scoped-port-registered", scopeId, entry });
     },
 
-    unregisterScope(scopeId: string): void {
-      if (disposed) return;
-      if (scopedEntries.delete(scopeId)) {
-        notifyListeners({ type: "scope-unregistered", scopeId });
-      }
-    },
+    unregisterScope(scopeId: string): void {},
 
     getAll(): readonly StoreRegistryEntry[] {
killedBy: store-inspector-impl.ts — string literal and listener cleanup registry subscription handles scope-unregistered event
statusReason: expected { kind: 'state', …(5) } to be undefined

[Killed] ConditionalExpression
src/inspection/store-registry.ts:137:11
     },
 
     unregisterScope(scopeId: string): void {
-      if (disposed) return;
+      if (true) return;
       if (scopedEntries.delete(scopeId)) {
         notifyListeners({ type: "scope-unregistered", scopeId });
killedBy: StoreRegistry scoped entries unregisterScope() removes all entries for that scope
statusReason: expected [ { portName: 'Counter', …(7) }, …(1) ] to deeply equal []

[Survived] ConditionalExpression
src/inspection/store-registry.ts:137:11
     },
 
     unregisterScope(scopeId: string): void {
-      if (disposed) return;
+      if (false) return;
       if (scopedEntries.delete(scopeId)) {
         notifyListeners({ type: "scope-unregistered", scopeId });

[Killed] ConditionalExpression
src/inspection/store-registry.ts:138:11
 
     unregisterScope(scopeId: string): void {
       if (disposed) return;
-      if (scopedEntries.delete(scopeId)) {
+      if (false) {
         notifyListeners({ type: "scope-unregistered", scopeId });
       }
killedBy: store-inspector-impl.ts — string literal and listener cleanup registry subscription handles scope-unregistered event
statusReason: expected { kind: 'state', …(5) } to be undefined

[Killed] BlockStatement
src/inspection/store-registry.ts:138:42
 
     unregisterScope(scopeId: string): void {
       if (disposed) return;
-      if (scopedEntries.delete(scopeId)) {
-        notifyListeners({ type: "scope-unregistered", scopeId });
-      }
+      if (scopedEntries.delete(scopeId)) {}
     },
 
killedBy: StoreRegistry scoped entries subscribe() fires scope-unregistered events
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/inspection/store-registry.ts:143:45
       }
     },
 
-    getAll(): readonly StoreRegistryEntry[] {
-      return Array.from(entries.values());
-    },
+    getAll(): readonly StoreRegistryEntry[] {},
 
     getAllScoped(scopeId: string): readonly StoreRegistryEntry[] {
killedBy: createStoreRegistry creates an empty registry
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/inspection/store-registry.ts:147:66
       return Array.from(entries.values());
     },
 
-    getAllScoped(scopeId: string): readonly StoreRegistryEntry[] {
-      const scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) return [];
-      return Array.from(scopeMap.values());
-    },
+    getAllScoped(scopeId: string): readonly StoreRegistryEntry[] {},
 
     get(portName: string): StoreRegistryEntry | undefined {
killedBy: store-registry.ts — get, subscribe, unsubscribe edge cases registerScoped on disposed registry does not store or notify
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/inspection/store-registry.ts:149:11
 
     getAllScoped(scopeId: string): readonly StoreRegistryEntry[] {
       const scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) return [];
+      if (true) return [];
       return Array.from(scopeMap.values());
     },
killedBy: StoreRegistry scoped entries registerScoped() adds entries under a scope ID
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/inspection/store-registry.ts:149:11
 
     getAllScoped(scopeId: string): readonly StoreRegistryEntry[] {
       const scopeMap = scopedEntries.get(scopeId);
-      if (!scopeMap) return [];
+      if (false) return [];
       return Array.from(scopeMap.values());
     },
killedBy: store-registry.ts — get, subscribe, unsubscribe edge cases registerScoped on disposed registry does not store or notify
statusReason: Cannot read properties of undefined (reading 'values')

[Killed] BlockStatement
src/inspection/store-registry.ts:153:59
       return Array.from(scopeMap.values());
     },
 
-    get(portName: string): StoreRegistryEntry | undefined {
-      return entries.get(portName);
-    },
+    get(portName: string): StoreRegistryEntry | undefined {},
 
     subscribe(listener: StoreRegistryListener): Unsubscribe {
killedBy: createStoreRegistry register() / getAll() / get() lifecycle
statusReason: expected undefined to be { portName: 'Counter', …(7) } // Object.is equality

[Killed] BlockStatement
src/inspection/store-registry.ts:157:61
       return entries.get(portName);
     },
 
-    subscribe(listener: StoreRegistryListener): Unsubscribe {
-      listeners.add(listener);
-      return () => {
-        listeners.delete(listener);
-      };
-    },
+    subscribe(listener: StoreRegistryListener): Unsubscribe {},
 
     dispose(): void {
killedBy: store-registry.ts — get, subscribe, unsubscribe edge cases subscribe returns unsubscribe function that stops future notifications
statusReason: expected [] to deeply equal [ 'port-registered' ]

[Killed] BlockStatement
src/inspection/store-registry.ts:164:21
       };
     },
 
-    dispose(): void {
-      disposed = true;
-      entries.clear();
-      scopedEntries.clear();
-      listeners.clear();
-    },
+    dispose(): void {},
   };
 
killedBy: createStoreRegistry dispose() clears entries and stops notifications
statusReason: expected [ { portName: 'Counter', …(7) } ] to deeply equal []
