[Killed] BlockStatement
src/integration/library-inspector-bridge.ts:37:21
  */
 export function createStoreLibraryInspector(
   inspector: StoreInspectorAPI,
-): LibraryInspector {
-  return {
-    name: "store",
-
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      return Object.freeze(inspector.getSnapshot());
-    },
-
-    subscribe(listener: LibraryEventListener): () => void {
-      return inspector.subscribe((event: StoreInspectorEvent) => {
-        listener({
-          source: "store",
-          type: event.type,
-          payload: Object.freeze({ ...event }),
-          timestamp: Date.now(),
-        });
-      });
-    },
-
-    dispose(): void {
-      // StoreInspectorAPI has no cleanup — intentional no-op
-    },
-  };
-}
+): LibraryInspector {}
 
killedBy: createStoreLibraryInspector returns object with name 'store'
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
src/integration/library-inspector-bridge.ts:41:54
   return {
     name: "store",
 
-    getSnapshot(): Readonly<Record<string, unknown>> {
-      return Object.freeze(inspector.getSnapshot());
-    },
+    getSnapshot(): Readonly<Record<string, unknown>> {},
 
     subscribe(listener: LibraryEventListener): () => void {
killedBy: createStoreLibraryInspector getSnapshot delegates to StoreInspectorAPI.getSnapshot()
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/integration/library-inspector-bridge.ts:45:59
       return Object.freeze(inspector.getSnapshot());
     },
 
-    subscribe(listener: LibraryEventListener): () => void {
-      return inspector.subscribe((event: StoreInspectorEvent) => {
-        listener({
-          source: "store",
-          type: event.type,
-          payload: Object.freeze({ ...event }),
-          timestamp: Date.now(),
-        });
-      });
-    },
+    subscribe(listener: LibraryEventListener): () => void {},
 
     dispose(): void {
killedBy: createStoreLibraryInspector subscribe forwards StoreInspectorEvent as LibraryEvent with correct fields
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/integration/library-inspector-bridge.ts:46:66
     },
 
     subscribe(listener: LibraryEventListener): () => void {
-      return inspector.subscribe((event: StoreInspectorEvent) => {
-        listener({
-          source: "store",
-          type: event.type,
-          payload: Object.freeze({ ...event }),
-          timestamp: Date.now(),
-        });
-      });
+      return inspector.subscribe((event: StoreInspectorEvent) => {});
     },
 
killedBy: createStoreLibraryInspector subscribe forwards StoreInspectorEvent as LibraryEvent with correct fields
statusReason: expected "vi.fn()" to be called once, but got 0 times
