[Killed] BlockStatement
src/integration/tracing-hook-adapter.ts:32:3
   "sync",
   false,
   readonly []
-> {
-  return Object.freeze({
-    provides: StoreTracingHookPort,
-    requires: [] as const,
-    lifetime: "singleton" as const,
-    factoryKind: "sync" as const,
-    clonable: false as const,
-    factory: (): StoreTracingHook =>
-      createStoreTracingBridge({
-        tracer: config.tracer,
-        filter: config.filter,
-      }),
-  });
-}
+> {}
 
killedBy: Auto-Tracing StoreTracingHookAdapter creates a valid tracing hook
statusReason: Cannot read properties of undefined (reading 'provides')

[Killed] ObjectLiteral
src/integration/tracing-hook-adapter.ts:33:24
   false,
   readonly []
 > {
-  return Object.freeze({
-    provides: StoreTracingHookPort,
-    requires: [] as const,
-    lifetime: "singleton" as const,
-    factoryKind: "sync" as const,
-    clonable: false as const,
-    factory: (): StoreTracingHook =>
-      createStoreTracingBridge({
-        tracer: config.tracer,
-        filter: config.filter,
-      }),
-  });
+  return Object.freeze({});
 }
 
killedBy: Auto-Tracing StoreTracingHookAdapter creates a valid tracing hook
statusReason: Cannot read properties of undefined (reading '__portName')

[Killed] ArrowFunction
src/integration/tracing-hook-adapter.ts:39:14
     lifetime: "singleton" as const,
     factoryKind: "sync" as const,
     clonable: false as const,
-    factory: (): StoreTracingHook =>
-      createStoreTracingBridge({
-        tracer: config.tracer,
-        filter: config.filter,
-      }),
+    factory: () => undefined,
   });
 }
killedBy: Auto-Tracing StoreTracingHookAdapter creates a valid tracing hook
statusReason: Cannot read properties of undefined (reading 'onActionStart')
