[Killed] BlockStatement
src/ports/history-port.ts:29:61
  */
 export function createHistoryActions<TState>(): HistoryActions<TState> {
   return Object.freeze({
-    undo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.past.length === 0) return state;
-      const previous = state.past[state.past.length - 1];
-      return {
-        past: state.past.slice(0, -1),
-        present: previous as TState,
-        future: [state.present, ...state.future],
-      };
-    },
+    undo(state: HistoryState<TState>): HistoryState<TState> {},
 
     redo(state: HistoryState<TState>): HistoryState<TState> {
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: Cannot read properties of undefined (reading 'past')

[Killed] ConditionalExpression
src/ports/history-port.ts:30:11
 export function createHistoryActions<TState>(): HistoryActions<TState> {
   return Object.freeze({
     undo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.past.length === 0) return state;
+      if (false) return state;
       const previous = state.past[state.past.length - 1];
       return {
killedBy: createHistoryActions undo returns same reference when past is empty (no-op)
statusReason: expected { past: [], present: undefined, …(1) } to be { past: [], …(2) } // Object.is equality

[Killed] ConditionalExpression
src/ports/history-port.ts:30:11
 export function createHistoryActions<TState>(): HistoryActions<TState> {
   return Object.freeze({
     undo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.past.length === 0) return state;
+      if (true) return state;
       const previous = state.past[state.past.length - 1];
       return {
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: expected [ { items: [] } ] to deeply equal []

[Killed] ArithmeticOperator
src/ports/history-port.ts:31:35
   return Object.freeze({
     undo(state: HistoryState<TState>): HistoryState<TState> {
       if (state.past.length === 0) return state;
-      const previous = state.past[state.past.length - 1];
+      const previous = state.past[state.past.length + 1];
       return {
         past: state.past.slice(0, -1),
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: expected undefined to deeply equal { items: [] }

[Killed] UnaryOperator
src/ports/history-port.ts:33:35
       if (state.past.length === 0) return state;
       const previous = state.past[state.past.length - 1];
       return {
-        past: state.past.slice(0, -1),
+        past: state.past.slice(0, +1),
         present: previous as TState,
         future: [state.present, ...state.future],
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: expected [ { items: [] } ] to deeply equal []

[Killed] MethodExpression
src/ports/history-port.ts:33:15
       if (state.past.length === 0) return state;
       const previous = state.past[state.past.length - 1];
       return {
-        past: state.past.slice(0, -1),
+        past: state.past,
         present: previous as TState,
         future: [state.present, ...state.future],
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: expected [ { items: [] } ] to deeply equal []

[Killed] ArrayDeclaration
src/ports/history-port.ts:35:17
       return {
         past: state.past.slice(0, -1),
         present: previous as TState,
-        future: [state.present, ...state.future],
+        future: [],
       };
     },
killedBy: createHistoryActions undo pops from past to present, pushes old present to future
statusReason: expected [] to deeply equal [ { items: [ 'a' ] } ]

[Killed] BlockStatement
src/ports/history-port.ts:39:61
       };
     },
 
-    redo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.future.length === 0) return state;
-      const next = state.future[0];
-      return {
-        past: [...state.past, state.present],
-        present: next as TState,
-        future: state.future.slice(1),
-      };
-    },
+    redo(state: HistoryState<TState>): HistoryState<TState> {},
 
     push(state: HistoryState<TState>, payload: TState): HistoryState<TState> {
killedBy: createHistoryActions redo shifts from future to present, pushes old present to past
statusReason: Cannot read properties of undefined (reading 'past')

[Killed] ConditionalExpression
src/ports/history-port.ts:40:11
     },
 
     redo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.future.length === 0) return state;
+      if (false) return state;
       const next = state.future[0];
       return {
killedBy: createHistoryActions redo returns same reference when future is empty (no-op)
statusReason: expected { past: [ { items: [] } ], …(2) } to be { past: [], …(2) } // Object.is equality

[Killed] ConditionalExpression
src/ports/history-port.ts:40:11
     },
 
     redo(state: HistoryState<TState>): HistoryState<TState> {
-      if (state.future.length === 0) return state;
+      if (true) return state;
       const next = state.future[0];
       return {
killedBy: createHistoryActions redo shifts from future to present, pushes old present to past
statusReason: expected [] to deeply equal [ { items: [] } ]

[Killed] MethodExpression
src/ports/history-port.ts:45:17
       return {
         past: [...state.past, state.present],
         present: next as TState,
-        future: state.future.slice(1),
+        future: state.future,
       };
     },
killedBy: createHistoryActions redo shifts from future to present, pushes old present to past
statusReason: expected [ { items: [ 'a' ] }, …(1) ] to deeply equal [ { items: [ 'a', 'b' ] } ]

[Killed] BlockStatement
src/ports/history-port.ts:49:78
       };
     },
 
-    push(state: HistoryState<TState>, payload: TState): HistoryState<TState> {
-      return {
-        past: [...state.past, state.present],
-        present: payload,
-        future: [],
-      };
-    },
+    push(state: HistoryState<TState>, payload: TState): HistoryState<TState> {},
 
     clear(state: HistoryState<TState>): HistoryState<TState> {
killedBy: createHistoryActions push pushes present to past and sets new present, clears future
statusReason: Cannot read properties of undefined (reading 'past')

[Killed] ArrayDeclaration
src/ports/history-port.ts:51:15
 
     push(state: HistoryState<TState>, payload: TState): HistoryState<TState> {
       return {
-        past: [...state.past, state.present],
+        past: [],
         present: payload,
         future: [],
killedBy: createHistoryActions push pushes present to past and sets new present, clears future
statusReason: expected [] to deeply equal [ { items: [] } ]

[Killed] BlockStatement
src/ports/history-port.ts:57:62
       };
     },
 
-    clear(state: HistoryState<TState>): HistoryState<TState> {
-      return {
-        past: [],
-        present: state.present,
-        future: [],
-      };
-    },
+    clear(state: HistoryState<TState>): HistoryState<TState> {},
   });
 }
killedBy: createHistoryActions clear empties past and future, keeps present
statusReason: Cannot read properties of undefined (reading 'past')

[Killed] ObjectLiteral
src/ports/history-port.ts:58:14
     },
 
     clear(state: HistoryState<TState>): HistoryState<TState> {
-      return {
-        past: [],
-        present: state.present,
-        future: [],
-      };
+      return {};
     },
   });
killedBy: createHistoryActions clear empties past and future, keeps present
statusReason: expected undefined to deeply equal []

[Killed] ArrayDeclaration
src/ports/history-port.ts:59:15
 
     clear(state: HistoryState<TState>): HistoryState<TState> {
       return {
-        past: [],
+        past: ["Stryker was here"],
         present: state.present,
         future: [],
killedBy: createHistoryActions clear empties past and future, keeps present
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/ports/history-port.ts:86:12
 ): StatePortDef<`${TName}History`, HistoryState<TState>, HistoryActions<TState>>;
 export function createHistoryPort(
   innerPort: { readonly __portName: string },
-): unknown {
-  const innerName = innerPort.__portName;
-  return createPort({ name: `${innerName}History` });
-}
+): unknown {}
 
killedBy: createHistoryPort creates a port with template literal name
statusReason: Cannot read properties of undefined (reading '__portName')
