[Killed] BlockStatement
src/reactivity/path-tracking.ts:29:65
 // Helpers
 // =============================================================================
 
-function isRecord(val: unknown): val is Record<string, unknown> {
-  return typeof val === "object" && val !== null;
-}
+function isRecord(val: unknown): val is Record<string, unknown> {}
 
 // =============================================================================
killedBy: StateService subscribe(selector, listener) fires only when selected value changes
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/reactivity/path-tracking.ts:30:10
 // =============================================================================
 
 function isRecord(val: unknown): val is Record<string, unknown> {
-  return typeof val === "object" && val !== null;
+  return typeof val === "object" || val !== null;
 }
 
killedBy: createTrackingProxy records top-level property access
statusReason: Cannot create proxy with a non-object as target or handler

[Killed] EqualityOperator
src/reactivity/path-tracking.ts:30:37
 // =============================================================================
 
 function isRecord(val: unknown): val is Record<string, unknown> {
-  return typeof val === "object" && val !== null;
+  return typeof val === "object" && val === null;
 }
 
killedBy: path-tracking proxy null is returned as-is (isRecord returns false)
statusReason: Cannot create proxy with a non-object as target or handler

[Killed] BooleanLiteral
src/reactivity/path-tracking.ts:49:9
   const paths = new Set<string>();
 
   function makeProxy(target: unknown, prefix: string): unknown {
-    if (!isRecord(target)) return target;
+    if (isRecord(target)) return target;
 
     return new Proxy(target, {
killedBy: path-tracking proxy non-object values are returned as-is without proxy
statusReason: Cannot create proxy with a non-object as target or handler

[Killed] ConditionalExpression
src/reactivity/path-tracking.ts:49:9
   const paths = new Set<string>();
 
   function makeProxy(target: unknown, prefix: string): unknown {
-    if (!isRecord(target)) return target;
+    if (false) return target;
 
     return new Proxy(target, {
killedBy: path-tracking proxy non-object values are returned as-is without proxy
statusReason: Cannot create proxy with a non-object as target or handler

[Killed] BlockStatement
src/reactivity/path-tracking.ts:52:32
     if (!isRecord(target)) return target;
 
     return new Proxy(target, {
-      get(obj, prop, receiver) {
-        // Only track string keys, skip symbols
-        if (typeof prop === "symbol") {
-          const symbolValue: unknown = Reflect.get(obj, prop, receiver);
-          return symbolValue;
-        }
-
-        const path = prefix ? `${prefix}.${prop}` : prop;
-        paths.add(path);
-
-        const value: unknown = Reflect.get(obj, prop, receiver);
-
-        // Recurse into nested objects/arrays, but respect Proxy invariants:
-        // non-configurable non-writable properties must return their actual value.
-        if (isRecord(value)) {
-          const desc = Object.getOwnPropertyDescriptor(obj, prop);
-          if (desc && !desc.configurable && !desc.writable) {
-            // Can't return a different object — just track and return original
-            return value;
-          }
-          return makeProxy(value, path);
-        }
-
-        return value;
-      },
+      get(obj, prop, receiver) {},
     });
   }
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: Cannot read properties of undefined (reading 'b')

[Killed] EqualityOperator
src/reactivity/path-tracking.ts:54:13
     return new Proxy(target, {
       get(obj, prop, receiver) {
         // Only track string keys, skip symbols
-        if (typeof prop === "symbol") {
+        if (typeof prop !== "symbol") {
           const symbolValue: unknown = Reflect.get(obj, prop, receiver);
           return symbolValue;
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/path-tracking.ts:54:13
     return new Proxy(target, {
       get(obj, prop, receiver) {
         // Only track string keys, skip symbols
-        if (typeof prop === "symbol") {
+        if (true) {
           const symbolValue: unknown = Reflect.get(obj, prop, receiver);
           return symbolValue;
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/reactivity/path-tracking.ts:59:31
           return symbolValue;
         }
 
-        const path = prefix ? `${prefix}.${prop}` : prop;
+        const path = prefix ? `` : prop;
         paths.add(path);
 
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/path-tracking.ts:66:13
 
         // Recurse into nested objects/arrays, but respect Proxy invariants:
         // non-configurable non-writable properties must return their actual value.
-        if (isRecord(value)) {
+        if (false) {
           const desc = Object.getOwnPropertyDescriptor(obj, prop);
           if (desc && !desc.configurable && !desc.writable) {
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/reactivity/path-tracking.ts:66:30
 
         // Recurse into nested objects/arrays, but respect Proxy invariants:
         // non-configurable non-writable properties must return their actual value.
-        if (isRecord(value)) {
-          const desc = Object.getOwnPropertyDescriptor(obj, prop);
-          if (desc && !desc.configurable && !desc.writable) {
-            // Can't return a different object — just track and return original
-            return value;
-          }
-          return makeProxy(value, path);
-        }
+        if (isRecord(value)) {}
 
         return value;
killedBy: path-tracking proxy tracks paths on regular objects
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/reactivity/path-tracking.ts:68:23
         // non-configurable non-writable properties must return their actual value.
         if (isRecord(value)) {
           const desc = Object.getOwnPropertyDescriptor(obj, prop);
-          if (desc && !desc.configurable && !desc.writable) {
+          if (desc && desc.configurable && !desc.writable) {
             // Can't return a different object — just track and return original
             return value;
killedBy: path-tracking proxy non-configurable non-writable property returns original value (no nested proxy)
statusReason: 'get' on proxy: property 'frozen' is a read-only and non-configurable data property on the proxy target but the proxy did not return its actual value (expected '#<Object>' but got '#<Object>')

[Killed] LogicalOperator
src/reactivity/path-tracking.ts:68:15
         // non-configurable non-writable properties must return their actual value.
         if (isRecord(value)) {
           const desc = Object.getOwnPropertyDescriptor(obj, prop);
-          if (desc && !desc.configurable && !desc.writable) {
+          if (desc || !desc.configurable && !desc.writable) {
             // Can't return a different object — just track and return original
             return value;
killedBy: path-tracking proxy configurable but non-writable property returns a proxy
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/reactivity/path-tracking.ts:92:89
  * Runs a selector through a tracking proxy, returning the result and
  * the set of property paths accessed during execution.
  */
-export function trackSelector<T, S>(state: T, selector: (s: T) => S): TrackingResult<S> {
-  const { proxy, paths } = createTrackingProxy(state);
-  const value = selector(proxy);
-  return { value, paths };
-}
+export function trackSelector<T, S>(state: T, selector: (s: T) => S): TrackingResult<S> {}
 
 // =============================================================================
killedBy: trackSelector tracks accessed paths during selector execution
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ObjectLiteral
src/reactivity/path-tracking.ts:95:10
 export function trackSelector<T, S>(state: T, selector: (s: T) => S): TrackingResult<S> {
   const { proxy, paths } = createTrackingProxy(state);
   const value = selector(proxy);
-  return { value, paths };
+  return {};
 }
 
killedBy: trackSelector tracks accessed paths during selector execution
statusReason: expected undefined to be 'Alice' // Object.is equality

[Killed] BlockStatement
src/reactivity/path-tracking.ts:108:90
  * Returns `true` if any tracked path has a different value between
  * `prev` and `next`. Returns `false` when all tracked paths are identical.
  */
-export function hasPathChanged<T>(prev: T, next: T, paths: ReadonlySet<string>): boolean {
-  for (const path of paths) {
-    const segments = path.split(".");
-    let prevVal: unknown = prev;
-    let nextVal: unknown = next;
-
-    for (const seg of segments) {
-      prevVal = isRecord(prevVal) ? prevVal[seg] : undefined;
-      nextVal = isRecord(nextVal) ? nextVal[seg] : undefined;
-    }
-
-    if (!Object.is(prevVal, nextVal)) {
-      return true;
-    }
-  }
-
-  return false;
-}
+export function hasPathChanged<T>(prev: T, next: T, paths: ReadonlySet<string>): boolean {}
 
killedBy: hasPathChanged returns true when a tracked path differs
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/reactivity/path-tracking.ts:109:29
  * `prev` and `next`. Returns `false` when all tracked paths are identical.
  */
 export function hasPathChanged<T>(prev: T, next: T, paths: ReadonlySet<string>): boolean {
-  for (const path of paths) {
-    const segments = path.split(".");
-    let prevVal: unknown = prev;
-    let nextVal: unknown = next;
-
-    for (const seg of segments) {
-      prevVal = isRecord(prevVal) ? prevVal[seg] : undefined;
-      nextVal = isRecord(nextVal) ? nextVal[seg] : undefined;
-    }
-
-    if (!Object.is(prevVal, nextVal)) {
-      return true;
-    }
-  }
+  for (const path of paths) {}
 
   return false;
killedBy: hasPathChanged returns true when a tracked path differs
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/reactivity/path-tracking.ts:114:33
     let prevVal: unknown = prev;
     let nextVal: unknown = next;
 
-    for (const seg of segments) {
-      prevVal = isRecord(prevVal) ? prevVal[seg] : undefined;
-      nextVal = isRecord(nextVal) ? nextVal[seg] : undefined;
-    }
+    for (const seg of segments) {}
 
     if (!Object.is(prevVal, nextVal)) {
killedBy: hasPathChanged returns false when all tracked paths are identical
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/reactivity/path-tracking.ts:119:9
       nextVal = isRecord(nextVal) ? nextVal[seg] : undefined;
     }
 
-    if (!Object.is(prevVal, nextVal)) {
+    if (false) {
       return true;
     }
killedBy: hasPathChanged returns true when a tracked path differs
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/path-tracking.ts:119:9
       nextVal = isRecord(nextVal) ? nextVal[seg] : undefined;
     }
 
-    if (!Object.is(prevVal, nextVal)) {
+    if (true) {
       return true;
     }
killedBy: hasPathChanged returns false when all tracked paths are identical
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/reactivity/path-tracking.ts:120:14
     }
 
     if (!Object.is(prevVal, nextVal)) {
-      return true;
+      return false;
     }
   }
killedBy: hasPathChanged returns true when a tracked path differs
statusReason: expected false to be true // Object.is equality
