[Killed] BlockStatement
src/reactivity/shallow-equal.ts:11:86
  * Compares two objects shallowly.
  * Returns true if all top-level properties are strictly equal.
  */
-export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {
-  if (Object.is(a, b)) return true;
-  if (typeof a !== "object" || typeof b !== "object" || a === null || b === null) return false;
-
-  const keysA = Object.keys(a);
-  const keysB = Object.keys(b);
-
-  if (keysA.length !== keysB.length) return false;
-
-  for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {
-      return false;
-    }
-  }
-
-  return true;
-}
+export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {}
 
killedBy: shallowEqual returns true for identical references
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/reactivity/shallow-equal.ts:12:31
  * Returns true if all top-level properties are strictly equal.
  */
 export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {
-  if (Object.is(a, b)) return true;
+  if (Object.is(a, b)) return false;
   if (typeof a !== "object" || typeof b !== "object" || a === null || b === null) return false;
 
killedBy: shallowEqual returns true for same reference
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/shallow-equal.ts:12:7
  * Returns true if all top-level properties are strictly equal.
  */
 export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {
-  if (Object.is(a, b)) return true;
+  if (true) return true;
   if (typeof a !== "object" || typeof b !== "object" || a === null || b === null) return false;
 
killedBy: shallowEqual returns false for objects with different property values
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/reactivity/shallow-equal.ts:13:57
  */
 export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {
   if (Object.is(a, b)) return true;
-  if (typeof a !== "object" || typeof b !== "object" || a === null || b === null) return false;
+  if (typeof a !== "object" || typeof b !== "object" || a !== null || b === null) return false;
 
   const keysA = Object.keys(a);
killedBy: shallowEqual returns true for objects with same top-level properties
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/shallow-equal.ts:13:57
  */
 export function shallowEqual<T extends Record<string, unknown>>(a: T, b: T): boolean {
   if (Object.is(a, b)) return true;
-  if (typeof a !== "object" || typeof b !== "object" || a === null || b === null) return false;
+  if (typeof a !== "object" || typeof b !== "object" || false || b === null) return false;
 
   const keysA = Object.keys(a);
killedBy: shallowEqual returns false when one arg is null and other is object
statusReason: Cannot convert undefined or null to object

[Killed] EqualityOperator
src/reactivity/shallow-equal.ts:18:7
   const keysA = Object.keys(a);
   const keysB = Object.keys(b);
 
-  if (keysA.length !== keysB.length) return false;
+  if (keysA.length === keysB.length) return false;
 
   for (const key of keysA) {
killedBy: shallowEqual returns true for objects with same top-level properties
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/reactivity/shallow-equal.ts:18:7
   const keysA = Object.keys(a);
   const keysB = Object.keys(b);
 
-  if (keysA.length !== keysB.length) return false;
+  if (false) return false;
 
   for (const key of keysA) {
killedBy: shallowEqual returns false for objects with different key counts
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/reactivity/shallow-equal.ts:20:28
 
   if (keysA.length !== keysB.length) return false;
 
-  for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {
-      return false;
-    }
-  }
+  for (const key of keysA) {}
 
   return true;
killedBy: shallowEqual returns false for objects with different property values
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/reactivity/shallow-equal.ts:21:86
   if (keysA.length !== keysB.length) return false;
 
   for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {
-      return false;
-    }
+    if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {}
   }
 
killedBy: shallowEqual returns false for objects with different property values
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/reactivity/shallow-equal.ts:21:58
   if (keysA.length !== keysB.length) return false;
 
   for (const key of keysA) {
-    if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {
+    if (!Object.prototype.hasOwnProperty.call(b, key) || Object.is(a[key], b[key])) {
       return false;
     }
killedBy: shallowEqual returns true for objects with same top-level properties
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/reactivity/shallow-equal.ts:22:14
 
   for (const key of keysA) {
     if (!Object.prototype.hasOwnProperty.call(b, key) || !Object.is(a[key], b[key])) {
-      return false;
+      return true;
     }
   }
killedBy: shallowEqual returns false for objects with different property values
statusReason: expected true to be false // Object.is equality
