[Killed] BlockStatement
src/reactivity/signals.ts:30:79
  * When a `system` is provided, uses that system's subscriber tracking.
  * Otherwise uses the global alien-signals tracking.
  */
-export function untracked<T>(fn: () => T, system?: ReactiveSystemInstance): T {
-  if (system !== undefined) {
-    const prev = system.getActiveSub();
-    system.setActiveSub(undefined);
-    try {
-      return fn();
-    } finally {
-      system.setActiveSub(prev);
-    }
-  }
-  const prev = alienGetActiveSub();
-  alienSetActiveSub(undefined);
-  try {
-    return fn();
-  } finally {
-    alienSetActiveSub(prev);
-  }
-}
+export function untracked<T>(fn: () => T, system?: ReactiveSystemInstance): T {}
 
 // =============================================================================
killedBy: signals with system vs without system createSignal without system uses global alien-signals
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/signals.ts:31:7
  * Otherwise uses the global alien-signals tracking.
  */
 export function untracked<T>(fn: () => T, system?: ReactiveSystemInstance): T {
-  if (system !== undefined) {
+  if (true) {
     const prev = system.getActiveSub();
     system.setActiveSub(undefined);
killedBy: createSignal peek() reads value without tracking dependency
statusReason: Cannot read properties of undefined (reading 'getActiveSub')

[Killed] BlockStatement
src/reactivity/signals.ts:31:29
  * Otherwise uses the global alien-signals tracking.
  */
 export function untracked<T>(fn: () => T, system?: ReactiveSystemInstance): T {
-  if (system !== undefined) {
-    const prev = system.getActiveSub();
-    system.setActiveSub(undefined);
-    try {
-      return fn();
-    } finally {
-      system.setActiveSub(prev);
-    }
-  }
+  if (system !== undefined) {}
   const prev = alienGetActiveSub();
   alienSetActiveSub(undefined);
killedBy: signals.ts — isolated system paths untracked with system prevents tracking
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:34:9
   if (system !== undefined) {
     const prev = system.getActiveSub();
     system.setActiveSub(undefined);
-    try {
-      return fn();
-    } finally {
+    try {} finally {
       system.setActiveSub(prev);
     }
killedBy: signals.ts — isolated system paths untracked with system prevents tracking
statusReason: expected 2 to be 1 // Object.is equality

[Survived] BlockStatement
src/reactivity/signals.ts:36:15
     system.setActiveSub(undefined);
     try {
       return fn();
-    } finally {
-      system.setActiveSub(prev);
-    }
+    } finally {}
   }
   const prev = alienGetActiveSub();

[Killed] BlockStatement
src/reactivity/signals.ts:42:7
   }
   const prev = alienGetActiveSub();
   alienSetActiveSub(undefined);
-  try {
-    return fn();
-  } finally {
+  try {} finally {
     alienSetActiveSub(prev);
   }
killedBy: signals.ts — isolated system paths createSignal without system uses global alien-signals (different graph)
statusReason: expected undefined to be 15 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:44:13
   alienSetActiveSub(undefined);
   try {
     return fn();
-  } finally {
-    alienSetActiveSub(prev);
-  }
+  } finally {}
 }
 
killedBy: untracked() restores active subscriber even if fn throws
statusReason: expected 100 to be 200 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:70:89
  * @param system - Optional isolated reactive system. When provided, the signal
  *   lives in that system's dependency graph instead of the global one.
  */
-export function createSignal<T>(initial: T, system?: ReactiveSystemInstance): Signal<T> {
-  if (system !== undefined) {
-    const s = system.signal(initial);
-    return {
-      get: () => s(),
-      set: (value: T) => { s(value); },
-      peek: () => untracked(() => s(), system),
-    };
-  }
-  const s = alienSignal(initial);
-  return {
-    get: () => s(),
-    set: (value: T) => { s(value); },
-    peek: () => untracked(() => s()),
-  };
-}
+export function createSignal<T>(initial: T, system?: ReactiveSystemInstance): Signal<T> {}
 
 // =============================================================================
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] EqualityOperator
src/reactivity/signals.ts:71:7
  *   lives in that system's dependency graph instead of the global one.
  */
 export function createSignal<T>(initial: T, system?: ReactiveSystemInstance): Signal<T> {
-  if (system !== undefined) {
+  if (system === undefined) {
     const s = system.signal(initial);
     return {
killedBy: E2E: Async Derived exchange rate transitions idle → loading → success
statusReason: Factory for port 'ExchangeRate' threw: Cannot read properties of undefined (reading 'signal')

[Killed] ConditionalExpression
src/reactivity/signals.ts:71:7
  *   lives in that system's dependency graph instead of the global one.
  */
 export function createSignal<T>(initial: T, system?: ReactiveSystemInstance): Signal<T> {
-  if (system !== undefined) {
+  if (true) {
     const s = system.signal(initial);
     return {
killedBy: signals.ts — isolated system paths createSignal without system uses global alien-signals (different graph)
statusReason: Cannot read properties of undefined (reading 'signal')

[Killed] ObjectLiteral
src/reactivity/signals.ts:73:12
 export function createSignal<T>(initial: T, system?: ReactiveSystemInstance): Signal<T> {
   if (system !== undefined) {
     const s = system.signal(initial);
-    return {
-      get: () => s(),
-      set: (value: T) => { s(value); },
-      peek: () => untracked(() => s(), system),
-    };
+    return {};
   }
   const s = alienSignal(initial);
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: sig.get is not a function

[Killed] ArrowFunction
src/reactivity/signals.ts:74:12
   if (system !== undefined) {
     const s = system.signal(initial);
     return {
-      get: () => s(),
+      get: () => undefined,
       set: (value: T) => { s(value); },
       peek: () => untracked(() => s(), system),
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected undefined to be 10 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:75:26
     const s = system.signal(initial);
     return {
       get: () => s(),
-      set: (value: T) => { s(value); },
+      set: (value: T) => {},
       peek: () => untracked(() => s(), system),
     };
killedBy: signals.ts — isolated system paths createSignal with system uses system's dependency graph (not global)
statusReason: expected 10 to be 20 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:76:29
     return {
       get: () => s(),
       set: (value: T) => { s(value); },
-      peek: () => untracked(() => s(), system),
+      peek: () => untracked(() => undefined, system),
     };
   }
killedBy: signals with system vs without system createSignal with system uses isolated system
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:76:13
     return {
       get: () => s(),
       set: (value: T) => { s(value); },
-      peek: () => untracked(() => s(), system),
+      peek: () => undefined,
     };
   }
killedBy: signals with system vs without system createSignal with system uses isolated system
statusReason: expected undefined to be 20 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:83:11
   return {
     get: () => s(),
     set: (value: T) => { s(value); },
-    peek: () => untracked(() => s()),
+    peek: () => undefined,
   };
 }
killedBy: signals.ts — isolated system paths createSignal without system uses global alien-signals (different graph)
statusReason: expected undefined to be 15 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:83:27
   return {
     get: () => s(),
     set: (value: T) => { s(value); },
-    peek: () => untracked(() => s()),
+    peek: () => untracked(() => undefined),
   };
 }
killedBy: signals with system vs without system createSignal without system uses global alien-signals
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:105:94
  * @param fn - Computation function
  * @param system - Optional isolated reactive system
  */
-export function createComputed<T>(fn: () => T, system?: ReactiveSystemInstance): Computed<T> {
-  if (system !== undefined) {
-    const c = system.computed(fn);
-    return {
-      get: () => c(),
-      peek: () => untracked(() => c(), system),
-    };
-  }
-  const c = alienComputed(fn);
-  return {
-    get: () => c(),
-    peek: () => untracked(() => c()),
-  };
-}
+export function createComputed<T>(fn: () => T, system?: ReactiveSystemInstance): Computed<T> {}
 
 // =============================================================================
killedBy: DerivedService .value returns DeepReadonly<TResult>
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] ConditionalExpression
src/reactivity/signals.ts:106:7
  * @param system - Optional isolated reactive system
  */
 export function createComputed<T>(fn: () => T, system?: ReactiveSystemInstance): Computed<T> {
-  if (system !== undefined) {
+  if (true) {
     const c = system.computed(fn);
     return {
killedBy: createComputed returns computed with lazily evaluated get()
statusReason: Cannot read properties of undefined (reading 'computed')

[Killed] BlockStatement
src/reactivity/signals.ts:106:29
  * @param system - Optional isolated reactive system
  */
 export function createComputed<T>(fn: () => T, system?: ReactiveSystemInstance): Computed<T> {
-  if (system !== undefined) {
-    const c = system.computed(fn);
-    return {
-      get: () => c(),
-      peek: () => untracked(() => c(), system),
-    };
-  }
+  if (system !== undefined) {}
   const c = alienComputed(fn);
   return {
killedBy: signals.ts — isolated system paths createComputed with system uses system's computed
statusReason: expected 6 to be 10 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:109:12
   if (system !== undefined) {
     const c = system.computed(fn);
     return {
-      get: () => c(),
+      get: () => undefined,
       peek: () => untracked(() => c(), system),
     };
killedBy: signals.ts — isolated system paths createComputed with system uses system's computed
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:110:13
     const c = system.computed(fn);
     return {
       get: () => c(),
-      peek: () => untracked(() => c(), system),
+      peek: () => undefined,
     };
   }
killedBy: signals with system vs without system createComputed with system uses isolated system
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:110:29
     const c = system.computed(fn);
     return {
       get: () => c(),
-      peek: () => untracked(() => c(), system),
+      peek: () => untracked(() => undefined, system),
     };
   }
killedBy: signals with system vs without system createComputed with system uses isolated system
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:116:11
   const c = alienComputed(fn);
   return {
     get: () => c(),
-    peek: () => untracked(() => c()),
+    peek: () => undefined,
   };
 }
killedBy: createComputed peek() reads without tracking
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArrowFunction
src/reactivity/signals.ts:116:27
   const c = alienComputed(fn);
   return {
     get: () => c(),
-    peek: () => untracked(() => c()),
+    peek: () => untracked(() => undefined),
   };
 }
killedBy: createComputed peek() reads without tracking
statusReason: expected undefined to be 8 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:138:95
  * @param fn - Effect function (runs immediately and re-runs when deps change)
  * @param system - Optional isolated reactive system
  */
-export function createEffect(fn: () => void, system?: ReactiveSystemInstance): ReactiveEffect {
-  let disposed = false;
-  const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
-
-  return {
-    run: () => {
-      if (!disposed) {
-        fn();
-      }
-    },
-    dispose: () => {
-      if (!disposed) {
-        disposed = true;
-        stop();
-      }
-    },
-  };
-}
+export function createEffect(fn: () => void, system?: ReactiveSystemInstance): ReactiveEffect {}
 
 // =============================================================================
killedBy: signals with system vs without system createEffect with system uses isolated system
statusReason: expected [] to deeply equal [ +0 ]

[Killed] BooleanLiteral
src/reactivity/signals.ts:139:18
  * @param system - Optional isolated reactive system
  */
 export function createEffect(fn: () => void, system?: ReactiveSystemInstance): ReactiveEffect {
-  let disposed = false;
+  let disposed = true;
   const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
 
killedBy: createEffect dispose() stops re-runs
statusReason: expected [ +0, 1 ] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/reactivity/signals.ts:140:16
  */
 export function createEffect(fn: () => void, system?: ReactiveSystemInstance): ReactiveEffect {
   let disposed = false;
-  const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
+  const stop = true ? system.effect(fn) : alienEffect(fn);
 
   return {
killedBy: signals with system vs without system createEffect without system uses global alien-signals
statusReason: Cannot read properties of undefined (reading 'effect')

[Killed] EqualityOperator
src/reactivity/signals.ts:140:16
  */
 export function createEffect(fn: () => void, system?: ReactiveSystemInstance): ReactiveEffect {
   let disposed = false;
-  const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
+  const stop = system === undefined ? system.effect(fn) : alienEffect(fn);
 
   return {
killedBy: signals with system vs without system createEffect with system uses isolated system
statusReason: expected [ +0 ] to include 1

[Killed] ObjectLiteral
src/reactivity/signals.ts:142:10
   let disposed = false;
   const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
 
-  return {
-    run: () => {
-      if (!disposed) {
-        fn();
-      }
-    },
-    dispose: () => {
-      if (!disposed) {
-        disposed = true;
-        stop();
-      }
-    },
-  };
+  return {};
 }
 
killedBy: signals with system vs without system createEffect with system uses isolated system
statusReason: eff.dispose is not a function

[Killed] BlockStatement
src/reactivity/signals.ts:143:16
   const stop = system !== undefined ? system.effect(fn) : alienEffect(fn);
 
   return {
-    run: () => {
-      if (!disposed) {
-        fn();
-      }
-    },
+    run: () => {},
     dispose: () => {
       if (!disposed) {
killedBy: createEffect dispose edge cases effect.run() before dispose DOES invoke fn
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/reactivity/signals.ts:144:11
 
   return {
     run: () => {
-      if (!disposed) {
+      if (disposed) {
         fn();
       }
killedBy: signals with system vs without system disposed effect run() is a no-op
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/reactivity/signals.ts:144:11
 
   return {
     run: () => {
-      if (!disposed) {
+      if (false) {
         fn();
       }
killedBy: createEffect dispose edge cases effect.run() before dispose DOES invoke fn
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:148:20
         fn();
       }
     },
-    dispose: () => {
-      if (!disposed) {
-        disposed = true;
-        stop();
-      }
-    },
+    dispose: () => {},
   };
 }
killedBy: createEffect dispose() stops re-runs
statusReason: expected [ +0, 1 ] to deeply equal [ +0 ]

[Killed] ConditionalExpression
src/reactivity/signals.ts:149:11
       }
     },
     dispose: () => {
-      if (!disposed) {
+      if (false) {
         disposed = true;
         stop();
killedBy: signals with system vs without system disposed effect run() is a no-op
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/reactivity/signals.ts:149:22
       }
     },
     dispose: () => {
-      if (!disposed) {
-        disposed = true;
-        stop();
-      }
+      if (!disposed) {}
     },
   };
killedBy: signals with system vs without system disposed effect run() is a no-op
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/reactivity/signals.ts:150:20
     },
     dispose: () => {
       if (!disposed) {
-        disposed = true;
+        disposed = false;
         stop();
       }
killedBy: signals with system vs without system disposed effect run() is a no-op
statusReason: expected 2 to be 1 // Object.is equality
