[Killed] BlockStatement
src/services/derived-service-impl.ts:36:56
 export function createDerivedServiceImpl<TResult>(
   config: DerivedServiceConfig<TResult>,
 ): DerivedServiceInternal<TResult> {
-  const comp: Computed<TResult> = createComputed(() => {
-    tryCatch(
-      () => { config.tracingHook?.onDerivedRecompute?.(config.portName, config.containerName); },
-      () => undefined,
-    );
-    // tryCatch handles the try/catch internally; our code is try/catch-free.
-    // createComputed requires synchronous return, so re-throw on Err.
-    const result = tryCatch(config.select, (cause) => {
-      if (isCircularDerivedDependency(cause)) throw cause;
-      return DerivedComputationFailed({ portName: config.portName, cause });
-    });
-    const ok = result.isOk();
-    tryCatch(
-      () => { config.tracingHook?.onDerivedRecomputeEnd?.(ok); },
-      () => undefined,
-    );
-    if (result.isErr()) throw result.error;
-    config.inspector?.emit({ type: "state-changed", portName: config.portName });
-    return result.value;
-  }, config.reactiveSystem);
+  const comp: Computed<TResult> = createComputed(() => {}, config.reactiveSystem);
 
   let disposed = false;
killedBy: Container + GraphBuilder integration state + derived adapters: derived tracks state changes
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/services/derived-service-impl.ts:38:13
 ): DerivedServiceInternal<TResult> {
   const comp: Computed<TResult> = createComputed(() => {
     tryCatch(
-      () => { config.tracingHook?.onDerivedRecompute?.(config.portName, config.containerName); },
+      () => {},
       () => undefined,
     );
killedBy: DerivedService tracing hooks calls onDerivedRecompute and onDerivedRecomputeEnd on recomputation
statusReason: expected 1 to be greater than or equal to 2

[Survived] OptionalChaining
src/services/derived-service-impl.ts:38:15
 ): DerivedServiceInternal<TResult> {
   const comp: Computed<TResult> = createComputed(() => {
     tryCatch(
-      () => { config.tracingHook?.onDerivedRecompute?.(config.portName, config.containerName); },
+      () => { config.tracingHook.onDerivedRecompute?.(config.portName, config.containerName); },
       () => undefined,
     );

[Killed] BlockStatement
src/services/derived-service-impl.ts:43:55
     );
     // tryCatch handles the try/catch internally; our code is try/catch-free.
     // createComputed requires synchronous return, so re-throw on Err.
-    const result = tryCatch(config.select, (cause) => {
-      if (isCircularDerivedDependency(cause)) throw cause;
-      return DerivedComputationFailed({ portName: config.portName, cause });
-    });
+    const result = tryCatch(config.select, (cause) => {});
     const ok = result.isOk();
     tryCatch(
killedBy: DerivedService circular detection self-referencing derived throws CircularDerivedDependency
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/services/derived-service-impl.ts:45:39
     // createComputed requires synchronous return, so re-throw on Err.
     const result = tryCatch(config.select, (cause) => {
       if (isCircularDerivedDependency(cause)) throw cause;
-      return DerivedComputationFailed({ portName: config.portName, cause });
+      return DerivedComputationFailed({});
     });
     const ok = result.isOk();
killedBy: DerivedService — DerivedComputationFailed on select throw wraps non-circular error in DerivedComputationFailed
statusReason: expected { …(4) } to have property "portName" with value 'Broken'

[Killed] BlockStatement
src/services/derived-service-impl.ts:49:13
     });
     const ok = result.isOk();
     tryCatch(
-      () => { config.tracingHook?.onDerivedRecomputeEnd?.(ok); },
+      () => {},
       () => undefined,
     );
killedBy: DerivedService — tracing hooks calls onDerivedRecompute and onDerivedRecomputeEnd on value access
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Survived] OptionalChaining
src/services/derived-service-impl.ts:49:15
     });
     const ok = result.isOk();
     tryCatch(
-      () => { config.tracingHook?.onDerivedRecomputeEnd?.(ok); },
+      () => { config.tracingHook.onDerivedRecomputeEnd?.(ok); },
       () => undefined,
     );

[Killed] ConditionalExpression
src/services/derived-service-impl.ts:52:9
       () => { config.tracingHook?.onDerivedRecomputeEnd?.(ok); },
       () => undefined,
     );
-    if (result.isErr()) throw result.error;
+    if (true) throw result.error;
     config.inspector?.emit({ type: "state-changed", portName: config.portName });
     return result.value;
killedBy: DerivedService — tracing hooks calls onDerivedRecompute and onDerivedRecomputeEnd on value access
statusReason: undefined

[Killed] ConditionalExpression
src/services/derived-service-impl.ts:52:9
       () => { config.tracingHook?.onDerivedRecomputeEnd?.(ok); },
       () => undefined,
     );
-    if (result.isErr()) throw result.error;
+    if (false) throw result.error;
     config.inspector?.emit({ type: "state-changed", portName: config.portName });
     return result.value;
killedBy: DerivedService tracing hooks calls onDerivedRecomputeEnd with false when select throws
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/services/derived-service-impl.ts:53:5
       () => undefined,
     );
     if (result.isErr()) throw result.error;
-    config.inspector?.emit({ type: "state-changed", portName: config.portName });
+    config.inspector.emit({ type: "state-changed", portName: config.portName });
     return result.value;
   }, config.reactiveSystem);
killedBy: DerivedService — tracing hooks calls onDerivedRecompute and onDerivedRecomputeEnd on value access
statusReason: Cannot read properties of undefined (reading 'emit')

[Killed] BlockStatement
src/services/derived-service-impl.ts:61:66
   const activeEffects: Array<{ dispose(): void }> = [];
   let _subscriberCount = 0;
 
-  function checkDisposed(operation: "value" | "subscribe"): void {
-    if (disposed) {
-      throw DisposedStateAccess({ portName: config.portName, containerName: config.containerName, operation });
-    }
-  }
+  function checkDisposed(operation: "value" | "subscribe"): void {}
 
   return {
killedBy: DerivedService extended subscribe after dispose throws DisposedStateAccessError
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/services/derived-service-impl.ts:62:9
   let _subscriberCount = 0;
 
   function checkDisposed(operation: "value" | "subscribe"): void {
-    if (disposed) {
+    if (true) {
       throw DisposedStateAccess({ portName: config.portName, containerName: config.containerName, operation });
     }
killedBy: DerivedService — tracing hooks calls onDerivedRecompute and onDerivedRecomputeEnd on value access
statusReason: Cannot access 'value' on port 'Double' from disposed container 'root'.

[Killed] BlockStatement
src/services/derived-service-impl.ts:62:19
   let _subscriberCount = 0;
 
   function checkDisposed(operation: "value" | "subscribe"): void {
-    if (disposed) {
-      throw DisposedStateAccess({ portName: config.portName, containerName: config.containerName, operation });
-    }
+    if (disposed) {}
   }
 
killedBy: DerivedService extended subscribe after dispose throws DisposedStateAccessError
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/services/derived-service-impl.ts:69:21
 
   return {
     get value(): DeepReadonly<TResult> {
-      checkDisposed("value");
+      checkDisposed("");
       return withCycleDetection(config.portName, () => deepFreeze(comp.get()));
     },
killedBy: DisposedStateAccessError operation field verification DerivedService: value operation
statusReason: expected '' to be 'value' // Object.is equality

[Killed] BlockStatement
src/services/derived-service-impl.ts:75:20
 
     subscribe(
       listener: (value: DeepReadonly<TResult>, prev: DeepReadonly<TResult>) => void,
-    ): Unsubscribe {
-      checkDisposed("subscribe");
-      const equalityFn = config.equals ?? Object.is;
-      let prevSnapshot = deepFreeze(comp.get());
-      _subscriberCount++;
-      const eff = createEffect(() => {
-        const currentSnapshot = deepFreeze(comp.get());
-        if (!equalityFn(currentSnapshot, prevSnapshot)) {
-          const prev = prevSnapshot;
-          prevSnapshot = currentSnapshot;
-          listener(currentSnapshot, prev);
-        }
-      }, config.reactiveSystem);
-      activeEffects.push(eff);
-      return () => {
-        eff.dispose();
-        _subscriberCount--;
-        const idx = activeEffects.indexOf(eff);
-        if (idx >= 0) activeEffects.splice(idx, 1);
-      };
-    },
+    ): Unsubscribe {},
 
     get isDisposed() { return disposed; },
killedBy: DerivedService .subscribe(listener) fires on recomputation
statusReason: expected [] to deeply equal [ 20 ]

[Killed] StringLiteral
src/services/derived-service-impl.ts:76:21
     subscribe(
       listener: (value: DeepReadonly<TResult>, prev: DeepReadonly<TResult>) => void,
     ): Unsubscribe {
-      checkDisposed("subscribe");
+      checkDisposed("");
       const equalityFn = config.equals ?? Object.is;
       let prevSnapshot = deepFreeze(comp.get());
killedBy: DisposedStateAccessError operation field verification DerivedService: subscribe operation
statusReason: expected '' to be 'subscribe' // Object.is equality

[Killed] LogicalOperator
src/services/derived-service-impl.ts:77:26
       listener: (value: DeepReadonly<TResult>, prev: DeepReadonly<TResult>) => void,
     ): Unsubscribe {
       checkDisposed("subscribe");
-      const equalityFn = config.equals ?? Object.is;
+      const equalityFn = config.equals && Object.is;
       let prevSnapshot = deepFreeze(comp.get());
       _subscriberCount++;
killedBy: DerivedService .subscribe(listener) fires on recomputation
statusReason: equalityFn is not a function

[Killed] BlockStatement
src/services/derived-service-impl.ts:80:38
       const equalityFn = config.equals ?? Object.is;
       let prevSnapshot = deepFreeze(comp.get());
       _subscriberCount++;
-      const eff = createEffect(() => {
-        const currentSnapshot = deepFreeze(comp.get());
-        if (!equalityFn(currentSnapshot, prevSnapshot)) {
-          const prev = prevSnapshot;
-          prevSnapshot = currentSnapshot;
-          listener(currentSnapshot, prev);
-        }
-      }, config.reactiveSystem);
+      const eff = createEffect(() => {}, config.reactiveSystem);
       activeEffects.push(eff);
       return () => {
killedBy: DerivedService — custom equality function uses custom equals to suppress duplicate notifications
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/services/derived-service-impl.ts:82:57
       _subscriberCount++;
       const eff = createEffect(() => {
         const currentSnapshot = deepFreeze(comp.get());
-        if (!equalityFn(currentSnapshot, prevSnapshot)) {
-          const prev = prevSnapshot;
-          prevSnapshot = currentSnapshot;
-          listener(currentSnapshot, prev);
-        }
+        if (!equalityFn(currentSnapshot, prevSnapshot)) {}
       }, config.reactiveSystem);
       activeEffects.push(eff);
killedBy: DerivedService — custom equality function uses custom equals to suppress duplicate notifications
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/services/derived-service-impl.ts:82:13
       _subscriberCount++;
       const eff = createEffect(() => {
         const currentSnapshot = deepFreeze(comp.get());
-        if (!equalityFn(currentSnapshot, prevSnapshot)) {
+        if (equalityFn(currentSnapshot, prevSnapshot)) {
           const prev = prevSnapshot;
           prevSnapshot = currentSnapshot;
killedBy: DerivedService .subscribe(listener) fires on recomputation
statusReason: expected [ 10 ] to deeply equal [ 20 ]
