[Killed] EqualityOperator
src/utils/deep-freeze.ts:10:10
 import type { DeepReadonly } from "../types/deep-readonly.js";
 
 function isRecord(val: unknown): val is Record<string, unknown> {
-  return typeof val === "object" && val !== null;
+  return typeof val !== "object" && val !== null;
 }
 
killedBy: StateService .state returns frozen object
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/deep-freeze.ts:19:51
  * Primitives and already-frozen objects pass through without modification.
  */
 export function deepFreeze<T>(obj: T): DeepReadonly<T>;
-export function deepFreeze(obj: unknown): unknown {
-  if (!isRecord(obj)) return obj;
-  if (Object.isFrozen(obj)) return obj;
-
-  Object.freeze(obj);
-
-  for (const value of Object.values(obj)) {
-    if (isRecord(value) && !Object.isFrozen(value)) {
-      deepFreeze(value);
-    }
-  }
-
-  return obj;
-}
+export function deepFreeze(obj: unknown): unknown {}
 
killedBy: StateService .state returns DeepReadonly<TState>
statusReason: expected undefined to deeply equal { count: +0 }

[Killed] BooleanLiteral
src/utils/deep-freeze.ts:20:7
  */
 export function deepFreeze<T>(obj: T): DeepReadonly<T>;
 export function deepFreeze(obj: unknown): unknown {
-  if (!isRecord(obj)) return obj;
+  if (isRecord(obj)) return obj;
   if (Object.isFrozen(obj)) return obj;
 
killedBy: deepFreeze freezes a plain object
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/deep-freeze.ts:20:7
  */
 export function deepFreeze<T>(obj: T): DeepReadonly<T>;
 export function deepFreeze(obj: unknown): unknown {
-  if (!isRecord(obj)) return obj;
+  if (false) return obj;
   if (Object.isFrozen(obj)) return obj;
 
killedBy: deepFreeze isRecord guard rejects functions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/deep-freeze.ts:21:7
 export function deepFreeze<T>(obj: T): DeepReadonly<T>;
 export function deepFreeze(obj: unknown): unknown {
   if (!isRecord(obj)) return obj;
-  if (Object.isFrozen(obj)) return obj;
+  if (false) return obj;
 
   Object.freeze(obj);
killedBy: deepFreeze already-frozen top-level object returns immediately
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/deep-freeze.ts:21:7
 export function deepFreeze<T>(obj: T): DeepReadonly<T>;
 export function deepFreeze(obj: unknown): unknown {
   if (!isRecord(obj)) return obj;
-  if (Object.isFrozen(obj)) return obj;
+  if (true) return obj;
 
   Object.freeze(obj);
killedBy: StateService .state returns frozen object
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/deep-freeze.ts:25:43
 
   Object.freeze(obj);
 
-  for (const value of Object.values(obj)) {
-    if (isRecord(value) && !Object.isFrozen(value)) {
-      deepFreeze(value);
-    }
-  }
+  for (const value of Object.values(obj)) {}
 
   return obj;
killedBy: deepFreeze — edge cases freezes nested objects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/deep-freeze.ts:26:53
   Object.freeze(obj);
 
   for (const value of Object.values(obj)) {
-    if (isRecord(value) && !Object.isFrozen(value)) {
-      deepFreeze(value);
-    }
+    if (isRecord(value) && !Object.isFrozen(value)) {}
   }
 
killedBy: deepFreeze — edge cases freezes nested objects
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/deep-freeze.ts:26:9
   Object.freeze(obj);
 
   for (const value of Object.values(obj)) {
-    if (isRecord(value) && !Object.isFrozen(value)) {
+    if (false) {
       deepFreeze(value);
     }
killedBy: deepFreeze — edge cases freezes nested objects
statusReason: expected false to be true // Object.is equality
