[Killed] BlockStatement
src/adapters/guards.ts:30:63
  * }
  * ```
  */
-export function isLifetime(value: unknown): value is Lifetime {
-  return value === "singleton" || value === "scoped" || value === "transient";
-}
+export function isLifetime(value: unknown): value is Lifetime {}
 
 /**
killedBy: isLifetime() returns true for 'singleton'
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:31:10
  * ```
  */
 export function isLifetime(value: unknown): value is Lifetime {
-  return value === "singleton" || value === "scoped" || value === "transient";
+  return false || value === "transient";
 }
 
killedBy: isLifetime() returns true for 'singleton'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:31:10
  * ```
  */
 export function isLifetime(value: unknown): value is Lifetime {
-  return value === "singleton" || value === "scoped" || value === "transient";
+  return false;
 }
 
killedBy: isLifetime() returns true for 'singleton'
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/adapters/guards.ts:47:69
  * }
  * ```
  */
-export function isFactoryKind(value: unknown): value is FactoryKind {
-  return value === "sync" || value === "async";
-}
+export function isFactoryKind(value: unknown): value is FactoryKind {}
 
 // =============================================================================
killedBy: isFactoryKind() returns true for 'sync'
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:48:30
  * ```
  */
 export function isFactoryKind(value: unknown): value is FactoryKind {
-  return value === "sync" || value === "async";
+  return value === "sync" || false;
 }
 
killedBy: isFactoryKind() returns true for 'async'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:48:10
  * ```
  */
 export function isFactoryKind(value: unknown): value is FactoryKind {
-  return value === "sync" || value === "async";
+  return false;
 }
 
killedBy: isFactoryKind() returns true for 'sync'
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/adapters/guards.ts:59:66
  * Checks if a value is a Port object.
  * @internal
  */
-function isPort(value: unknown): value is { __portName: string } {
-  if (value === null || typeof value !== "object") return false;
-  return "__portName" in value && typeof value.__portName === "string";
-}
+function isPort(value: unknown): value is { __portName: string } {}
 
 /**
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:60:59
  * @internal
  */
 function isPort(value: unknown): value is { __portName: string } {
-  if (value === null || typeof value !== "object") return false;
+  if (value === null || typeof value !== "object") return true;
   return "__portName" in value && typeof value.__portName === "string";
 }
killedBy: isAdapter() returns false when 'provides' is null
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:60:7
  * @internal
  */
 function isPort(value: unknown): value is { __portName: string } {
-  if (value === null || typeof value !== "object") return false;
+  if (true) return false;
   return "__portName" in value && typeof value.__portName === "string";
 }
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/adapters/guards.ts:61:10
  */
 function isPort(value: unknown): value is { __portName: string } {
   if (value === null || typeof value !== "object") return false;
-  return "__portName" in value && typeof value.__portName === "string";
+  return "__portName" in value || typeof value.__portName === "string";
 }
 
killedBy: isAdapter() returns false when provides __portName is not a string
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:61:10
  */
 function isPort(value: unknown): value is { __portName: string } {
   if (value === null || typeof value !== "object") return false;
-  return "__portName" in value && typeof value.__portName === "string";
+  return true;
 }
 
killedBy: isAdapter() returns false when 'provides' is not a port (no __portName)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/adapters/guards.ts:94:25
  * ```
  */
 export function isAdapter(value: unknown): value is AdapterConstraint {
-  if (value === null || typeof value !== "object") return false;
+  if (value === null || typeof value === "object") return false;
 
   // Check provides property
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:94:25
  * ```
  */
 export function isAdapter(value: unknown): value is AdapterConstraint {
-  if (value === null || typeof value !== "object") return false;
+  if (value === null || false) return false;
 
   // Check provides property
killedBy: isAdapter() returns false for undefined
statusReason: Cannot use 'in' operator to search for 'provides' in undefined

[Killed] BooleanLiteral
src/adapters/guards.ts:97:7
   if (value === null || typeof value !== "object") return false;
 
   // Check provides property
-  if (!("provides" in value) || !isPort(value.provides)) return false;
+  if ("provides" in value || !isPort(value.provides)) return false;
 
   // Check requires property
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:97:7
   if (value === null || typeof value !== "object") return false;
 
   // Check provides property
-  if (!("provides" in value) || !isPort(value.provides)) return false;
+  if (false) return false;
 
   // Check requires property
killedBy: isAdapter() returns false when 'provides' is missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:100:7
   if (!("provides" in value) || !isPort(value.provides)) return false;
 
   // Check requires property
-  if (!("requires" in value) || !Array.isArray(value.requires)) return false;
+  if (true) return false;
   for (const req of value.requires) {
     if (!isPort(req)) return false;
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:100:72
   if (!("provides" in value) || !isPort(value.provides)) return false;
 
   // Check requires property
-  if (!("requires" in value) || !Array.isArray(value.requires)) return false;
+  if (!("requires" in value) || !Array.isArray(value.requires)) return true;
   for (const req of value.requires) {
     if (!isPort(req)) return false;
killedBy: isAdapter() returns false when 'requires' is not an array
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/adapters/guards.ts:101:37
 
   // Check requires property
   if (!("requires" in value) || !Array.isArray(value.requires)) return false;
-  for (const req of value.requires) {
-    if (!isPort(req)) return false;
-  }
+  for (const req of value.requires) {}
 
   // Check lifetime property
killedBy: isAdapter() returns false when 'requires' contains non-port element
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:102:9
   // Check requires property
   if (!("requires" in value) || !Array.isArray(value.requires)) return false;
   for (const req of value.requires) {
-    if (!isPort(req)) return false;
+    if (isPort(req)) return false;
   }
 
killedBy: isAdapter() returns true for a valid adapter with all fields explicit
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:102:30
   // Check requires property
   if (!("requires" in value) || !Array.isArray(value.requires)) return false;
   for (const req of value.requires) {
-    if (!isPort(req)) return false;
+    if (!isPort(req)) return true;
   }
 
killedBy: isAdapter() returns false when 'requires' contains non-port element
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:106:69
   }
 
   // Check lifetime property
-  if (!("lifetime" in value) || !isLifetime(value.lifetime)) return false;
+  if (!("lifetime" in value) || !isLifetime(value.lifetime)) return true;
 
   // Check factoryKind property
killedBy: isAdapter() returns false when 'lifetime' is invalid
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/adapters/guards.ts:106:7
   }
 
   // Check lifetime property
-  if (!("lifetime" in value) || !isLifetime(value.lifetime)) return false;
+  if ("lifetime" in value || !isLifetime(value.lifetime)) return false;
 
   // Check factoryKind property
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:109:7
   if (!("lifetime" in value) || !isLifetime(value.lifetime)) return false;
 
   // Check factoryKind property
-  if (!("factoryKind" in value) || !isFactoryKind(value.factoryKind)) return false;
+  if (true) return false;
 
   // Check factory property
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/adapters/guards.ts:109:7
   if (!("lifetime" in value) || !isLifetime(value.lifetime)) return false;
 
   // Check factoryKind property
-  if (!("factoryKind" in value) || !isFactoryKind(value.factoryKind)) return false;
+  if (!("factoryKind" in value) && !isFactoryKind(value.factoryKind)) return false;
 
   // Check factory property
killedBy: isAdapter() returns false when 'factoryKind' is invalid
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:112:32
   if (!("factoryKind" in value) || !isFactoryKind(value.factoryKind)) return false;
 
   // Check factory property
-  if (!("factory" in value) || typeof value.factory !== "function") return false;
+  if (!("factory" in value) || false) return false;
 
   // Check clonable property
killedBy: isAdapter() returns false when 'factory' is not a function
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:112:7
   if (!("factoryKind" in value) || !isFactoryKind(value.factoryKind)) return false;
 
   // Check factory property
-  if (!("factory" in value) || typeof value.factory !== "function") return false;
+  if (true) return false;
 
   // Check clonable property
killedBy: isAdapter() returns true for a valid adapter created by createAdapter
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/adapters/guards.ts:115:7
   if (!("factory" in value) || typeof value.factory !== "function") return false;
 
   // Check clonable property
-  if (!("clonable" in value) || typeof value.clonable !== "boolean") return false;
+  if (!("clonable" in value) && typeof value.clonable !== "boolean") return false;
 
   return true;
killedBy: isAdapter() returns false when 'clonable' is not a boolean
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/adapters/guards.ts:115:33
   if (!("factory" in value) || typeof value.factory !== "function") return false;
 
   // Check clonable property
-  if (!("clonable" in value) || typeof value.clonable !== "boolean") return false;
+  if (!("clonable" in value) || false) return false;
 
   return true;
killedBy: isAdapter() returns false when 'clonable' is not a boolean
statusReason: expected true to be false // Object.is equality
