[Killed] BlockStatement
src/context/variables.ts:53:94
  * const retryCount = createContextVariable('retryCount', 3);
  * ```
  */
-export function createContextVariable<T>(name: string, defaultValue?: T): ContextVariable<T> {
-  return {
-    id: Symbol(name),
-    defaultValue,
-  };
-}
+export function createContextVariable<T>(name: string, defaultValue?: T): ContextVariable<T> {}
 
killedBy: Context Variables createContextVariable creates a context variable with unique symbol ID
statusReason: Cannot read properties of undefined (reading 'id')
