[Killed] LogicalOperator
src/errors/parsing.ts:209:11
 
     const details: DepthLimitExceededDetails = {
       maxDepth: depthLimitMatch.groups.maxDepth,
-      ...(startPortMatch?.groups?.startPort && { startPort: startPortMatch.groups.startPort }),
+      ...(startPortMatch?.groups?.startPort || {
+  startPort: startPortMatch.groups.startPort
+}),
       ...(lastPortMatch?.groups?.lastPort && { lastPort: lastPortMatch.groups.lastPort }),
     };
killedBy: parseError() - HEX007: Depth Limit Exceeded parses depth limit warning with all details
statusReason: expected { '0': 'D', '1': 'e', '2': 'e', …(10) } to deeply equal { maxDepth: '10', …(2) }

[Killed] OptionalChaining
src/errors/parsing.ts:209:11
 
     const details: DepthLimitExceededDetails = {
       maxDepth: depthLimitMatch.groups.maxDepth,
-      ...(startPortMatch?.groups?.startPort && { startPort: startPortMatch.groups.startPort }),
+      ...(startPortMatch.groups?.startPort && { startPort: startPortMatch.groups.startPort }),
       ...(lastPortMatch?.groups?.lastPort && { lastPort: lastPortMatch.groups.lastPort }),
     };
killedBy: parseError() - HEX007: Depth Limit Exceeded parses depth limit warning with only maxDepth
statusReason: Cannot read properties of null (reading 'groups')

[Killed] LogicalOperator
src/errors/parsing.ts:210:11
     const details: DepthLimitExceededDetails = {
       maxDepth: depthLimitMatch.groups.maxDepth,
       ...(startPortMatch?.groups?.startPort && { startPort: startPortMatch.groups.startPort }),
-      ...(lastPortMatch?.groups?.lastPort && { lastPort: lastPortMatch.groups.lastPort }),
+      ...(lastPortMatch?.groups?.lastPort || {
+  lastPort: lastPortMatch.groups.lastPort
+}),
     };
 
killedBy: parseError() - HEX007: Depth Limit Exceeded parses depth limit warning with all details
statusReason: expected { '0': 'S', '1': 'e', '2': 'r', …(8) } to deeply equal { maxDepth: '10', …(2) }

[Killed] OptionalChaining
src/errors/parsing.ts:210:11
     const details: DepthLimitExceededDetails = {
       maxDepth: depthLimitMatch.groups.maxDepth,
       ...(startPortMatch?.groups?.startPort && { startPort: startPortMatch.groups.startPort }),
-      ...(lastPortMatch?.groups?.lastPort && { lastPort: lastPortMatch.groups.lastPort }),
+      ...(lastPortMatch.groups?.lastPort && { lastPort: lastPortMatch.groups.lastPort }),
     };
 
killedBy: parseError() - HEX007: Depth Limit Exceeded parses depth limit warning with only maxDepth
statusReason: Cannot read properties of null (reading 'groups')

[Killed] Regex
src/errors/parsing.ts:222:5
 
   // Missing dependency (HEX008)
   const missingMatch = message.match(
-    /ERROR\[HEX008\]: Missing adapters? for (?<missingPorts>[^.]+)\./
+    /ERROR\[HEX008\]: Missing adapters? for (?<missingPorts>[^.])\./
   );
   if (missingMatch?.groups) {
killedBy: parseError() - HEX008: Missing Dependency parses missing adapter error (singular)
statusReason: expected 'UNKNOWN_ERROR' to be 'MISSING_DEPENDENCY' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:222:5
 
   // Missing dependency (HEX008)
   const missingMatch = message.match(
-    /ERROR\[HEX008\]: Missing adapters? for (?<missingPorts>[^.]+)\./
+    /ERROR\[HEX008\]: Missing adapters for (?<missingPorts>[^.]+)\./
   );
   if (missingMatch?.groups) {
killedBy: parseError() - HEX008: Missing Dependency parses missing adapter error (singular)
statusReason: expected 'UNKNOWN_ERROR' to be 'MISSING_DEPENDENCY' // Object.is equality

[Killed] OptionalChaining
src/errors/parsing.ts:224:7
   const missingMatch = message.match(
     /ERROR\[HEX008\]: Missing adapters? for (?<missingPorts>[^.]+)\./
   );
-  if (missingMatch?.groups) {
+  if (missingMatch.groups) {
     return {
       code: ErrorCode.MISSING_DEPENDENCY,
killedBy: parseError() - HEX009: Override Without Parent parses override without parent error
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:224:7
   const missingMatch = message.match(
     /ERROR\[HEX008\]: Missing adapters? for (?<missingPorts>[^.]+)\./
   );
-  if (missingMatch?.groups) {
+  if (false) {
     return {
       code: ErrorCode.MISSING_DEPENDENCY,
killedBy: parseError() - HEX008: Missing Dependency parses missing adapter error (singular)
statusReason: expected 'UNKNOWN_ERROR' to be 'MISSING_DEPENDENCY' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:233:7
   }
 
   // Override without parent (HEX009)
-  if (message.match(/ERROR\[HEX009\]: Cannot use override\(\) without forParent\(\)/)) {
+  if (true) {
     return {
       code: ErrorCode.OVERRIDE_WITHOUT_PARENT,
killedBy: parseError() - HEX010: Missing Provides parses missing provides error
statusReason: expected 'OVERRIDE_WITHOUT_PARENT' to be 'MISSING_PROVIDES' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:233:88
   }
 
   // Override without parent (HEX009)
-  if (message.match(/ERROR\[HEX009\]: Cannot use override\(\) without forParent\(\)/)) {
-    return {
-      code: ErrorCode.OVERRIDE_WITHOUT_PARENT,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX009\]: Cannot use override\(\) without forParent\(\)/)) {}
 
   // Missing provides (HEX010)
killedBy: parseError() - HEX009: Override Without Parent parses override without parent error
statusReason: expected 'UNKNOWN_ERROR' to be 'OVERRIDE_WITHOUT_PARENT' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:242:41
   }
 
   // Missing provides (HEX010)
-  if (message.match(/ERROR\[HEX010\]/)) {
-    return {
-      code: ErrorCode.MISSING_PROVIDES,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX010\]/)) {}
 
   // Invalid provides (HEX011)
killedBy: parseError() - HEX010: Missing Provides parses missing provides error
statusReason: expected 'UNKNOWN_ERROR' to be 'MISSING_PROVIDES' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:242:7
   }
 
   // Missing provides (HEX010)
-  if (message.match(/ERROR\[HEX010\]/)) {
+  if (true) {
     return {
       code: ErrorCode.MISSING_PROVIDES,
killedBy: parseError() - HEX011: Invalid Provides parses invalid provides error with actual type
statusReason: expected 'MISSING_PROVIDES' to be 'INVALID_PROVIDES' // Object.is equality

[Killed] ObjectLiteral
src/errors/parsing.ts:243:12
 
   // Missing provides (HEX010)
   if (message.match(/ERROR\[HEX010\]/)) {
-    return {
-      code: ErrorCode.MISSING_PROVIDES,
-      message,
-      details: {},
-    };
+    return {};
   }
 
killedBy: parseError() - HEX010: Missing Provides parses missing provides error
statusReason: expected undefined to be 'MISSING_PROVIDES' // Object.is equality

[Killed] OptionalChaining
src/errors/parsing.ts:252:7
 
   // Invalid provides (HEX011)
   const invalidProvidesMatch = message.match(/ERROR\[HEX011\]:.*Got: (?<actualType>\w+)/);
-  if (invalidProvidesMatch?.groups) {
+  if (invalidProvidesMatch.groups) {
     return {
       code: ErrorCode.INVALID_PROVIDES,
killedBy: parseError() - HEX011: Invalid Provides parses invalid provides error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:252:7
 
   // Invalid provides (HEX011)
   const invalidProvidesMatch = message.match(/ERROR\[HEX011\]:.*Got: (?<actualType>\w+)/);
-  if (invalidProvidesMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_PROVIDES,
killedBy: parseError() - HEX011: Invalid Provides parses invalid provides error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:259:7
       details: { actualType: invalidProvidesMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX011\]/)) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_PROVIDES,
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error with actual type
statusReason: expected 'INVALID_PROVIDES' to be 'INVALID_REQUIRES_TYPE' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:259:41
       details: { actualType: invalidProvidesMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX011\]/)) {
-    return {
-      code: ErrorCode.INVALID_PROVIDES,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX011\]/)) {}
 
   // Invalid requires type (HEX012)
killedBy: parseError() - HEX011: Invalid Provides parses invalid provides error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_PROVIDES' // Object.is equality

[Killed] ObjectLiteral
src/errors/parsing.ts:260:12
     };
   }
   if (message.match(/ERROR\[HEX011\]/)) {
-    return {
-      code: ErrorCode.INVALID_PROVIDES,
-      message,
-      details: {},
-    };
+    return {};
   }
 
killedBy: parseError() - HEX011: Invalid Provides parses invalid provides error without actual type
statusReason: expected undefined to be 'INVALID_PROVIDES' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:268:50
   }
 
   // Invalid requires type (HEX012)
-  const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.*Got: (?<actualType>\w+)/);
+  const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.*Got: (?<actualType>\W+)/);
   if (invalidRequiresTypeMatch?.groups) {
     return {
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error with actual type
statusReason: expected {} to deeply equal { actualType: 'object' }

[Killed] Regex
src/errors/parsing.ts:268:50
   }
 
   // Invalid requires type (HEX012)
-  const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.*Got: (?<actualType>\w+)/);
+  const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.Got: (?<actualType>\w+)/);
   if (invalidRequiresTypeMatch?.groups) {
     return {
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error with actual type
statusReason: expected {} to deeply equal { actualType: 'object' }

[Killed] ConditionalExpression
src/errors/parsing.ts:269:7
 
   // Invalid requires type (HEX012)
   const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.*Got: (?<actualType>\w+)/);
-  if (invalidRequiresTypeMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_REQUIRES_TYPE,
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:269:7
 
   // Invalid requires type (HEX012)
   const invalidRequiresTypeMatch = message.match(/ERROR\[HEX012\]:.*Got: (?<actualType>\w+)/);
-  if (invalidRequiresTypeMatch?.groups) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_REQUIRES_TYPE,
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error with actual type
statusReason: expected {} to deeply equal { actualType: 'object' }

[Killed] ObjectLiteral
src/errors/parsing.ts:273:16
     return {
       code: ErrorCode.INVALID_REQUIRES_TYPE,
       message,
-      details: { actualType: invalidRequiresTypeMatch.groups.actualType },
+      details: {},
     };
   }
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error with actual type
statusReason: expected {} to deeply equal { actualType: 'object' }

[Killed] BlockStatement
src/errors/parsing.ts:276:41
       details: { actualType: invalidRequiresTypeMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX012\]/)) {
-    return {
-      code: ErrorCode.INVALID_REQUIRES_TYPE,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX012\]/)) {}
 
   // Invalid requires element (HEX013)
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_REQUIRES_TYPE' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:276:7
       details: { actualType: invalidRequiresTypeMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX012\]/)) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_REQUIRES_TYPE,
killedBy: parseError() - HEX012: Invalid Requires Type parses invalid requires type error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_REQUIRES_TYPE' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:286:5
 
   // Invalid requires element (HEX013)
   const invalidRequiresElementMatch = message.match(
-    /ERROR\[HEX013\]: .*'requires\[(?<index>\d+)\]'/
+    /ERROR\[HEX013\]: .'requires\[(?<index>\d+)\]'/
   );
   if (invalidRequiresElementMatch?.groups) {
killedBy: parseError() - HEX013: Invalid Requires Element parses invalid requires element error with index
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_REQUIRES_ELEMENT' // Object.is equality

[Killed] OptionalChaining
src/errors/parsing.ts:288:7
   const invalidRequiresElementMatch = message.match(
     /ERROR\[HEX013\]: .*'requires\[(?<index>\d+)\]'/
   );
-  if (invalidRequiresElementMatch?.groups) {
+  if (invalidRequiresElementMatch.groups) {
     return {
       code: ErrorCode.INVALID_REQUIRES_ELEMENT,
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error with actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] BlockStatement
src/errors/parsing.ts:288:44
   const invalidRequiresElementMatch = message.match(
     /ERROR\[HEX013\]: .*'requires\[(?<index>\d+)\]'/
   );
-  if (invalidRequiresElementMatch?.groups) {
-    return {
-      code: ErrorCode.INVALID_REQUIRES_ELEMENT,
-      message,
-      details: { index: invalidRequiresElementMatch.groups.index },
-    };
-  }
+  if (invalidRequiresElementMatch?.groups) {}
 
   // Invalid lifetime type (HEX014)
killedBy: parseError() - HEX013: Invalid Requires Element parses invalid requires element error with index
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_REQUIRES_ELEMENT' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:298:7
 
   // Invalid lifetime type (HEX014)
   const invalidLifetimeTypeMatch = message.match(/ERROR\[HEX014\]:.*Got: (?<actualType>\w+)/);
-  if (invalidLifetimeTypeMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_LIFETIME_TYPE,
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:298:7
 
   // Invalid lifetime type (HEX014)
   const invalidLifetimeTypeMatch = message.match(/ERROR\[HEX014\]:.*Got: (?<actualType>\w+)/);
-  if (invalidLifetimeTypeMatch?.groups) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_LIFETIME_TYPE,
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error with actual type
statusReason: expected {} to deeply equal { actualType: 'number' }

[Killed] ObjectLiteral
src/errors/parsing.ts:299:12
   // Invalid lifetime type (HEX014)
   const invalidLifetimeTypeMatch = message.match(/ERROR\[HEX014\]:.*Got: (?<actualType>\w+)/);
   if (invalidLifetimeTypeMatch?.groups) {
-    return {
-      code: ErrorCode.INVALID_LIFETIME_TYPE,
-      message,
-      details: { actualType: invalidLifetimeTypeMatch.groups.actualType },
-    };
+    return {};
   }
   if (message.match(/ERROR\[HEX014\]/)) {
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error with actual type
statusReason: expected undefined to be 'INVALID_LIFETIME_TYPE' // Object.is equality

[Killed] ObjectLiteral
src/errors/parsing.ts:302:16
     return {
       code: ErrorCode.INVALID_LIFETIME_TYPE,
       message,
-      details: { actualType: invalidLifetimeTypeMatch.groups.actualType },
+      details: {},
     };
   }
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error with actual type
statusReason: expected {} to deeply equal { actualType: 'number' }

[Killed] ConditionalExpression
src/errors/parsing.ts:305:7
       details: { actualType: invalidLifetimeTypeMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX014\]/)) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_LIFETIME_TYPE,
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_LIFETIME_TYPE' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:305:41
       details: { actualType: invalidLifetimeTypeMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX014\]/)) {
-    return {
-      code: ErrorCode.INVALID_LIFETIME_TYPE,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX014\]/)) {}
 
   // Invalid lifetime value (HEX015)
killedBy: parseError() - HEX014: Invalid Lifetime Type parses invalid lifetime type error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_LIFETIME_TYPE' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:314:51
   }
 
   // Invalid lifetime value (HEX015)
-  const invalidLifetimeValueMatch = message.match(/ERROR\[HEX015\]:.*Got: "(?<actualValue>[^"]+)"/);
+  const invalidLifetimeValueMatch = message.match(/ERROR\[HEX015\]:.*Got: "(?<actualValue>[^"])"/);
   if (invalidLifetimeValueMatch?.groups) {
     return {
killedBy: parseError() - HEX015: Invalid Lifetime Value parses invalid lifetime value error with actual value
statusReason: expected {} to deeply equal { actualValue: 'request' }

[Killed] ConditionalExpression
src/errors/parsing.ts:315:7
 
   // Invalid lifetime value (HEX015)
   const invalidLifetimeValueMatch = message.match(/ERROR\[HEX015\]:.*Got: "(?<actualValue>[^"]+)"/);
-  if (invalidLifetimeValueMatch?.groups) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_LIFETIME_VALUE,
killedBy: parseError() - HEX015: Invalid Lifetime Value parses invalid lifetime value error with actual value
statusReason: expected {} to deeply equal { actualValue: 'request' }

[Killed] ConditionalExpression
src/errors/parsing.ts:315:7
 
   // Invalid lifetime value (HEX015)
   const invalidLifetimeValueMatch = message.match(/ERROR\[HEX015\]:.*Got: "(?<actualValue>[^"]+)"/);
-  if (invalidLifetimeValueMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_LIFETIME_VALUE,
killedBy: parseError() - HEX015: Invalid Lifetime Value parses invalid lifetime value error without actual value
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ObjectLiteral
src/errors/parsing.ts:319:16
     return {
       code: ErrorCode.INVALID_LIFETIME_VALUE,
       message,
-      details: { actualValue: invalidLifetimeValueMatch.groups.actualValue },
+      details: {},
     };
   }
killedBy: parseError() - HEX015: Invalid Lifetime Value parses invalid lifetime value error with actual value
statusReason: expected {} to deeply equal { actualValue: 'request' }

[Killed] ConditionalExpression
src/errors/parsing.ts:322:7
       details: { actualValue: invalidLifetimeValueMatch.groups.actualValue },
     };
   }
-  if (message.match(/ERROR\[HEX015\]/)) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_LIFETIME_VALUE,
killedBy: parseError() - HEX016: Invalid Factory parses invalid factory error with actual type
statusReason: expected 'INVALID_LIFETIME_VALUE' to be 'INVALID_FACTORY' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:322:41
       details: { actualValue: invalidLifetimeValueMatch.groups.actualValue },
     };
   }
-  if (message.match(/ERROR\[HEX015\]/)) {
-    return {
-      code: ErrorCode.INVALID_LIFETIME_VALUE,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX015\]/)) {}
 
   // Invalid factory (HEX016)
killedBy: parseError() - HEX015: Invalid Lifetime Value parses invalid lifetime value error without actual value
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_LIFETIME_VALUE' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:331:45
   }
 
   // Invalid factory (HEX016)
-  const invalidFactoryMatch = message.match(/ERROR\[HEX016\]:.*Got: (?<actualType>\w+)/);
+  const invalidFactoryMatch = message.match(/ERROR\[HEX016\]:.*Got: (?<actualType>\W+)/);
   if (invalidFactoryMatch?.groups) {
     return {
killedBy: parseError() - HEX016: Invalid Factory parses invalid factory error with actual type
statusReason: expected {} to deeply equal { actualType: 'string' }

[Killed] OptionalChaining
src/errors/parsing.ts:332:7
 
   // Invalid factory (HEX016)
   const invalidFactoryMatch = message.match(/ERROR\[HEX016\]:.*Got: (?<actualType>\w+)/);
-  if (invalidFactoryMatch?.groups) {
+  if (invalidFactoryMatch.groups) {
     return {
       code: ErrorCode.INVALID_FACTORY,
killedBy: parseError() - HEX016: Invalid Factory parses invalid factory error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:332:7
 
   // Invalid factory (HEX016)
   const invalidFactoryMatch = message.match(/ERROR\[HEX016\]:.*Got: (?<actualType>\w+)/);
-  if (invalidFactoryMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_FACTORY,
killedBy: parseError() - HEX016: Invalid Factory parses invalid factory error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] ConditionalExpression
src/errors/parsing.ts:339:7
       details: { actualType: invalidFactoryMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX016\]/)) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_FACTORY,
killedBy: parseError() - HEX016: Invalid Factory parses invalid factory error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_FACTORY' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:339:7
       details: { actualType: invalidFactoryMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX016\]/)) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_FACTORY,
killedBy: parseError() - HEX017: Duplicate Requires parses duplicate requires error
statusReason: expected 'INVALID_FACTORY' to be 'DUPLICATE_REQUIRES' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:349:5
 
   // Duplicate requires (HEX017)
   const duplicateRequiresMatch = message.match(
-    /ERROR\[HEX017\]: .*Duplicate port '(?<portName>[^']+)'/
+    /ERROR\[HEX017\]: .*Duplicate port '(?<portName>[^'])'/
   );
   if (duplicateRequiresMatch?.groups) {
killedBy: parseError() - HEX017: Duplicate Requires parses duplicate requires error
statusReason: expected 'UNKNOWN_ERROR' to be 'DUPLICATE_REQUIRES' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:351:7
   const duplicateRequiresMatch = message.match(
     /ERROR\[HEX017\]: .*Duplicate port '(?<portName>[^']+)'/
   );
-  if (duplicateRequiresMatch?.groups) {
+  if (false) {
     return {
       code: ErrorCode.DUPLICATE_REQUIRES,
killedBy: parseError() - HEX017: Duplicate Requires parses duplicate requires error
statusReason: expected 'UNKNOWN_ERROR' to be 'DUPLICATE_REQUIRES' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:351:39
   const duplicateRequiresMatch = message.match(
     /ERROR\[HEX017\]: .*Duplicate port '(?<portName>[^']+)'/
   );
-  if (duplicateRequiresMatch?.groups) {
-    return {
-      code: ErrorCode.DUPLICATE_REQUIRES,
-      message,
-      details: { portName: duplicateRequiresMatch.groups.portName },
-    };
-  }
+  if (duplicateRequiresMatch?.groups) {}
 
   // Invalid finalizer (HEX018)
killedBy: parseError() - HEX017: Duplicate Requires parses duplicate requires error
statusReason: expected 'UNKNOWN_ERROR' to be 'DUPLICATE_REQUIRES' // Object.is equality

[Killed] Regex
src/errors/parsing.ts:360:47
   }
 
   // Invalid finalizer (HEX018)
-  const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.*got (?<actualType>\w+)/);
+  const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.got (?<actualType>\w+)/);
   if (invalidFinalizerMatch?.groups) {
     return {
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error with actual type
statusReason: expected {} to deeply equal { actualType: 'string' }

[Killed] Regex
src/errors/parsing.ts:360:47
   }
 
   // Invalid finalizer (HEX018)
-  const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.*got (?<actualType>\w+)/);
+  const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.*got (?<actualType>\w)/);
   if (invalidFinalizerMatch?.groups) {
     return {
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error with actual type
statusReason: expected { actualType: 's' } to deeply equal { actualType: 'string' }

[Killed] ConditionalExpression
src/errors/parsing.ts:361:7
 
   // Invalid finalizer (HEX018)
   const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.*got (?<actualType>\w+)/);
-  if (invalidFinalizerMatch?.groups) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_FINALIZER,
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error without actual type
statusReason: Cannot read properties of null (reading 'groups')

[Killed] BlockStatement
src/errors/parsing.ts:361:38
 
   // Invalid finalizer (HEX018)
   const invalidFinalizerMatch = message.match(/ERROR\[HEX018\]:.*got (?<actualType>\w+)/);
-  if (invalidFinalizerMatch?.groups) {
-    return {
-      code: ErrorCode.INVALID_FINALIZER,
-      message,
-      details: { actualType: invalidFinalizerMatch.groups.actualType },
-    };
-  }
+  if (invalidFinalizerMatch?.groups) {}
   if (message.match(/ERROR\[HEX018\]/)) {
     return {
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error with actual type
statusReason: expected {} to deeply equal { actualType: 'string' }

[Killed] ConditionalExpression
src/errors/parsing.ts:368:7
       details: { actualType: invalidFinalizerMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX018\]/)) {
+  if (false) {
     return {
       code: ErrorCode.INVALID_FINALIZER,
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_FINALIZER' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:368:41
       details: { actualType: invalidFinalizerMatch.groups.actualType },
     };
   }
-  if (message.match(/ERROR\[HEX018\]/)) {
-    return {
-      code: ErrorCode.INVALID_FINALIZER,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX018\]/)) {}
 
   // Invalid lazy port (HEX019)
killedBy: parseError() - HEX018: Invalid Finalizer parses invalid finalizer error without actual type
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_FINALIZER' // Object.is equality

[Killed] BlockStatement
src/errors/parsing.ts:377:41
   }
 
   // Invalid lazy port (HEX019)
-  if (message.match(/ERROR\[HEX019\]/)) {
-    return {
-      code: ErrorCode.INVALID_LAZY_PORT,
-      message,
-      details: {},
-    };
-  }
+  if (message.match(/ERROR\[HEX019\]/)) {}
 
   // Unknown HEX error format
killedBy: parseError() - HEX019: Invalid Lazy Port parses invalid lazy port error
statusReason: expected 'UNKNOWN_ERROR' to be 'INVALID_LAZY_PORT' // Object.is equality

[Killed] ConditionalExpression
src/errors/parsing.ts:377:7
   }
 
   // Invalid lazy port (HEX019)
-  if (message.match(/ERROR\[HEX019\]/)) {
+  if (true) {
     return {
       code: ErrorCode.INVALID_LAZY_PORT,
killedBy: parseError() - Unknown HEX Error Format returns UNKNOWN_ERROR for unrecognized HEX error format
statusReason: expected 'INVALID_LAZY_PORT' to be 'UNKNOWN_ERROR' // Object.is equality

[Killed] ObjectLiteral
src/errors/parsing.ts:378:12
 
   // Invalid lazy port (HEX019)
   if (message.match(/ERROR\[HEX019\]/)) {
-    return {
-      code: ErrorCode.INVALID_LAZY_PORT,
-      message,
-      details: {},
-    };
+    return {};
   }
 
killedBy: parseError() - HEX019: Invalid Lazy Port parses invalid lazy port error
statusReason: expected undefined to be 'INVALID_LAZY_PORT' // Object.is equality

[Killed] ObjectLiteral
src/errors/parsing.ts:389:14
   return {
     code: ErrorCode.UNKNOWN_ERROR,
     message,
-    details: {
-      rawMessage: message,
-    },
+    details: {},
   };
 }
killedBy: parseError() - Unknown HEX Error Format returns UNKNOWN_ERROR for unrecognized HEX error format
statusReason: expected {} to deeply equal { Object (rawMessage) }
