[Killed] BlockStatement
src/inspection/library-inspector-types.ts:110:79
  * 4. If `subscribe` is present, it must be a function
  * 5. If `dispose` is present, it must be a function
  */
-export function isLibraryInspector(value: unknown): value is LibraryInspector {
-  if (typeof value !== "object" || value === null) {
-    return false;
-  }
-
-  if (!("name" in value) || typeof value.name !== "string" || value.name.length === 0) {
-    return false;
-  }
-
-  if (!("getSnapshot" in value) || typeof value.getSnapshot !== "function") {
-    return false;
-  }
-
-  if ("subscribe" in value && typeof value.subscribe !== "function") {
-    return false;
-  }
-
-  if ("dispose" in value && typeof value.dispose !== "function") {
-    return false;
-  }
-
-  return true;
-}
+export function isLibraryInspector(value: unknown): value is LibraryInspector {}
 
 // =============================================================================
killedBy: isLibraryInspector() returns true for a minimal valid inspector (name + getSnapshot)
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-types.ts:111:52
  * 5. If `dispose` is present, it must be a function
  */
 export function isLibraryInspector(value: unknown): value is LibraryInspector {
-  if (typeof value !== "object" || value === null) {
-    return false;
-  }
+  if (typeof value !== "object" || value === null) {}
 
   if (!("name" in value) || typeof value.name !== "string" || value.name.length === 0) {
killedBy: isLibraryInspector() returns false for null
statusReason: Cannot use 'in' operator to search for 'name' in null

[Killed] ConditionalExpression
src/inspection/library-inspector-types.ts:111:7
  * 5. If `dispose` is present, it must be a function
  */
 export function isLibraryInspector(value: unknown): value is LibraryInspector {
-  if (typeof value !== "object" || value === null) {
+  if (true) {
     return false;
   }
killedBy: isLibraryInspector() returns true for a minimal valid inspector (name + getSnapshot)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/inspection/library-inspector-types.ts:115:7
     return false;
   }
 
-  if (!("name" in value) || typeof value.name !== "string" || value.name.length === 0) {
+  if (!("name" in value) && typeof value.name !== "string" || value.name.length === 0) {
     return false;
   }
killedBy: isLibraryInspector() returns false when name is not a string
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/inspection/library-inspector-types.ts:115:7
     return false;
   }
 
-  if (!("name" in value) || typeof value.name !== "string" || value.name.length === 0) {
+  if (false) {
     return false;
   }
killedBy: isLibraryInspector() returns false when name is missing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/inspection/library-inspector-types.ts:116:12
   }
 
   if (!("name" in value) || typeof value.name !== "string" || value.name.length === 0) {
-    return false;
+    return true;
   }
 
killedBy: isLibraryInspector() returns false for an empty object (missing name and getSnapshot)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/inspection/library-inspector-types.ts:119:7
     return false;
   }
 
-  if (!("getSnapshot" in value) || typeof value.getSnapshot !== "function") {
+  if (false) {
     return false;
   }
killedBy: isLibraryInspector() returns false when getSnapshot is missing
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-types.ts:119:77
     return false;
   }
 
-  if (!("getSnapshot" in value) || typeof value.getSnapshot !== "function") {
-    return false;
-  }
+  if (!("getSnapshot" in value) || typeof value.getSnapshot !== "function") {}
 
   if ("subscribe" in value && typeof value.subscribe !== "function") {
killedBy: isLibraryInspector() returns false when getSnapshot is missing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/inspection/library-inspector-types.ts:120:12
   }
 
   if (!("getSnapshot" in value) || typeof value.getSnapshot !== "function") {
-    return false;
+    return true;
   }
 
killedBy: isLibraryInspector() returns false when getSnapshot is missing
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-types.ts:123:70
     return false;
   }
 
-  if ("subscribe" in value && typeof value.subscribe !== "function") {
-    return false;
-  }
+  if ("subscribe" in value && typeof value.subscribe !== "function") {}
 
   if ("dispose" in value && typeof value.dispose !== "function") {
killedBy: isLibraryInspector() returns false when subscribe is present but not a function
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/inspection/library-inspector-types.ts:123:31
     return false;
   }
 
-  if ("subscribe" in value && typeof value.subscribe !== "function") {
+  if ("subscribe" in value && typeof value.subscribe === "function") {
     return false;
   }
killedBy: isLibraryInspector() returns true for inspector with subscribe and dispose
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/inspection/library-inspector-types.ts:124:12
   }
 
   if ("subscribe" in value && typeof value.subscribe !== "function") {
-    return false;
+    return true;
   }
 
killedBy: isLibraryInspector() returns false when subscribe is present but not a function
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-types.ts:127:66
     return false;
   }
 
-  if ("dispose" in value && typeof value.dispose !== "function") {
-    return false;
-  }
+  if ("dispose" in value && typeof value.dispose !== "function") {}
 
   return true;
killedBy: isLibraryInspector() returns false when dispose is present but not a function
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/inspection/library-inspector-types.ts:127:29
     return false;
   }
 
-  if ("dispose" in value && typeof value.dispose !== "function") {
+  if ("dispose" in value && true) {
     return false;
   }
killedBy: isLibraryInspector() returns true for inspector with subscribe and dispose
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/inspection/library-inspector-types.ts:128:12
   }
 
   if ("dispose" in value && typeof value.dispose !== "function") {
-    return false;
+    return true;
   }
 
killedBy: isLibraryInspector() returns false when dispose is present but not a function
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/inspection/library-inspector-types.ts:159:75
  */
 export function createLibraryInspectorPort<const TName extends string>(
   config: { readonly name: TName; readonly description?: string; readonly tags?: readonly string[] }
-): DirectedPort<LibraryInspector, TName, "outbound", "library-inspector"> {
-  return createPort<TName, LibraryInspector, "outbound", "library-inspector">({
-    ...config,
-    category: "library-inspector",
-    direction: "outbound",
-  });
-}
+): DirectedPort<LibraryInspector, TName, "outbound", "library-inspector"> {}
 
killedBy: createLibraryInspectorPort() creates a port with the given name
statusReason: Cannot read properties of undefined (reading '__portName')

[Killed] StringLiteral
src/inspection/library-inspector-types.ts:163:16
   return createPort<TName, LibraryInspector, "outbound", "library-inspector">({
     ...config,
     category: "library-inspector",
-    direction: "outbound",
+    direction: "",
   });
 }
killedBy: createLibraryInspectorPort() creates a port with 'outbound' direction
statusReason: expected '' to be 'outbound' // Object.is equality
