[Killed] BlockStatement
src/adapters/constants.ts:23:40
  *
  * @internal
  */
-function literal<const T>(value: T): T {
-  return value;
-}
+function literal<const T>(value: T): T {}
 
 // =============================================================================
killedBy: createAdapter - factory variant creates adapter with factory function
statusReason: expected undefined to be 'singleton' // Object.is equality

[Survived] BooleanLiteral
src/adapters/constants.ts:67:29
 /**
  * Literal-typed constant for boolean true.
  */
-export const TRUE = literal(true);
+export const TRUE = literal(false);
 
 /**

[Killed] BooleanLiteral
src/adapters/constants.ts:72:30
 /**
  * Literal-typed constant for boolean false.
  */
-export const FALSE = literal(false);
+export const FALSE = literal(true);
 
 // =============================================================================
killedBy: createAdapter - factory variant creates adapter with factory function
statusReason: expected true to be false // Object.is equality
