[Killed] BlockStatement
src/errors/create-error-group.ts:47:48
   ) => value is Readonly<{ _namespace: NS; _tag: Tag }>;
 } {
   return {
-    create<const Tag extends string>(tag: Tag) {
-      return <const Fields extends Record<string, unknown>>(
-        fields: Fields
-      ): Readonly<{ _namespace: NS; _tag: Tag } & Fields> => {
-        return Object.freeze({ _namespace: namespace, _tag: tag, ...fields });
-      };
-    },
+    create<const Tag extends string>(tag: Tag) {},
 
     is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {
killedBy: BEH-08-003: createErrorGroup create produces error with _namespace and _tag
statusReason: NotFound is not a function

[Killed] BlockStatement
src/errors/create-error-group.ts:50:62
     create<const Tag extends string>(tag: Tag) {
       return <const Fields extends Record<string, unknown>>(
         fields: Fields
-      ): Readonly<{ _namespace: NS; _tag: Tag } & Fields> => {
-        return Object.freeze({ _namespace: namespace, _tag: tag, ...fields });
-      };
+      ): Readonly<{ _namespace: NS; _tag: Tag } & Fields> => {};
     },
 
killedBy: BEH-08-003: createErrorGroup create produces error with _namespace and _tag
statusReason: Cannot read properties of undefined (reading '_namespace')

[Killed] ObjectLiteral
src/errors/create-error-group.ts:51:30
       return <const Fields extends Record<string, unknown>>(
         fields: Fields
       ): Readonly<{ _namespace: NS; _tag: Tag } & Fields> => {
-        return Object.freeze({ _namespace: namespace, _tag: tag, ...fields });
+        return Object.freeze({});
       };
     },
killedBy: BEH-08-003: createErrorGroup create produces error with _namespace and _tag
statusReason: expected undefined to be 'HttpError' // Object.is equality

[Killed] BlockStatement
src/errors/create-error-group.ts:55:77
       };
     },
 
-    is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {
-      if (value === null || value === undefined || typeof value !== "object") {
-        return false;
-      }
-      return (
-        "_namespace" in value &&
-        (value as Record<string, unknown>)._namespace === namespace
-      );
-    },
+    is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {},
 
     isTag<const Tag extends string>(tag: Tag) {
killedBy: BEH-08-003: createErrorGroup .is() returns true for matching namespace
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:56:11
     },
 
     is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {
-      if (value === null || value === undefined || typeof value !== "object") {
+      if (false) {
         return false;
       }
killedBy: BEH-08-003: createErrorGroup .is() returns false for null/undefined/non-objects
statusReason: Cannot use 'in' operator to search for '_namespace' in null

[Killed] ConditionalExpression
src/errors/create-error-group.ts:56:11
     },
 
     is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {
-      if (value === null || value === undefined || typeof value !== "object") {
+      if (false || typeof value !== "object") {
         return false;
       }
killedBy: BEH-08-003: createErrorGroup .is() returns false for null/undefined/non-objects
statusReason: Cannot use 'in' operator to search for '_namespace' in null

[Killed] BooleanLiteral
src/errors/create-error-group.ts:57:16
 
     is(value: unknown): value is Readonly<{ _namespace: NS; _tag: string }> {
       if (value === null || value === undefined || typeof value !== "object") {
-        return false;
+        return true;
       }
       return (
killedBy: BEH-08-003: createErrorGroup .is() returns false for null/undefined/non-objects
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:60:9
         return false;
       }
       return (
-        "_namespace" in value &&
-        (value as Record<string, unknown>)._namespace === namespace
+        false
       );
     },
killedBy: BEH-08-003: createErrorGroup .is() returns true for matching namespace
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/errors/create-error-group.ts:60:9
         return false;
       }
       return (
-        "_namespace" in value &&
-        (value as Record<string, unknown>)._namespace === namespace
+        "_namespace" in value || (value as Record<string, unknown>)._namespace === namespace
       );
     },
killedBy: BEH-08-003: createErrorGroup .is() returns false for non-matching namespace
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:61:9
       }
       return (
         "_namespace" in value &&
-        (value as Record<string, unknown>)._namespace === namespace
+        true
       );
     },
killedBy: BEH-08-003: createErrorGroup .is() returns false for non-matching namespace
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/create-error-group.ts:61:9
       }
       return (
         "_namespace" in value &&
-        (value as Record<string, unknown>)._namespace === namespace
+        (value as Record<string, unknown>)._namespace !== namespace
       );
     },
killedBy: BEH-08-003: createErrorGroup .is() returns true for matching namespace
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors/create-error-group.ts:65:47
       );
     },
 
-    isTag<const Tag extends string>(tag: Tag) {
-      return (
-        value: unknown
-      ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
-        if (
-          value === null ||
-          value === undefined ||
-          typeof value !== "object"
-        ) {
-          return false;
-        }
-        return (
-          "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
-          "_tag" in value &&
-          (value as Record<string, unknown>)._tag === tag
-        );
-      };
-    },
+    isTag<const Tag extends string>(tag: Tag) {},
   };
 }
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: Http.isTag(...) is not a function

[Killed] BlockStatement
src/errors/create-error-group.ts:68:62
     isTag<const Tag extends string>(tag: Tag) {
       return (
         value: unknown
-      ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
-        if (
-          value === null ||
-          value === undefined ||
-          typeof value !== "object"
-        ) {
-          return false;
-        }
-        return (
-          "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
-          "_tag" in value &&
-          (value as Record<string, unknown>)._tag === tag
-        );
-      };
+      ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {};
     },
   };
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:70:11
         value: unknown
       ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
         if (
-          value === null ||
-          value === undefined ||
-          typeof value !== "object"
+          true
         ) {
           return false;
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/errors/create-error-group.ts:70:11
         value: unknown
       ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
         if (
-          value === null ||
+          value !== null ||
           value === undefined ||
           typeof value !== "object"
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/errors/create-error-group.ts:71:11
       ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
         if (
           value === null ||
-          value === undefined ||
+          value !== undefined ||
           typeof value !== "object"
         ) {
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/errors/create-error-group.ts:71:11
       ): value is Readonly<{ _namespace: NS; _tag: Tag }> => {
         if (
           value === null ||
-          value === undefined ||
+          false ||
           typeof value !== "object"
         ) {

[Killed] EqualityOperator
src/errors/create-error-group.ts:72:11
         if (
           value === null ||
           value === undefined ||
-          typeof value !== "object"
+          typeof value === "object"
         ) {
           return false;
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/errors/create-error-group.ts:72:11
         if (
           value === null ||
           value === undefined ||
-          typeof value !== "object"
+          false
         ) {
           return false;

[NoCoverage] BlockStatement
src/errors/create-error-group.ts:73:11
           value === null ||
           value === undefined ||
           typeof value !== "object"
-        ) {
-          return false;
-        }
+        ) {}
         return (
           "_namespace" in value &&

[Killed] LogicalOperator
src/errors/create-error-group.ts:77:11
           return false;
         }
         return (
-          "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
-          "_tag" in value &&
+          "_namespace" in value && (value as Record<string, unknown>)._namespace === namespace || "_tag" in value &&
           (value as Record<string, unknown>)._tag === tag
         );
killedBy: BEH-08-003: createErrorGroup .isTag() returns false for wrong namespace
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/errors/create-error-group.ts:77:11
           return false;
         }
         return (
-          "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
-          "_tag" in value &&
-          (value as Record<string, unknown>)._tag === tag
+          "_namespace" in value && (value as Record<string, unknown>)._namespace === namespace && "_tag" in value || (value as Record<string, unknown>)._tag === tag
         );
       };
killedBy: BEH-08-003: createErrorGroup .isTag() returns false for matching namespace but wrong tag
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:78:11
         }
         return (
           "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
+          true &&
           "_tag" in value &&
           (value as Record<string, unknown>)._tag === tag
killedBy: BEH-08-003: createErrorGroup .isTag() returns false for wrong namespace
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/create-error-group.ts:78:11
         }
         return (
           "_namespace" in value &&
-          (value as Record<string, unknown>)._namespace === namespace &&
+          (value as Record<string, unknown>)._namespace !== namespace &&
           "_tag" in value &&
           (value as Record<string, unknown>)._tag === tag
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/errors/create-error-group.ts:80:11
           "_namespace" in value &&
           (value as Record<string, unknown>)._namespace === namespace &&
           "_tag" in value &&
-          (value as Record<string, unknown>)._tag === tag
+          true
         );
       };
killedBy: BEH-08-003: createErrorGroup .isTag() returns false for matching namespace but wrong tag
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/errors/create-error-group.ts:80:11
           "_namespace" in value &&
           (value as Record<string, unknown>)._namespace === namespace &&
           "_tag" in value &&
-          (value as Record<string, unknown>)._tag === tag
+          (value as Record<string, unknown>)._tag !== tag
         );
       };
killedBy: BEH-08-003: createErrorGroup .isTag() returns true for matching namespace and tag
statusReason: expected false to be true // Object.is equality
