[Killed] BlockStatement
src/constructors/from-promise.ts:33:22
 export function fromPromise<T, E>(
   promise: Promise<T>,
   mapErr: (error: unknown) => E
-): ResultAsync<T, E> {
-  return ResultAsync.fromPromise(promise, mapErr);
-}
+): ResultAsync<T, E> {}
 
 /**
killedBy: BEH-06-003: ResultAsync static constructors (ok, err, fromPromise, fromSafePromise, fromResult, fromThrowable, fromCallback, race) fromPromise(resolved, mapErr) resolves to Ok
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/constructors/from-promise.ts:61:80
  * @since v1.0.0
  * @see {@link spec/result/behaviors/02-creation.md | BEH-02-006}
  */
-export function fromSafePromise<T>(promise: Promise<T>): ResultAsync<T, never> {
-  return ResultAsync.fromSafePromise(promise);
-}
+export function fromSafePromise<T>(promise: Promise<T>): ResultAsync<T, never> {}
 
 /**
killedBy: BEH-06-003: ResultAsync static constructors (ok, err, fromPromise, fromSafePromise, fromResult, fromThrowable, fromCallback, race) fromSafePromise(promise) resolves to Ok
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/constructors/from-promise.ts:102:38
 export function fromAsyncThrowable<A extends readonly unknown[], T, E>(
   fn: (...args: A) => Promise<T>,
   mapErr: (error: unknown) => E
-): (...args: A) => ResultAsync<T, E> {
-  return ResultAsync.fromThrowable(fn, mapErr);
-}
+): (...args: A) => ResultAsync<T, E> {}
 
killedBy: BEH-06-003: ResultAsync static constructors (ok, err, fromPromise, fromSafePromise, fromResult, fromThrowable, fromCallback, race) fromAsyncThrowable(asyncFn, mapErr) wraps async fn
statusReason: safeFn is not a function
