[Killed] BlockStatement
src/do/bind.ts:39:60
 export function bind<N extends string, Ctx extends Record<string, unknown>, T, E>(
   name: Exclude<N, keyof Ctx>,
   f: (ctx: Ctx) => Result<T, E>,
-): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, E> {
-  return (ctx: Ctx) => {
-    const result = f(ctx);
-    if (result.isErr()) {
-      return result as unknown as Result<Ctx & { readonly [K in N]: T }, E>;
-    }
-    return ok({ ...ctx, [name]: result.value } as Ctx & { readonly [K in N]: T });
-  };
-}
+): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, E> {}
 
 /**
killedBy: Do Notation bind (BEH-12-002) [BEH-12-002] adds a named Ok value to the context
statusReason: f is not a function

[Killed] BlockStatement
src/do/bind.ts:40:24
   name: Exclude<N, keyof Ctx>,
   f: (ctx: Ctx) => Result<T, E>,
 ): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, E> {
-  return (ctx: Ctx) => {
-    const result = f(ctx);
-    if (result.isErr()) {
-      return result as unknown as Result<Ctx & { readonly [K in N]: T }, E>;
-    }
-    return ok({ ...ctx, [name]: result.value } as Ctx & { readonly [K in N]: T });
-  };
+  return (ctx: Ctx) => {};
 }
 
killedBy: Do Notation bind (BEH-12-002) [BEH-12-002] adds a named Ok value to the context
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] BlockStatement
src/do/bind.ts:42:25
 ): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, E> {
   return (ctx: Ctx) => {
     const result = f(ctx);
-    if (result.isErr()) {
-      return result as unknown as Result<Ctx & { readonly [K in N]: T }, E>;
-    }
+    if (result.isErr()) {}
     return ok({ ...ctx, [name]: result.value } as Ctx & { readonly [K in N]: T });
   };
killedBy: Do Notation bind (BEH-12-002) [BEH-12-002] short-circuits on Err
statusReason: expected 'Ok' to be 'Err' // Object.is equality

[Killed] ConditionalExpression
src/do/bind.ts:42:9
 ): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, E> {
   return (ctx: Ctx) => {
     const result = f(ctx);
-    if (result.isErr()) {
+    if (true) {
       return result as unknown as Result<Ctx & { readonly [K in N]: T }, E>;
     }
killedBy: Do Notation bind (BEH-12-002) [BEH-12-002] adds a named Ok value to the context
statusReason: expected 42 to deeply equal { a: 42 }

[Killed] BlockStatement
src/do/bind.ts:77:64
 export function let_<N extends string, Ctx extends Record<string, unknown>, T>(
   name: Exclude<N, keyof Ctx>,
   f: (ctx: Ctx) => T,
-): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, never> {
-  return (ctx: Ctx) => {
-    const value = f(ctx);
-    return ok({ ...ctx, [name]: value } as Ctx & { readonly [K in N]: T });
-  };
-}
+): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, never> {}
 
killedBy: Do Notation let_ (BEH-12-003) [BEH-12-003] adds a non-Result computed value to the context
statusReason: f is not a function

[Killed] BlockStatement
src/do/bind.ts:78:24
   name: Exclude<N, keyof Ctx>,
   f: (ctx: Ctx) => T,
 ): (ctx: Ctx) => Result<Ctx & { readonly [K in N]: T }, never> {
-  return (ctx: Ctx) => {
-    const value = f(ctx);
-    return ok({ ...ctx, [name]: value } as Ctx & { readonly [K in N]: T });
-  };
+  return (ctx: Ctx) => {};
 }
 
killedBy: Do Notation let_ (BEH-12-003) [BEH-12-003] adds a non-Result computed value to the context
statusReason: Cannot read properties of undefined (reading '_tag')
