[Killed] BlockStatement
src/fn/and.ts:3:98
 import type { Result } from "../core/types.js";
 
-export function and<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<U, E | F> {
-  return (result) => result.and(other);
-}
+export function and<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<U, E | F> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: and delegates to result.and
statusReason: (0 , __vite_ssr_import_2__.and)(...) is not a function

[Killed] ArrowFunction
src/fn/and.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function and<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<U, E | F> {
-  return (result) => result.and(other);
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: and delegates to result.and
statusReason: Cannot read properties of undefined (reading '_tag')
