[Killed] BlockStatement
src/fn/flatten.ts:3:97
 import type { Result } from "../core/types.js";
 
-export function flatten<T, E1, E2>(): (result: Result<Result<T, E1>, E2>) => Result<T, E1 | E2> {
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  return (result) => (result as any).flatten();
-}
+export function flatten<T, E1, E2>(): (result: Result<Result<T, E1>, E2>) => Result<T, E1 | E2> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: flatten delegates to result.flatten
statusReason: (0 , __vite_ssr_import_2__.flatten)(...) is not a function

[Killed] ArrowFunction
src/fn/flatten.ts:5:10
 
 export function flatten<T, E1, E2>(): (result: Result<Result<T, E1>, E2>) => Result<T, E1 | E2> {
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  return (result) => (result as any).flatten();
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: flatten delegates to result.flatten
statusReason: Cannot read properties of undefined (reading '_tag')
