[Killed] BlockStatement
src/fn/flip.ts:3:70
 import type { Result } from "../core/types.js";
 
-export function flip<T, E>(): (result: Result<T, E>) => Result<E, T> {
-  return (result) => result.flip();
-}
+export function flip<T, E>(): (result: Result<T, E>) => Result<E, T> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: flip delegates to result.flip
statusReason: (0 , __vite_ssr_import_2__.flip)(...) is not a function

[Killed] ArrowFunction
src/fn/flip.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function flip<T, E>(): (result: Result<T, E>) => Result<E, T> {
-  return (result) => result.flip();
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: flip delegates to result.flip
statusReason: Cannot read properties of undefined (reading '_tag')
