[Killed] BlockStatement
src/fn/map-both.ts:3:124
 import type { Result } from "../core/types.js";
 
-export function mapBoth<T, U, E, F>(onOk: (value: T) => U, onErr: (error: E) => F): (result: Result<T, E>) => Result<U, F> {
-  return (result) => result.mapBoth(onOk, onErr);
-}
+export function mapBoth<T, U, E, F>(onOk: (value: T) => U, onErr: (error: E) => F): (result: Result<T, E>) => Result<U, F> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: mapBoth delegates to result.mapBoth on Ok
statusReason: (0 , __vite_ssr_import_2__.mapBoth)(...) is not a function

[Killed] ArrowFunction
src/fn/map-both.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function mapBoth<T, U, E, F>(onOk: (value: T) => U, onErr: (error: E) => F): (result: Result<T, E>) => Result<U, F> {
-  return (result) => result.mapBoth(onOk, onErr);
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: mapBoth delegates to result.mapBoth on Ok
statusReason: Cannot read properties of undefined (reading '_tag')
