[Killed] BlockStatement
src/fn/map-err.ts:3:93
 import type { Result } from "../core/types.js";
 
-export function mapErr<E, F>(f: (error: E) => F): <T>(result: Result<T, E>) => Result<T, F> {
-  return (result) => result.mapErr(f);
-}
+export function mapErr<E, F>(f: (error: E) => F): <T>(result: Result<T, E>) => Result<T, F> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: mapErr delegates to result.mapErr
statusReason: (0 , __vite_ssr_import_2__.mapErr)(...) is not a function

[Killed] ArrowFunction
src/fn/map-err.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function mapErr<E, F>(f: (error: E) => F): <T>(result: Result<T, E>) => Result<T, F> {
-  return (result) => result.mapErr(f);
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: mapErr delegates to result.mapErr
statusReason: Cannot read properties of undefined (reading '_tag')
