[Killed] BlockStatement
src/fn/merge.ts:3:64
 import type { Result } from "../core/types.js";
 
-export function merge<T, E>(): (result: Result<T, E>) => T | E {
-  return (result) => result.merge();
-}
+export function merge<T, E>(): (result: Result<T, E>) => T | E {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: merge delegates to result.merge
statusReason: (0 , __vite_ssr_import_2__.merge)(...) is not a function

[Killed] ArrowFunction
src/fn/merge.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function merge<T, E>(): (result: Result<T, E>) => T | E {
-  return (result) => result.merge();
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: merge delegates to result.merge
statusReason: expected undefined to be 42 // Object.is equality
