[Killed] BlockStatement
src/fn/or.ts:3:97
 import type { Result } from "../core/types.js";
 
-export function or<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<T | U, F> {
-  // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  return (result) => result.or(other) as any;
-}
+export function or<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<T | U, F> {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: or delegates to result.or
statusReason: (0 , __vite_ssr_import_2__.or)(...) is not a function

[Killed] ArrowFunction
src/fn/or.ts:5:10
 
 export function or<U, F>(other: Result<U, F>): <T, E>(result: Result<T, E>) => Result<T | U, F> {
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  return (result) => result.or(other) as any;
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: or delegates to result.or
statusReason: Cannot read properties of undefined (reading '_tag')
