[Killed] BlockStatement
src/fn/pipe.ts:14:70
 // eslint-disable-next-line @typescript-eslint/no-explicit-any
-export function pipe(value: any, ...fns: ((arg: any) => any)[]): any {
-  return fns.reduce((acc, fn) => fn(acc), value);
-}
+export function pipe(value: any, ...fns: ((arg: any) => any)[]): any {}
 
killedBy: Do Notation Usage with pipe() (BEH-12-005) [BEH-12-005] Do notation works with pipe and andThen
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ArrowFunction
src/fn/pipe.ts:15:21
 // eslint-disable-next-line @typescript-eslint/no-explicit-any
 export function pipe(value: any, ...fns: ((arg: any) => any)[]): any {
-  return fns.reduce((acc, fn) => fn(acc), value);
+  return fns.reduce(() => undefined, value);
 }
 
killedBy: Do Notation Usage with pipe() (BEH-12-005) [BEH-12-005] Do notation works with pipe and andThen
statusReason: Cannot read properties of undefined (reading '_tag')
