[Killed] BlockStatement
src/fn/to-nullable.ts:3:72
 import type { Result } from "../core/types.js";
 
-export function toNullable<T, E>(): (result: Result<T, E>) => T | null {
-  return (result) => result.toNullable();
-}
+export function toNullable<T, E>(): (result: Result<T, E>) => T | null {}
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: toNullable delegates to result.toNullable
statusReason: (0 , __vite_ssr_import_2__.toNullable)(...) is not a function

[Killed] ArrowFunction
src/fn/to-nullable.ts:4:10
 import type { Result } from "../core/types.js";
 
 export function toNullable<T, E>(): (result: Result<T, E>) => T | null {
-  return (result) => result.toNullable();
+  return () => undefined;
 }
 
killedBy: BEH-10-001, INV-14: Standalone Functions BEH-10-003: toNullable delegates to result.toNullable
statusReason: expected undefined to be 42 // Object.is equality
