[Killed] BlockStatement
src/option/from-option-json.ts:43:67
  * @since v1.0.0
  * @see spec/result/behaviors/09-option.md — BEH-09-010
  */
-export function fromOptionJSON<T>(json: OptionJSON<T>): Option<T> {
-  if (json._tag === "Some") {
-    return some((json as { value: T }).value);
-  }
-  if (json._tag === "None") {
-    return none();
-  }
-  throw new TypeError(
-    "Invalid Option JSON: expected _tag to be 'Some' or 'None'"
-  );
-}
+export function fromOptionJSON<T>(json: OptionJSON<T>): Option<T> {}
 
killedBy: Option BEH-09-010: fromOptionJSON – deserializes JSON back to branded frozen Option round-trips some(42) through toJSON/fromOptionJSON
statusReason: Cannot read properties of undefined (reading '_tag')

[Killed] ConditionalExpression
src/option/from-option-json.ts:44:7
  * @see spec/result/behaviors/09-option.md — BEH-09-010
  */
 export function fromOptionJSON<T>(json: OptionJSON<T>): Option<T> {
-  if (json._tag === "Some") {
+  if (true) {
     return some((json as { value: T }).value);
   }
killedBy: Option BEH-09-010: fromOptionJSON – deserializes JSON back to branded frozen Option round-trips none() through toJSON/fromOptionJSON
statusReason: expected 'Some' to be 'None' // Object.is equality

[Killed] EqualityOperator
src/option/from-option-json.ts:44:7
  * @see spec/result/behaviors/09-option.md — BEH-09-010
  */
 export function fromOptionJSON<T>(json: OptionJSON<T>): Option<T> {
-  if (json._tag === "Some") {
+  if (json._tag !== "Some") {
     return some((json as { value: T }).value);
   }
killedBy: Option BEH-09-010: fromOptionJSON – deserializes JSON back to branded frozen Option round-trips some(42) through toJSON/fromOptionJSON
statusReason: Invalid Option JSON: expected _tag to be 'Some' or 'None'

[Killed] ConditionalExpression
src/option/from-option-json.ts:47:7
   if (json._tag === "Some") {
     return some((json as { value: T }).value);
   }
-  if (json._tag === "None") {
+  if (true) {
     return none();
   }
killedBy: Option BEH-09-010: fromOptionJSON – deserializes JSON back to branded frozen Option throws TypeError for invalid _tag
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/option/from-option-json.ts:47:7
   if (json._tag === "Some") {
     return some((json as { value: T }).value);
   }
-  if (json._tag === "None") {
+  if (json._tag !== "None") {
     return none();
   }
killedBy: Option BEH-09-010: fromOptionJSON – deserializes JSON back to branded frozen Option round-trips none() through toJSON/fromOptionJSON
statusReason: Invalid Option JSON: expected _tag to be 'Some' or 'None'
