[Killed] BlockStatement
src/unsafe/unwrap-error.ts:37:5
   constructor(
     message: string,
     context: { _tag: "Ok" | "Err"; value: unknown }
-  ) {
-    super(message);
-    this.name = "UnwrapError";
-    this.context = context;
-  }
+  ) {}
 }
 
killedBy: Extraction BEH-04-004: expect(msg) assertive Ok extraction, throws UnwrapError on Err err('x').expect('oops') throws UnwrapError with message 'oops'
statusReason: expected error to be instance of UnwrapError
