[Killed] BlockStatement
src/unsafe/unwrap.ts:22:55
  * @since v1.0.0
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-002
  */
-export function unwrap<T, E>(result: Result<T, E>): T {
-  if (result.isOk()) {
-    return result.value;
-  }
-  throw new UnwrapError("Called unwrap on Err", {
-    _tag: "Err",
-    value: result.error,
-  });
-}
+export function unwrap<T, E>(result: Result<T, E>): T {}
 
 /**
killedBy: [BEH-11-002] unwrap unwrap(ok(42)) returns 42
statusReason: expected undefined to be 42 // Object.is equality

[Killed] ConditionalExpression
src/unsafe/unwrap.ts:23:7
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-002
  */
 export function unwrap<T, E>(result: Result<T, E>): T {
-  if (result.isOk()) {
+  if (true) {
     return result.value;
   }
killedBy: [BEH-11-002] unwrap unwrap(err('x')) throws UnwrapError
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/unsafe/unwrap.ts:23:7
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-002
  */
 export function unwrap<T, E>(result: Result<T, E>): T {
-  if (result.isOk()) {
+  if (false) {
     return result.value;
   }
killedBy: [BEH-11-002] unwrap unwrap(ok(42)) returns 42
statusReason: Called unwrap on Err

[Killed] StringLiteral
src/unsafe/unwrap.ts:26:25
   if (result.isOk()) {
     return result.value;
   }
-  throw new UnwrapError("Called unwrap on Err", {
+  throw new UnwrapError("", {
     _tag: "Err",
     value: result.error,
killedBy: [BEH-11-002] unwrap unwrap(err('x')) throws with message 'Called unwrap on Err'
statusReason: expected [Function] to throw error including 'Called unwrap on Err' but got ''

[Killed] BlockStatement
src/unsafe/unwrap.ts:50:58
  * @since v1.0.0
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-003
  */
-export function unwrapErr<T, E>(result: Result<T, E>): E {
-  if (result.isErr()) {
-    return result.error;
-  }
-  throw new UnwrapError("Called unwrapErr on Ok", {
-    _tag: "Ok",
-    value: result.value,
-  });
-}
+export function unwrapErr<T, E>(result: Result<T, E>): E {}
 
killedBy: [BEH-11-003] unwrapErr unwrapErr(err('x')) returns 'x'
statusReason: expected undefined to be 'x' // Object.is equality

[Killed] ConditionalExpression
src/unsafe/unwrap.ts:51:7
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-003
  */
 export function unwrapErr<T, E>(result: Result<T, E>): E {
-  if (result.isErr()) {
+  if (false) {
     return result.error;
   }
killedBy: [BEH-11-003] unwrapErr unwrapErr(err('x')) returns 'x'
statusReason: Called unwrapErr on Ok

[Killed] ConditionalExpression
src/unsafe/unwrap.ts:51:7
  * @see spec/result/behaviors/11-unsafe.md — BEH-11-003
  */
 export function unwrapErr<T, E>(result: Result<T, E>): E {
-  if (result.isErr()) {
+  if (true) {
     return result.error;
   }
killedBy: [BEH-11-003] unwrapErr unwrapErr(ok(42)) throws UnwrapError
statusReason: expected function to throw an error, but it didn't
